{
  "generated": "2025-09-20T05:34:17.218147Z",
  "items": [
    {
      "pmid": "40965864",
      "doi": "10.1001/jamaoncol.2025.3497",
      "title": "Neoadjuvant Chemoimmunotherapy in Stage III Non-Small Cell Lung Cancer-Reply.",
      "journal": "JAMA oncology",
      "pubdate": "2025-09-18T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": "SJR",
      "metric_value": 8.377,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40965864/",
      "url_doi": "https://doi.org/10.1001/jamaoncol.2025.3497",
      "abstract": null
    },
    {
      "pmid": "40965918",
      "doi": "10.1001/jamaoncol.2025.3491",
      "title": "Neoadjuvant Chemoimmunotherapy in Stage III Non-Small Cell Lung Cancer.",
      "journal": "JAMA oncology",
      "pubdate": "2025-09-18T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": "SJR",
      "metric_value": 8.377,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40965918/",
      "url_doi": "https://doi.org/10.1001/jamaoncol.2025.3491",
      "abstract": null
    },
    {
      "pmid": "40965878",
      "doi": "10.1001/jamaoncol.2025.3494",
      "title": "Neoadjuvant Chemoimmunotherapy in Stage III Non-Small Cell Lung Cancer.",
      "journal": "JAMA oncology",
      "pubdate": "2025-09-18T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": "SJR",
      "metric_value": 8.377,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40965878/",
      "url_doi": "https://doi.org/10.1001/jamaoncol.2025.3494",
      "abstract": null
    },
    {
      "pmid": "40961225",
      "doi": "10.1126/scitranslmed.adr3718",
      "title": "PD-1-targeted cis-delivery of an IL-2 variant induces a multifaceted antitumoral T cell response in human lung cancer.",
      "journal": "Science translational medicine",
      "pubdate": "2025-09-17T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": "SJR",
      "metric_value": 6.722,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40961225/",
      "url_doi": "https://doi.org/10.1126/scitranslmed.adr3718",
      "abstract": "Antibody-cytokine fusion proteins are being developed as next-generation cancer immunotherapies, aiming to deliver activation signals to targeted immune populations. Among these, PD1-IL2v-an engineered interleukin-2 variant (IL-2v) lacking CD25 binding, fused to a high-affinity programmed cell death protein 1 (PD-1) blocking antibody-has shown promising results in murine tumor models. Here, using human model systems, we show that PD1-IL2v elicits a multifaceted antitumor T cell response by targeting both CD8"
    },
    {
      "pmid": "40966319",
      "doi": "10.1158/0008-5472.CAN-24-4887",
      "title": "Loss of UXS1 Selectively Depletes Pyrimidines and Induces Replication Stress in KEAP1-Mutant Lung Cancer.",
      "journal": "Cancer research",
      "pubdate": "2025-09-18T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": "SJR",
      "metric_value": 3.879,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40966319/",
      "url_doi": "https://doi.org/10.1158/0008-5472.CAN-24-4887",
      "abstract": "Kelch-like ECH associated protein 1 (KEAP1) is the third most commonly mutated gene in non-small cell lung cancer (NSCLC) and is associated with poor prognosis. Here, we investigated synthetic lethal interaction genes in KEAP1-mutated cancer cells and identified a dependency on UDP xylose synthase 1 (UXS1), which converts UDP-glucuronic acid (UDP-GlcA) to UDP-xylose in the proteoglycan synthetic pathway. UDP glucose dehydrogenase (UGDH), a transcriptional target of NRF2 that converts UDP-glucose to UDP-GlcA, was highly expressed in KEAP1-mutant tumors. Upon UXS1 knockdown, depletion of UDP-xylose occurred in both KEAP1-mutant and wildtype (WT) cells, whereas UDP-GlcA accumulated to a greater extent in the KEAP1-mutant setting. The resulting shortage of available UDP and other pyrimidines slowed S-phase progression and stalled DNA replication fork marks, causing cells to undergo prolonged cell-cycle exit or apoptosis. Dependency on UXS1 was rescued by knocking out UGDH to prevent UDP-GlcA accumulation and UDP depletion. DNA replication stress in UXS1-depleted cells sensitized them to clinical cell-cycle checkpoint inhibitors. Further, CRISPR screening experiments identified genes that modulate UXS1 dependency. While liver had the highest normal tissue expression of UGDH, UXS1 knockout in the liver did not result in hepatotoxicity. Taken together, these data demonstrate that UXS1 is a selective dependency in KEAP1-mutant tumors and loss of UXS1 creates additional therapeutically exploitable vulnerabilities in KEAP1-mutant tumors."
    },
    {
      "pmid": "40923935",
      "doi": "10.1002/cncr.70081",
      "title": "Real-world outcomes of neoadjuvant chemoimmunotherapy in patients with nonsmall cell lung cancer: Predictors of surgery, pathologic complete response, and event-free survival.",
      "journal": "Cancer",
      "pubdate": "2025-09-15T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "SCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": "SJR",
      "metric_value": 2.947,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40923935/",
      "url_doi": "https://doi.org/10.1002/cncr.70081",
      "abstract": "BACKGROUND: Trials of neoadjuvant chemoimmunotherapy (chemoIO) have changed the standard of care for resectable nonsmall cell lung cancer (NSCLC). This study characterizes the outcomes of off-trial patients who received treatment with neoadjuvant chemoIO.\n\nMETHODS: The authors analyzed records of patients with stage IB-III NSCLC who received neoadjuvant chemoIO with an intent to proceed to surgical resection at three US academic institutions. Clinical, demographic, and pathologic factors were incorporated in univariable and multivariable regression models to identify associations with outcomes (resection status, pathologic complete response [pCR], and subsequent event-free survival [EFS]) after standard-of-care neoadjuvant chemoIO.\n\nRESULTS: Analyses included 115 patients, of whom 63% had stage III disease, 77% completed three cycles of chemoIO, and 78% underwent surgical resection. Ages older than 72 years versus 64 years and younger were associated with not proceeding to surgery in univariable (p = .006) and multivariable (p = .014) regression analyses. Nineteen patients (17%) had tumors with a pCR, and 34 (30%) had a major pathologic response. Positive programmed death-ligand 1 (PD-L1) expression (≥50%; vs. negative PD-L1 expression: odds ratio, 12.1; 95% confidence interval, 2.0-73.7; p = .007) and KRAS mutations (vs. wild-type KRAS: odds ratio, 3.9; 95% confidence interval, 1.07-14.4; p = .039) were associated with a higher probability of pCR in univariable analysis. The median event-free survival was not reached and did not differ among subgroups stratified by key clinical variables.\n\nCONCLUSIONS: The results from this study confirm the trial experience of high pCR rates after neoadjuvant chemoIO. This supports the use of chemoIO irrespective of KRAS mutation status, PD-L1 expression, and histology, but suggests that this approach may be less suitable for older patients."
    },
    {
      "pmid": "40189749",
      "doi": "10.1080/2162402X.2025.2484880",
      "title": "Surrogate markers of intestinal dysfunction associated with survival in advanced cancers.",
      "journal": "Oncoimmunology",
      "pubdate": "2025-12-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://doi.org/10.1080/2162402x.2025.2484880",
      "metric_name": "SJR",
      "metric_value": 2.542,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40189749/",
      "url_doi": "https://doi.org/10.1080/2162402X.2025.2484880",
      "abstract": "Deviations in the diversity and composition of the gut microbiota are called \"gut dysbiosis\". They have been linked to various chronic diseases including cancers and resistance to immunotherapy. Stool shotgun based-metagenomics informs on the ecological composition of the gut microbiota and the prevalence of homeostatic bacteria such as"
    },
    {
      "pmid": "40946254",
      "doi": "10.1007/s40487-025-00378-8",
      "title": "First-Line Tislelizumab Plus Chemotherapy in Advanced Non-Squamous Non-Small Cell Lung Cancer: PD-L1 ≥ 50% Subgroup Analysis from the RATIONALE-304 Trial.",
      "journal": "Oncology and therapy",
      "pubdate": "2025-09-14T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Preclinical",
      "is_oa": false,
      "oa_url": null,
      "metric_name": "SJR",
      "metric_value": 1.33,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40946254/",
      "url_doi": "https://doi.org/10.1007/s40487-025-00378-8",
      "abstract": "INTRODUCTION: RATIONALE-304 compared first-line tislelizumab (a programmed cell death protein 1 inhibitor) plus chemotherapy versus chemotherapy in advanced non-squamous non-small cell lung cancer (nsq-NSCLC). This exploratory analysis focused on patients with tumor cell programmed death ligand 1 (PD-L1) expression ≥ 50%.\n\nMETHODS: Patients with stage IIIB/IV nsq-NSCLC were randomized (2:1) to tislelizumab plus platinum-based chemotherapy and pemetrexed every 3 weeks, followed by maintenance tislelizumab and pemetrexed, or platinum-based chemotherapy and pemetrexed followed by maintenance pemetrexed. The primary endpoint was independent review committee (IRC)-assessed progression-free survival (PFS); secondary endpoints included overall survival (OS), IRC-assessed objective response rates, and safety.\n\nRESULTS: The PD-L1 ≥ 50% population included 110 patients (tislelizumab plus chemotherapy, n = 74; chemotherapy, n = 36); 71.8% (n = 79) were male and 28.2% (n = 31) were female. Consistent with the final analysis (median follow-up 16.5 months), the 4-year follow-up data (median follow-up 23.4 months) continued to show an improvement in median PFS (17.2 vs. 4.6 months; stratified HR 0.29, 95% CI 0.17-0.50) and median OS (41.9 vs. 13.1 months; stratified HR 0.38, 95% CI 0.23-0.62) for patients who received tislelizumab plus chemotherapy versus chemotherapy. An additional post hoc analysis showed no significant differences in PFS or OS between PD-L1 50-89% and ≥ 90% subgroups in the tislelizumab plus chemotherapy arm. The safety profile of tislelizumab plus chemotherapy was manageable and consistent with previous analyses.\n\nCONCLUSIONS: In patients with advanced nsq-NSCLC and PD-L1 tumor cell expression ≥ 50%, first-line tislelizumab plus chemotherapy demonstrated clinically meaningful improvement in PFS and OS versus chemotherapy. Efficacy was consistent across subgroups of patients with high PD-L1 tumor cell expression levels (50-89% and ≥ 90%).\n\nTRIAL REGISTRATION: Clinical Trials.gov NCT03663205."
    },
    {
      "pmid": "40963055",
      "doi": "10.1007/s10637-025-01583-y",
      "title": "Phase I results on the efficacy, safety and pharmacokinetics of lurbinectedin and irinotecan in advanced solid tumors.",
      "journal": "Investigational new drugs",
      "pubdate": "2025-09-18T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://doi.org/10.1007/s10637-025-01583-y",
      "metric_name": "SJR",
      "metric_value": 1.074,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40963055/",
      "url_doi": "https://doi.org/10.1007/s10637-025-01583-y",
      "abstract": "Lurbinectedin and irinotecan showed synergistic antitumor activity when combined in preclinical studies, and have non-completely overlapping toxicity profiles. A two-stage phase I/II trial was designed to evaluate the combination. The first (dose escalation) stage of the trial assessed two schedules, lurbinectedin on Day (D)1 plus irinotecan on D1,D8 or D1 every three weeks in 83 patients with relapsed advanced solid tumors. Two recommended doses (RDs) were defined for lurbinectedin on D1 plus irinotecan on D1,D8: lurbinectedin 2.0 mg/m"
    },
    {
      "pmid": "40684711",
      "doi": "10.1016/j.ejrad.2025.112290",
      "title": "Comparison of nodule volumetric classification by using two different nodule segmentation algorithms in an LDCT lung cancer baseline screening dataset.",
      "journal": "European journal of radiology",
      "pubdate": "2025-10-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": "SJR",
      "metric_value": 1.003,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40684711/",
      "url_doi": "https://doi.org/10.1016/j.ejrad.2025.112290",
      "abstract": "OBJECTIVES: To investigate the performance of two segmentation algorithms for nodule volumetric classification at participant/scan level in the NELCIN-B3 cohort (Netherlands and China Big-3), a lung cancer screening program (LCS) using low-dose CT (LDCT).\n\nMETHODS: Baseline scans with qualified LDCT images from consecutive NELCIN-B3 participants were included from June 2017 to July 2018. Performance of two software algorithms were independently evaluated by two radiologists: software A (Syngo.via VB30A) by reader 1 and software B (AVIEW v1.1.39.14) by reader 2. According to the NELSON2.0 protocol, nodules with a solid component ≥ 100 mm\n\nRESULTS: In total, 300 participants were evaluated comprising 159 women (53.0 %) and 193 (64.3 %) never smokers, with a mean ± standard deviation age of 61.2 ± 7.1 years. There were disagreements in 17 cases: in 11 (11/300, 3.7 %), this was due to differences in nodule selection and nodule type classification between readers; and in 6 (6/300, 2.0 %), this was due to variations in nodule volume metrics between algorithms. Inter-software agreement was almost perfect (κ = 0.88 [95 %CI: 0.83-0.93]). In the consensus read, reader 1/software A generated 12 misclassifications (11 PM, 1 NM), giving a negative predictive value of 99.6 % (95 % CI: 98.9 %-100.0 %). Reader 2/software B generated 5 misclassifications (2 PM, 3 NM), giving a negative predictive value of 98.9 % (95 % CI: 97.7 %-100.0 %).\n\nCONCLUSION: Two software algorithms (Syngo.via VB30A and AVIEW v1.1.39.14) showed comparable performance for lung nodule volumetric classification at participant/scan level. Further research is needed to confirm the results in other LDCT LCS programs."
    },
    {
      "pmid": "40168159",
      "doi": "10.1080/17581966.2025.2477411",
      "title": "The association between blood-based HYAL2 methylation and early-stage lung cancer: a case-control study.",
      "journal": "Lung cancer management",
      "pubdate": "2025-12-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://doi.org/10.1080/17581966.2025.2477411",
      "metric_name": "SJR",
      "metric_value": 0.506,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40168159/",
      "url_doi": "https://doi.org/10.1080/17581966.2025.2477411",
      "abstract": "BACKGROUND: Blood-based DNA methylation biomarkers have great potential for the early detection of lung cancer (LC). Here, we investigated the association between\n\nMETHODS: Matrix-assisted laser desorption ionization time-of-flight (MALDI-TOF) mass spectrometry was performed to measure the methylation levels of 4 CpG sites in\n\nRESULTS: Hypomethylation of all 4 CpG sites in\n\nCONCLUSIONS: Our results suggested blood-based"
    },
    {
      "pmid": "40795195",
      "doi": "10.1200/JCO-25-01259",
      "title": "Modern Targeted Radiation in Patients With Brain Metastases From Small Cell Lung Cancer.",
      "journal": "Journal of clinical oncology : official journal of the American Society of Clinical Oncology",
      "pubdate": "2025-09-20T00:00:00+00:00",
      "pubtypes": [
        "Editorial"
      ],
      "entity": "SCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40795195/",
      "url_doi": "https://doi.org/10.1200/JCO-25-01259",
      "abstract": null
    },
    {
      "pmid": "40706016",
      "doi": "10.1200/JCO-25-00363",
      "title": "Phase I Dose-Escalation Results for the Delta-Like Ligand 3/CD3 IgG-Like T-Cell Engager Obrixtamig (BI 764532) in Patients With Delta-Like Ligand 3+ Small Cell Lung Cancer or Neuroendocrine Carcinomas.",
      "journal": "Journal of clinical oncology : official journal of the American Society of Clinical Oncology",
      "pubdate": "2025-09-20T00:00:00+00:00",
      "pubtypes": [
        "Journal Article",
        "Multicenter Study"
      ],
      "entity": "SCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://doi.org/10.1200/jco-25-00363",
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40706016/",
      "url_doi": "https://doi.org/10.1200/JCO-25-00363",
      "abstract": "PURPOSE: We report phase I results for obrixtamig (BI 764532), a delta-like ligand 3 (DLL3)/CD3 IgG-like T-cell engager, in patients with previously treated DLL3-positive small cell lung cancer (SCLC), extrapulmonary neuroendocrine carcinomas (epNECs), or large cell neuroendocrine carcinoma of the lung (LCNEC-L).\n\nMETHODS: Patients received escalating intravenous obrixtamig doses using four regimens: a fixed dose once every 3 weeks (A); a fixed dose once weekly (B1); a step-up dose once weekly for two weeks and target dose once weekly (B2); and a step-up dose once weekly for 3 weeks, target dose once weekly for 3 weeks, and once every 3 weeks thereafter (B3). The primary objective was maximum tolerated dose (MTD). Secondary objectives included safety, pharmacokinetics, and tumor response (RECIST v1.1).\n\nRESULTS: As of February 21, 2024, 168 patients received obrixtamig, 72% received ≥2 lines of previous anticancer therapy, and 51% received previous anti-PD-1/PD-L1 therapy. Seven dose-limiting toxicities occurred during MTD evaluation (Regimen A, n = 1; Regimen B2, n = 6). MTD was not reached. The most common treatment-related adverse event was cytokine release syndrome (any grade: 57%; grade ≥3: 3%); most cases occurred early and were reversible. Across all doses, regimens, and tumor types, the overall response rate (ORR) was 23% (95% CI, 17.4% to 30.2%), the median duration of response (DoR) was 8.5 months (95% CI, 6.2 to not reached), and the 6-month DoR rate was 70% (95% CI, 53% to 88%). All patients in Regimens B2/B3 received the minimum effective dose (≥90 μg/kg once weekly or once every 3 weeks), achieving an ORR of 28% (95% CI, 20.7% to 35.9%). With Regimens B2/B3, ORRs were 21% (95% CI, 12.9% to 33.1%), 27% (95% CI, 17.4% to 39.6%), and 70% (95% CI, 39.7% to 89.2%) for SCLC, epNECs, and LCNEC-L, respectively.\n\nCONCLUSION: The demonstrated tolerability and efficacy of obrixtamig regimens, administered as step-up followed by target doses of 90-1,080 μg/kg (once weekly or once every 3 weeks), in patients with heavily pretreated DLL3-positive tumors support further exploration in SCLC, epNEC, and LCNEC-L."
    },
    {
      "pmid": "40973832",
      "doi": "10.1038/s41586-025-09638-z",
      "title": "Publisher Correction: Functional synapses between neurons and small cell lung cancer.",
      "journal": "Nature",
      "pubdate": "2025-09-19T00:00:00+00:00",
      "pubtypes": [
        "Published Erratum"
      ],
      "entity": "SCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://doi.org/10.1038/s41586-025-09638-z",
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40973832/",
      "url_doi": "https://doi.org/10.1038/s41586-025-09638-z",
      "abstract": null
    },
    {
      "pmid": "40963028",
      "doi": "10.1038/s41586-025-09503-z",
      "title": "Basal cell of origin resolves neuroendocrine-tuft lineage plasticity in cancer.",
      "journal": "Nature",
      "pubdate": "2025-09-17T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://doi.org/10.1038/s41586-025-09503-z",
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40963028/",
      "url_doi": "https://doi.org/10.1038/s41586-025-09503-z",
      "abstract": "Neuroendocrine and tuft cells are rare chemosensory epithelial lineages defined by the expression of ASCL1 and POU2F3 transcription factors, respectively. Neuroendocrine cancers, including small cell lung cancer (SCLC), frequently display tuft-like subsets, a feature linked to poor patient outcomes"
    },
    {
      "pmid": "40957950",
      "doi": "10.1038/s41388-025-03571-1",
      "title": "PLK1-mediated PDHA1 phosphorylation drives metabolic reprogramming in lung cancer.",
      "journal": "Oncogene",
      "pubdate": "2025-09-16T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40957950/",
      "url_doi": "https://doi.org/10.1038/s41388-025-03571-1",
      "abstract": "Although the involvement of polo-like kinase 1 (PLK1) in metabolic reprogramming from oxidative phosphorylation (OXPHOS) to glycolysis has been previously described, the underlying molecular mechanism remains unclear. Pyruvate dehydrogenase (PDH) catalyzes the conversion of pyruvate into acetyl-CoA, the starting material for the tricarboxylic acid (TCA) cycle. In a companion study by Zhang et al., we demonstrated that PLK1 phosphorylation of PDHA1 at threonine 57 (PDHA1-T57) drives its protein degradation via mitophagy activation. Using a stable-isotope resolved metabolomics (SIRM) approach, we now show that PLK1 phosphorylation of PDHA1-T57 results in metabolic reprogramming from OXPHOS to glycolysis. Notably, cells mimicking PDHA1-T57 phosphorylation rely more on the aspartate-malate shuttle than on glucose-derived pyruvate to sustain the TCA cycle. This metabolic shift was also observed in mouse embryonic fibroblasts (MEFs) and transgenic mice conditionally expressing the PDHA1-T57D variant, highlighting the role of PLK1 in metabolic reprogramming in vivo. It is well-established that pyruvate dehydrogenase kinase (PDK)-mediated phosphorylation of PDH leads to its inactivation and that dichloroacetic acid (DCA), a PDK inhibitor, has been investigated in preclinical and early clinical studies as a potential therapeutic agent for lung cancer. We demonstrated that DCA combined with Onvansertib, a PLK1 inhibitor, synergistically inhibits lung tumor growth by enhancing mitochondrial ROS, inhibiting glycolysis, and inducing apoptosis. This study aims to elucidate how PLK1-associated activity drives the metabolic reprogramming from OXPHOS to glycolysis during cellular transformation, thereby contributing to lung carcinogenesis. Our results provide support for a clinical trial to evaluate the efficacy of Onvansertib plus DCA in treating lung cancer."
    },
    {
      "pmid": "40910999",
      "doi": "10.1080/14712598.2025.2555830",
      "title": "Neoadjuvant therapy of NSCLC: a review of the use and impact of monoclonal antibodies.",
      "journal": "Expert opinion on biological therapy",
      "pubdate": "2025-09-16T00:00:00+00:00",
      "pubtypes": [
        "Journal Article",
        "Review"
      ],
      "entity": "NSCLC",
      "trial_type": "Review/Meta",
      "study_class": "Review",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40910999/",
      "url_doi": "https://doi.org/10.1080/14712598.2025.2555830",
      "abstract": "INTRODUCTION: From the 1960s and up until 2021, neoadjuvant chemotherapy has represented the standard of care for potentially resectable stage III (N2) Non-Small Cell Lung Cancer (NSCLC). However, in recent years, immunotherapy in the form of Immune Checkpoint Inhibitors (ICIs) has revolutionized oncology treatment strategies and several ICIs have been investigated for the neoadjuvant treatment of NSCLC, both in monotherapy and in combination with other ICIs or chemotherapy.\n\nAREAS COVERED: Therefore, this paper aims to review the currently available data supporting the role of immunotherapy in the neoadjuvant setting, as well as to discuss the challenges associated with it. We undertook a comprehensive literature search of PubMed, Embase, Cochrane Library, of abstracts and posters from annual meetings of American Society of Clinical Oncology (ASCO), European Society for Medical Oncology (ESMO), and American Association for Cancer Research (AACR) up until November 2024.\n\nEXPERT OPINION: We believe that in the near future ICI plus chemotherapy combinations will represent the new recommended standard of care in the neoadjuvant/perioperative setting. We look forward to the full results coming from the ongoing randomized phase III trials, that will help us guide our choice in terms of patient selection, regimen of choice, and response assessment."
    },
    {
      "pmid": "40967135",
      "doi": "10.1016/j.lungcan.2025.108755",
      "title": "Prognostic implications of uncommon EGFR exon 19 deletion-insertion mutations in non-small cell lung cancer treated with third-generation EGFR-TKIs.",
      "journal": "Lung cancer (Amsterdam, Netherlands)",
      "pubdate": "2025-09-15T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Preclinical",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40967135/",
      "url_doi": "https://doi.org/10.1016/j.lungcan.2025.108755",
      "abstract": "PURPOSE: The sensitivity of various epidermal growth factor receptor (EGFR) mutations to different EGFR tyrosine kinase inhibitors (EGFR-TKI) varies significantly. This study evaluated the survival outcomes of patients with advanced non-small cell lung cancer (NSCLC) harboring EGFR exon 19 deletion-insertion (19delins) to third-generation EGFR-TKIs administered as first- or second-line therapy.\n\nMETHODS: We retrospectively analyzed clinical, molecular, and survival data from 215 patients detected with EGFR 19delins between March 2020 and July 2024. To evaluate progression-free survival, 57 patients with EGFR 19del who received first-line third-generation EGFR-TKIs (cohort A), and 48 patients who received the same treatment as second-line therapy (cohort B) were selected using 1:1 propensity score matching and served as control group.\n\nRESULTS: Thirty-nine unique EGFR 19delins genotypes were identified, with L747_P753delinsS (34.0 %), L747_A750delinsP (18.1 %), and E746_S752delinsV (9.8 %) being the top three variants. Patients with EGFR 19delins had significantly shorter median PFS compared with patients with common exon19del (first-line, 12.9 vs. 19.7 months, p = 0.0039; second-line, 7.9 vs. 10.5 months, p = 0.0387). Exploratory analyses indicated that L747_P753delinsS might be associated with poorer prognosis, while E746_S752delinsV appeared to show better outcomes with third-generation EGFR-TKIs, findings that require further validation.\n\nCONCLUSION: These findings show real-world evidence that patients with EGFR 19delins derive limited clinical benefit from third-generation EGFR-TKI therapy compared to those with common EGFR 19del mutations, suggesting the need for optimal treatment regimen in this patient population."
    },
    {
      "pmid": "40962011",
      "doi": "10.1016/j.ejphar.2025.178168",
      "title": "Prognostic implications of antitumour efficacy and adverse events of EGFR-TKIs in non-small cell lung cancer: an ambispective cohort study.",
      "journal": "European journal of pharmacology",
      "pubdate": "2025-09-15T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40962011/",
      "url_doi": "https://doi.org/10.1016/j.ejphar.2025.178168",
      "abstract": "The objective of this study was to quantify the impact of longitudinal tumour dynamics, time-varying drug-related adverse events (DRAEs), and other clinical characteristics on long-term outcomes in patients with non-small cell lung cancer (NSCLC) treated with epidermal growth factor receptor tyrosine kinase inhibitors (EGFR-TKIs). An ambispective cohort of 277 patients was analysed and externally validated using independent clinical trial data from 470 patients in the Project Data Sphere. Individual tumour growth trajectories were characterised by predicted sum of the longest diameters (SLD) using tumour growth inhibition (TGI) modelling. Time-dependent Cox and parametric time-to-event models were then applied to evaluate the influence of predicted tumour growth trajectories, observed dynamic DRAE profiles, cross-sectional variables derived from these measures, and additional covariates on time-to-treatment failure (TTF) and progression-free survival (PFS). The TGI models effectively captured individual tumour dynamics. Across both Cox and parametric time-to-event models, prognostic factors consistently included DRAEs, baseline metastasis, EGFR-TKI treatment history, and the specific EGFR-TKI administered. Notably, grade 2 DRAEs were associated with an optimal balance between efficacy and safety, and this association remained robust in sensitivity analyses and was preliminarily validated using external data. These findings emphasise the clinical relevance of DRAE grades in indicating long-term clinical benefit. By linking manageable toxicity with durable therapeutic outcomes, the study provides valuable insights for developing safe and effective EGFR-TKI treatment strategies in patients with NSCLC."
    },
    {
      "pmid": "40972189",
      "doi": "10.1016/j.lungcan.2025.108751",
      "title": "Efficacy and safety of taxane versus gemcitabine for advanced stage lung squamous cell carcinoma in global EHR-based retrospective cohorts: A pairwise propensity score-matched comparison.",
      "journal": "Lung cancer (Amsterdam, Netherlands)",
      "pubdate": "2025-09-14T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40972189/",
      "url_doi": "https://doi.org/10.1016/j.lungcan.2025.108751",
      "abstract": "BACKGROUND: Lung squamous cell carcinoma represents a significant global health challenge, with platinum-based chemotherapy regimens remaining a cornerstone of treatment. While both Taxanes and Gemcitabine are recommended as category 1 treatment options by the National Comprehensive Cancer Network (NCCN), their comparative effectiveness in real-world settings requires further investigation.\n\nMETHODS: This retrospective cohort study utilized the TriNetX global collaborative network to analyze data between January 1, 1990, and October 31, 2024. Adults with stage IV lung squamous cell carcinoma were identified using ICD-10 code C34 and the TriNetX oncology disease classification system. Patients were categorized into Taxane and Gemcitabine groups. Propensity score matching was employed to minimize selection bias. Primary and secondary outcomes included overall survival, progression-free survival, and adverse events.\n\nRESULTS: A total of 992 patients were included, with 203 patients in each group after propensity score matching. The Taxane group demonstrated significantly improved overall survival compared to the Gemcitabine group (HR: 0.638, 95 % CI: 0.497-0.0821, p = 0.0004). Progression-free survival also showed statistically significant benefit over the Taxane group (HR: 0.686, 95 % CI: 0.532-0.885, p = 0.0035). Pairwise analysis revealed that Paclitaxel demonstrated superiority compared to both Docetaxel and Gemcitabine. The incidence of adverse events was comparable between groups.\n\nCONCLUSIONS: Our findings demonstrate that Taxane, particularly Paclitaxel, offers superiority compared to Gemcitabine in patients with advanced lung squamous cell carcinoma, with comparable safety profile. These results support the prioritization of Taxane-based regimens in clinical practice. Future research should focus on combination strategies with immunotherapy to enhance treatment outcomes."
    }
  ]
}