{
  "generated": "2026-02-15T05:55:29.140575Z",
  "items": [
    {
      "pmid": "41678173",
      "doi": "10.1001/jamaoncol.2025.6430",
      "title": "Ancestry-Associated Performance Variability of Open-Source AI Models for EGFR Prediction in Lung Cancer.",
      "journal": "JAMA oncology",
      "pubdate": "2026-02-12T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://jamanetwork.com/journals/jamaoncology/articlepdf/2844908/jamaoncology_rakaee_2026_br_250011_1770226526.41753.pdf",
      "metric_name": "SJR",
      "metric_value": 8.377,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41678173/",
      "url_doi": "https://doi.org/10.1001/jamaoncol.2025.6430",
      "abstract": "IMPORTANCE: Artificial intelligence (AI) models are emerging as rapid, low-cost tools for predicting targetable genomic alterations directly from routine pathology slides. Although these approaches could accelerate treatment decisions in lung cancer, little is known about whether their performance is consistent across diverse patient populations and tissue contexts.\n\nOBJECTIVE: To evaluate the performance and generalizability of 2 open-source AI pathology models for predicting EGFR mutation status in lung adenocarcinoma (LUAD) across independent cohorts and ancestral subgroups.\n\nDESIGN, SETTING, AND PARTICIPANTS: This cohort study included patients with LUAD from 2 cohorts: Dana-Farber Cancer Institute (DFCI) from June 2013 to November 2023, and a European-based trial (TNM-I) from August 2016 to February 2022. All patients had paired next-generation sequencing data and hematoxylin-eosin-stained whole-slide images. In the DFCI cohort, genetic ancestry was inferred using germline genotype data. Data analyses were performed from July 2025 to September 2025.\n\nMAIN OUTCOMES: The primary outcome was model performance for predicting EGFR mutation status, measured as the area under the receiver operating characteristic curve (AUC), evaluated overall and across ancestry subgroups and sample types.\n\nRESULTS: Overall, 2098 patients with LUAD were included (mean [SD] age, 66.6 [10.3] years; 1315 female individuals [63%] and 783 male individuals [37%]). In the DFCI cohort (n = 1759; 54 African, 101 American, 95 Asian, 1465 European), EGFR mutations were detected in 432 patients (25%). One AI-pathology model achieved an AUC of 0.83 (95% CI, 0.81-0.85) compared with 0.68 (95% CI, 0.65-0.70) for the other model. In the TNM-I cohort (n = 339), EGFR mutations were detected in 50 patients (15%), with AUCs of 0.81 (95% CI, 0.74-0.88) and 0.75 (95% CI, 0.68-0.83), respectively. In ancestry-stratified analyses of the DFCI cohort, AUCs for the higher-performing model were 0.84 (95% CI, 0.81-0.86) in patients of European ancestry, 0.85 (95% CI, 0.72-0.94) in African ancestry, and 0.68 (95% CI, 0.55-0.78) in Asian ancestry. In sample type analyses, performance declined in pleural (AUC, 0.66; 95% CI, 0.56-0.76) compared with lung specimens (AUC, 0.86; 95% CI, 0.83-0.88). AI-guided triage analyses showed a potential 57% reduction in rapid EGFR testing, while maintaining sensitivity of 0.84 and specificity of 0.99.\n\nCONCLUSIONS: This cohort study found that AI-based pathology tools may serve as preliminary adjuncts for EGFR prediction in lung cancer, though performance differences by ancestry warrant careful interpretation."
    },
    {
      "pmid": "41661652",
      "doi": "10.1158/0008-5472.CAN-25-2764",
      "title": "The farnesyl transferase inhibitor darlifarnib (KO-2806) re-sensitizes relapsing tumors to RAS inhibition.",
      "journal": "Cancer research",
      "pubdate": "2026-02-09T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://doi.org/10.1158/0008-5472.can-25-2764",
      "metric_name": "SJR",
      "metric_value": 3.879,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41661652/",
      "url_doi": "https://doi.org/10.1158/0008-5472.CAN-25-2764",
      "abstract": "Resistance remains a key issue limiting the clinical benefit from RAS-targeting therapeutic agents and necessitates combination approaches. Here, we identified persistent mTORC1 activity in preclinical KRAS-mutant non-small cell lung cancer (NSCLC) and colorectal cancer (CRC) models as a frequent, nongenetic driver of inherent and adaptive resistance to RAS inhibition. This vulnerability was targetable with the farnesyl transferase inhibitor darlifarnib (KO-2806), which blocks mTORC1 activation via RHEB while sparing mTORC2 to limit associated toxicities. The addition of KO-2806 to NSCLC or CRC tumors progressing on mutant-selective RAS inhibitors led to rapid and durable tumor regression. In contrast, switching from mutant-selective to pan-RAS inhibitor monotherapy resulted in only stasis of NSCLC tumors and had no effect on CRC tumor progression. Further, the addition of KO-2806 rescued sensitivity of progressing tumors to the pan-RAS inhibitor RMC-6236. These results establish mTORC1 as an important mediator of escape from RAS inhibition and highlight KO-2806 as a promising RAS companion inhibitor in patients with prior RAS inhibitor exposure."
    },
    {
      "pmid": "41419100",
      "doi": "10.1016/j.canlet.2025.218223",
      "title": "Consensus on the diagnosis and treatment of unresectable stage III driver gene-positive non-small cell lung cancer.",
      "journal": "Cancer letters",
      "pubdate": "2026-02-28T00:00:00+00:00",
      "pubtypes": [
        "Journal Article",
        "Review"
      ],
      "entity": "NSCLC",
      "trial_type": "Review/Meta",
      "study_class": "Review",
      "is_oa": false,
      "oa_url": null,
      "metric_name": "SJR",
      "metric_value": 2.756,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41419100/",
      "url_doi": "https://doi.org/10.1016/j.canlet.2025.218223",
      "abstract": "Unresectable stage III non-small cell lung cancer (NSCLC) exhibits substantial heterogeneity and complexity. The landmark LAURA and POLESTAR studies have established a standard therapeutic model involving targeted consolidation therapy with osimertinib or aumolertinib after definitive chemoradiotherapy for NSCLC patients harboring EGFR-sensitive mutations. However, treatment strategies for patients with other driver gene mutations (e.g., ALK fusions, ROS1 rearrangement) still lack robust support from high-level evidence-based medical study. To enhance the standardization of diagnosis and treatment for unresectable stage III driver-positive NSCLC patients, the Radiotherapy Committee of the Chinese Society of Clinical Oncology convened an expert working group. This group identified common clinical practice issues and conducted an in-depth, problem-oriented analysis of domestic and international guidelines alongside evidence-based medical data. Through multiple rounds of comprehensive discussion and expert voting, this consensus was jointly developed. It provides evidence-based recommendations addressing frequently encountered clinical questions regarding unresectable stage III driver-positive NSCLC, aiming to serve as a key reference for clinical practice."
    },
    {
      "pmid": "41679523",
      "doi": "10.1016/j.critrevonc.2026.105205",
      "title": "FGFR-driven lung cancer: Dissecting resistance and exploring therapeutic avenues.",
      "journal": "Critical reviews in oncology/hematology",
      "pubdate": "2026-02-10T00:00:00+00:00",
      "pubtypes": [
        "Journal Article",
        "Review"
      ],
      "entity": "Thoracic-other",
      "trial_type": "Review/Meta",
      "study_class": "Review",
      "is_oa": false,
      "oa_url": null,
      "metric_name": "SJR",
      "metric_value": 1.82,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41679523/",
      "url_doi": "https://doi.org/10.1016/j.critrevonc.2026.105205",
      "abstract": "Fibroblast growth factor receptors (FGFRs) are significant oncogenic contributors in lung cancer. The clinical development of FGFR-directed agents represents a promising advancement in precision oncology. However, their efficacy is substantially limited by the emergence of diverse resistance mechanisms. This review summarizes FGFR biology, genomic alterations, and signaling pathways in tumorigenesis. Nonselective tyrosine kinase inhibitors and selective FGFR inhibitors (including pan-FGFR and isoform-specific agents) have shown clinical activity in patients with FGFR-altered lung cancer. Moreover, resistance mechanisms, such as secondary FGFR mutations, bypass signaling, tumor microenvironment (TME) remodeling, and phenotypic switching, are discussed. Innovative approaches, including the second-generation FGFR TKIs, monoclonal antibodies (mAbs), FGF traps, antibody-drug conjugates, and synergistic combinations with immunotherapy or other receptor tyrosine kinase (RTK) inhibitors, are discussed to overcome resistance. Overall, this review offers theoretical insights and proposes strategies to tackle resistance to FGFR-directed treatments in lung cancer."
    },
    {
      "pmid": "41616709",
      "doi": "10.1016/j.compbiomed.2026.111501",
      "title": "Influence of CT harmonization in longitudinal radiomics for NSCLC immunotherapy response prediction.",
      "journal": "Computers in biology and medicine",
      "pubdate": "2026-02-15T00:00:00+00:00",
      "pubtypes": [
        "Journal Article",
        "Multicenter Study"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": "SJR",
      "metric_value": 1.447,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41616709/",
      "url_doi": "https://doi.org/10.1016/j.compbiomed.2026.111501",
      "abstract": "This study investigates the variability of radiomic features in longitudinal CT scans from a multi-institutional NSCLC cohort and introduces a harmonization pipeline to improve predictive modeling of immunotherapy response. Baseline and follow-up CT scans from NSCLC patients treated with anti-PD-1/PD-L1 agents were analyzed, with two institutions combined for model training and internal testing, and a third institution serving as an external test set. To address variability from imaging parameters-such as scanner manufacturer, slice thickness, and noise-we applied image harmonization followed by feature harmonization using NestedComBat. This approach substantially reduced feature dependence on acquisition confounders (from 78.8% to 12.8%) and improved feature robustness across institutions. We further assessed the temporal consistency of radiomic features across longitudinal scans using the intraclass correlation coefficient (ICC). Image harmonization yielded the largest gains in stability (mean ΔICC = +0.021, p < 0.001), while the combined approach also enhanced longitudinal reliability (ΔICC = +0.014, p < 0.001). Finally, harmonization improved predictive performance for 6-month immunotherapy response, increasing the AUC from 0.695 to 0.768 in the internal test and from 0.692 to 0.802 in the external test. These results demonstrate that combining image- and feature-level harmonization enhances the robustness and temporal consistency of radiomic features, potentially supporting more reliable and generalizable predictive modeling across diverse datasets and clinical settings."
    },
    {
      "pmid": "41593906",
      "doi": "10.1080/07853890.2026.2620201",
      "title": "Clinicopathological characteristics and therapeutic outcomes in patients with non-small cell lung cancer harboring SMARCA4 mutations.",
      "journal": "Annals of medicine",
      "pubdate": "2026-12-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://doi.org/10.1080/07853890.2026.2620201",
      "metric_name": "SJR",
      "metric_value": 1.204,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41593906/",
      "url_doi": "https://doi.org/10.1080/07853890.2026.2620201",
      "abstract": "OBJECTIVE: To investigate the clinical characteristics and impact of\n\nMETHODS: A total of 2,821 patients with NSCLC who underwent next-generation sequencing were retrospectively included. The frequency and types of"
    },
    {
      "pmid": "41662869",
      "doi": "10.17849/insm-53-1-1-7.2",
      "title": "Are There Types of Early-Stage Adenocarcinomas That Are Insurable?",
      "journal": "Journal of insurance medicine (New York, N.Y.)",
      "pubdate": "2026-02-09T00:00:00+00:00",
      "pubtypes": [
        "Journal Article",
        "Review"
      ],
      "entity": "Other",
      "trial_type": "Review/Meta",
      "study_class": "Review",
      "is_oa": false,
      "oa_url": null,
      "metric_name": "SJR",
      "metric_value": 0.113,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41662869/",
      "url_doi": "https://doi.org/10.17849/insm-53-1-1-7.2",
      "abstract": "Lung cancer is the most common cause of cancer-related mortality worldwide. With the introduction of low-dose computed tomography (LDCT), detection of adenocarcinoma in situ (AIS) and minimally invasive adenocarcinoma (MIA) are increasingly being found in young, never-smoking females in Asia. There are survival studies suggesting that these early cancers, with resection, have no recurrence in 5 and even 10 years and therefore might be considered cured, allowing for favorable underwriting consideration for life insurance. However, other studies have shown incidences of secondary primary lung cancers (SPLCs) occurring within 10 years after surgical resections of AIS and MIA tumors, but with their clinical course and response to treatment appear to be better than original primary lung cancers, potentially still allowing for insurance with rating. The goal of this article is to review the evidence both for and against insuring these populations of lung cancer patients."
    },
    {
      "pmid": "41539180",
      "doi": "10.1016/j.ejca.2026.116221",
      "title": "Preclinical characterization and first-in-human, phase I trial of the novel ALK inhibitor dirozalkib in advanced non-small cell lung cancer.",
      "journal": "European journal of cancer (Oxford, England : 1990)",
      "pubdate": "2026-02-25T00:00:00+00:00",
      "pubtypes": [
        "Journal Article",
        "Multicenter Study"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Preclinical",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41539180/",
      "url_doi": "https://doi.org/10.1016/j.ejca.2026.116221",
      "abstract": "BACKGROUND: To investigate the preclinical characterization of dirozalkib, a novel anaplastic lymphoma kinase (ALK) inhibitor, and its safety, pharmacokinetics, and preliminary antitumor activity in advanced non-small cell lung cancer (NSCLC).\n\nMETHODS: The preclinical inhibitory effects of dirozalkib were evaluated in vitro and in vivo. The first-in-human phase I study (NCT05055232) enrolled patients with advanced NSCLC harboring ALK or ROS1 rearrangements. Participants received 50-600 mg/day dirozalkib following a 3 + 3 dose-escalation design with rapid titration, and 300-600 mg/day in the dose-expansion phase. The primary endpoint was safety.\n\nRESULTS: Dirozalkib demonstrated potent inhibition of ALK fusion-positive cell lines and common resistance mutations, and suppressed tumor growth in patient-derived and intracranial xenograft lung cancer models. No dose-limiting toxicities occurred, establishing 600 mg/day as the maximum tolerated dose. Among 114 patients enrolled, 55 (48.2 %) experienced grade ≥ 3 treatment-emergent adverse events, most commonly diarrhea (8.8 %). The objective response rate (ORR) among patients with ALK rearrangements was 47.4 % (9/19) and 46.3 % (38/82) in the dose-escalation and dose-expansion cohort (89.3 % in ALK inhibitor-naive patients receiving 500 mg/day). After a single dose of 50-600 mg dirozalkib, median time to maximum concentration ranged from 3 to 4 h. C\n\nCONCLUSIONS: Dirozalkib exhibited favorable safety, antitumor activity and pharmacokinetics in patients with advanced ALK-rearranged NSCLC. The recommended phase II dose was 500 mg/day.\n\nTRIAL REGISTRATION: Clinicaltrials.gov (NCT05055232) and Chinadrugtrials.org.cn (CTR20190984)."
    },
    {
      "pmid": "41689406",
      "doi": "10.1080/14796694.2025.2598216",
      "title": "Trastuzumab deruxtecan in HER2-mutant metastatic non-small-cell lung cancer: a plain language summary of the DESTINY-Lung02 study.",
      "journal": "Future oncology (London, England)",
      "pubdate": "2026-02-14T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41689406/",
      "url_doi": "https://doi.org/10.1080/14796694.2025.2598216",
      "abstract": null
    },
    {
      "pmid": "41687045",
      "doi": "10.1200/JCO-25-01892",
      "title": "Medicaid Expansion and Stage at Diagnosis, Timely Initiation and Receipt of Guideline-Concordant Treatment, and Survival Among People With Non-Small Cell Lung Cancer.",
      "journal": "Journal of clinical oncology : official journal of the American Society of Clinical Oncology",
      "pubdate": "2026-02-13T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41687045/",
      "url_doi": "https://doi.org/10.1200/JCO-25-01892",
      "abstract": "PURPOSE: To examine the associations between Medicaid expansion and stage at diagnosis, timely initiation and receipt of guideline-concordant treatment, and 5-year overall survival (OS) among people with non-small cell lung cancer (NSCLC).\n\nMETHODS: Individuals newly diagnosed with stage I to IV NSCLC at age 18-64 years between January 1, 2004, and December 31, 2023, in 50 states and Washington, DC, were identified from the National Cancer Database. We examined the association of Medicaid expansion and (1) early-stage diagnosis (I and II); (2) timely initiation of guideline-concordant treatment within 30 days after diagnosis; (3) receipt of all first-course guideline-concordant treatment; and (4) 5-year OS. We applied conventional and updated (Sun and Abraham) difference-in-differences (DID) approaches to examine the changes in study outcomes associated with Medicaid expansion using multivariable linear probability models to estimate stage and treatment and multivariable flexible parametric survival models to investigate survival overall and by key factors.\n\nRESULTS: Compared with people in nonexpansion states (n = 164,228), people in expansion states (n = 350,290) were more likely to be female, non-Hispanic White, or living in areas with higher family income or in nonmetropolitan areas. Medicaid expansion was associated with increases in early-stage NSCLC diagnosis (DID: 1.02 percentage points [ppt; 95% CI, 0.52 to 1.52]), timely treatment initiation (2.10 ppt [95% CI, 0.05 to 4.15]), and higher 5-year OS (1.79 ppt [95% CI, 1.32 to 2.26]). In stratified analyses, people living in areas with lower household income were more likely to benefit from Medicaid expansion.\n\nCONCLUSION: Medicaid expansion was associated with improvements in early detection, timeliness of guideline-concordant treatment, and survival for people with NSCLC. Anticipated Medicaid coverage losses may jeopardize these gains."
    },
    {
      "pmid": "41685630",
      "doi": "10.1017/S147895152510148X",
      "title": "Interventions for unpaid carers of people living with breathlessness due to chronic respiratory diseases: Scoping review.",
      "journal": "Palliative & supportive care",
      "pubdate": "2026-02-13T00:00:00+00:00",
      "pubtypes": [
        "Journal Article",
        "Review"
      ],
      "entity": "Other",
      "trial_type": "Review/Meta",
      "study_class": "Review",
      "is_oa": true,
      "oa_url": "https://doi.org/10.1017/s147895152510148x",
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41685630/",
      "url_doi": "https://doi.org/10.1017/S147895152510148X",
      "abstract": "OBJECTIVES: Carers of people living with breathlessness face common challenges due to the chronic, distressing and unpredictable nature of the symptom. These include unmet information and support needs resulting in worsened health and psychosocial outcomes. This review aimed to (1) identify the relative volume of studies on supportive interventions for carers of people living with breathlessness due to different respiratory diseases, (2) characterize the nature of the interventions, and (3) explore their reported effectiveness on outcomes identified by carers as being important.\n\nMETHODS: Medline and CINAHL were searched for studies reporting interventions targeting unpaid adult carers of people with breathlessness, lung cancer, chronic obstructive pulmonary disease (COPD), Interstitial Lung Diseases (ILD) published 2000-2025. Intervention characteristics and reported outcomes were extracted and compared across diagnoses and intervention categories. Our findings were shaped by consultation with unpaid carers in a series of patient and public involvement workshops.\n\nRESULTS: From 72 included interventions, three approaches were identified: Education, therapeutic support, and interventions for patient management. Interventions for lung cancer carers most frequently offered therapeutic support to the carer, while those for COPD carers most frequently focused on managing the patient. COPD and ILD carers have been underserved by research. We found few therapeutic support interventions for COPD carers. Reporting of carer demographics was poor, including among RCTs.\n\nSIGNIFICANCE OF RESULTS: There was a dominance of research focusing on carers of people with lung cancer (56% of participants). In PPI consultations, carers identified stigma and poor communication with health providers as factors contributing to the disparity between lung cancer and other respiratory diseases. More research is needed to compare the efficacy of different intervention strategies to improve outcomes that matter most to carers. To improve equity, researchers must consistently report carer demographics and prioritize developing interventions for carers underserved by research."
    },
    {
      "pmid": "41690367",
      "doi": "10.1016/j.jtho.2026.103610",
      "title": "TTF-1 expression in lung adenocarcinoma: clinicopathologic, genomic, and immunophenotypic correlates and outcomes to immunotherapy-based treatments and KRAS(G12C) inhibitors.",
      "journal": "Journal of thoracic oncology : official publication of the International Association for the Study of Lung Cancer",
      "pubdate": "2026-02-12T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41690367/",
      "url_doi": "https://doi.org/10.1016/j.jtho.2026.103610",
      "abstract": "BACKGROUND: Thyroid transcription factor-1 (TTF-1) expression, routinely assessed through immunohistochemistry (IHC) in the diagnostic evaluation of lung adenocarcinomas (LUAD), is negative (TTF-1\n\nMETHODS: Patients with LUAD and available TTF-1 IHC from five institutions, The Cancer Genome Atlas, the Stand Up To Cancer-Mark Foundation, and the POPLAR/OAK datasets were included. Features and outcomes were analyzed according to TTF-1 expression.\n\nRESULTS: Among 3,297 patients, TTF-1\n\nCONCLUSIONS: TTF-1 negativity identifies a subset of LUAD with worse outcomes to immunotherapy, chemo-immunotherapy, and KRAS"
    },
    {
      "pmid": "41690366",
      "doi": "10.1016/j.jtho.2026.103609",
      "title": "Four-Year outcomes of first-line Nivolumab plus ipilimumab for 6 months versus continuation in patients with advanced non-small-cell lung cancer Results of the randomized IFCT-1701 \"DICIPLE\" Phase III trial.",
      "journal": "Journal of thoracic oncology : official publication of the International Association for the Study of Lung Cancer",
      "pubdate": "2026-02-12T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": "Phase III",
      "study_class": "Prospective",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41690366/",
      "url_doi": "https://doi.org/10.1016/j.jtho.2026.103609",
      "abstract": "INTRODUCTION: Optimal first-line immunotherapy duration in metastatic non-small-cell-lung cancer (mNSCLC) with controlled disease remains unclear. We evaluated 6-month nivolumab-ipilimumab (IO) in patients with disease control (DC).\n\nMETHODS: This randomized, open label, non-inferiority trial enrolled treatment-naïve mNSCLC patients (aged 18-75, Estern Cooperative Oncology Group (ECOG) performance status 0-1, no actionable genomic alterations). After six-month induction treatment with nivolumab (3mg/kg biweekly) plus ipilimumab (1mg/kg every six weeks), patients with DC were randomized to continue treatment or stop and resume at disease progression. The primary outcome was progression-free survival (PFS).\n\nRESULTS: Among 265 patients enrolled, 71 were randomized to the continuation control arm (n=36) or to the experimental arm (n=35), with trial premature interruption due to the lack of European filing for the immunotherapy combination. Median PFS follow-up was 47·8 months 95%CI [43·1-51·0]. In the per-protocol population, median PFS was 18·7 months (95%CI [7·1-37·1]) in the continuation arm vs. not reached (NR) (95%CI [16·1-NR]) in the experimental arm. Median OS was 55·5 months, 95%CI [32·4-NR] in the continuation arm vs. NR in the experimental group. 18-month OS was 80·6% (95%CI [63·5-90·2]) and 93·8% (95%CI [77·3-98·4]), respectively. Grade 3-5 treatment-related adverse events rates were higher in the continuation arm (54·3 vs. 23·5%). Median time until definitive QoL deterioration was 15·5 months (95%CI [10·0-NR]) for the continuation arm, but NR in the experimental arm (HR=0·36, 95%CI [0·14-0·92], p=0·03).\n\nCONCLUSION: Stopping IO combination at 6 months in DC patients showed no survival harm at 4 years, reduced severe irAEs, and delayed QoL deterioration."
    },
    {
      "pmid": "41689890",
      "doi": "10.1016/j.lungcan.2026.109315",
      "title": "Altered bacteriome and mycobiome in small cell lung cancer: insights from microbial profiling.",
      "journal": "Lung cancer (Amsterdam, Netherlands)",
      "pubdate": "2026-02-11T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "SCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://doi.org/10.1016/j.lungcan.2026.109315",
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41689890/",
      "url_doi": "https://doi.org/10.1016/j.lungcan.2026.109315",
      "abstract": "BACKGROUND: The tumor-associated microbiome influences cancer development and progression, yet the microbial landscape of small cell lung cancer (SCLC) remains unexplored. Given the absence of SCLC-specific microbiome studies, we conducted an exploratory analysis to describe the bacterial and fungal communities present in SCLC tissue.\n\nRESULTS: Using 16S rRNA sequencing, we profiled the bacteriome of lung specimens from SCLC and control cases and observed increased bacterial signal and reduced bacterial diversity in SCLC, accompanied by relative enrichment of Firmicutes and Bacteroidota. Actinobacteria were comparatively underrepresented, resulting in a higher Proteobacteria-to-Actinobacteria ratio, although this difference did not reach statistical significance. At the genus level, SCLC samples were dominated by Pseudomonas, Streptococcus, Haemophilus, and Granulicatella, which together accounted for approximately half of the bacterial community. As a secondary, hypothesis-generating analysis, we examined the mycobiome using ITS sequencing and detected the unexpected presence of the biotrophic plant-pathogenic genus Taphrina in a subset (25%) of SCLC samples. Given the methodological constraints and contamination risks inherent to low-biomass FFPE tissues, this fungal signal is interpreted cautiously and framed strictly as preliminary.\n\nCONCLUSIONS: This study provides the first descriptive characterization of the lung bacteriome and mycobiome in SCLC using FFPE tissue. The observed alterations in microbial composition, including an unexpected fungal signal, offer hypothesis-generating insights that require validation in larger, prospectively collected cohorts incorporating more comprehensive contamination-control strategies."
    },
    {
      "pmid": "41671081",
      "doi": "10.1158/1078-0432.CCR-25-2173",
      "title": "Subcutaneously Administered Tislelizumab in Locally Advanced or Metastatic Non-Small Cell Lung Cancer: Pharmacokinetics and Safety Results from the BGB-A317-103 Phase I Study.",
      "journal": "Clinical cancer research : an official journal of the American Association for Cancer Research",
      "pubdate": "2026-02-11T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://aacrjournals.org/clincancerres/article-pdf/doi/10.1158/1078-0432.CCR-25-2173/3737508/ccr-25-2173.pdf",
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41671081/",
      "url_doi": "https://doi.org/10.1158/1078-0432.CCR-25-2173",
      "abstract": "PURPOSE: Tislelizumab, an anti-programmed cell death protein-1 monoclonal antibody, is approved for various indications intravenously. Subcutaneous delivery offers potential advantages in convenience and resource utilization. BGB-A317-103 assessed pharmacokinetics, safety, and efficacy of subcutaneous tislelizumab in treatment-naïve patients with advanced or metastatic non-small cell lung cancer.\n\nPATIENTS AND METHODS: BGB-A317-103 is an open-label, multicenter, phase I study. In Part 1 (dose/injection site exploration), patients received subcutaneous tislelizumab (abdomen or thigh injections; 300 mg) in 2 of the first 3 cycles and intravenous tislelizumab (200 mg) in the remaining cycle, followed by intravenous tislelizumab thereafter. In Part 2 (dose expansion), patients received 300 mg of subcutaneous tislelizumab in the thigh in all cycles. Both parts included chemotherapy during the first 4 to 6 cycles. Pharmacokinetics, bioavailability, efficacy, immunogenicity, and safety were assessed.\n\nRESULTS: At data cutoff (December 6, 2024), in Part 1 (N = 39), subcutaneous administration yielded higher trough concentrations than intravenous (geometric means: 23.1 μg/mL [thigh], 19.5 μg/mL [abdomen], and 14.8 μg/mL [intravenously]). Estimated bioavailability was 85.6% (thigh) and 72.4% (abdomen). In Part 2 (N = 22), subcutaneous tislelizumab in the thigh showed consistent pharmacokinetics with Part 1. Preliminary analysis showed overall response rate of 44.4%; median duration of response and median progression-free survival were not reached. Tislelizumab's safety profile was consistent with previous studies, with no new signals or injection-site reactions.\n\nCONCLUSIONS: Subcutaneous tislelizumab demonstrated high bioavailability after thigh and abdomen injections. Safety and efficacy were consistent with previous tislelizumab plus chemotherapy studies, warranting further investigation of subcutaneous tislelizumab."
    },
    {
      "pmid": "41687324",
      "doi": "10.1016/j.lungcan.2026.109317",
      "title": "Broadening clinical trial inclusivity of patients with lung cancer and brain metastases utilizing the Graded Prognostic Assessment (GPA): A call to action.",
      "journal": "Lung cancer (Amsterdam, Netherlands)",
      "pubdate": "2026-02-10T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41687324/",
      "url_doi": "https://doi.org/10.1016/j.lungcan.2026.109317",
      "abstract": "Brain metastases (BM) occur in 30-50% of non-small cell lung cancer (NSCLC) and up to 80% of small cell lung cancer (SCLC) patients, yet historically over 80% of clinical trials excluded this population. Current eligibility requirements often mandate completion of radiation therapy with prolonged washout periods, delaying systemic therapy initiation and limiting trial generalizability. Despite recommendations from ASCO-Friends of Cancer Research and FDA guidance, only 11.4% of lung cancer trials include patients with active, untreated BM. We propose incorporating the Graded Prognostic Assessment (GPA) to standardize and broaden clinical trial enrollment. The 2022 Lung GPA, validated in 4,183 patients, incorporates age, Karnofsky Performance Status, extracranial metastases, number of BM, and molecular markers (EGFR, ALK, PD-L1 for NSCLC). The GPA-based Eligibility Quotient (EQ) uses conditional probability to determine trial eligibility for patients with previously treated BM. We recommend including patients with GPA-predicted median survival ≥ 12 months or EQ ≥ 0.50. For asymptomatic, untreated BM, enrollment should be permitted with protocol-specified CNS imaging at 4-6-week intervals, reserving radiation for progression or inadequate response. Trials should stratify by GPA category, specify RANO-BM or modified RECIST criteria prospectively, and report both full analysis sets and evaluable CNS disease subsets. This evidence-based framework ensures patients with BM gain timely access to potentially life-extending therapies while maintaining trial integrity."
    },
    {
      "pmid": "41499719",
      "doi": "10.1200/JCO-25-03012",
      "title": "Erratum: Simultaneous Durvalumab and Platinum-Based Chemoradiotherapy in Unresectable Stage III Non-Small Cell Lung Cancer: The Phase III PACIFIC-2 Study.",
      "journal": "Journal of clinical oncology : official journal of the American Society of Clinical Oncology",
      "pubdate": "2026-02-10T00:00:00+00:00",
      "pubtypes": [
        "Journal Article",
        "Published Erratum"
      ],
      "entity": "NSCLC",
      "trial_type": "Phase III",
      "study_class": "Prospective",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41499719/",
      "url_doi": "https://doi.org/10.1200/JCO-25-03012",
      "abstract": null
    },
    {
      "pmid": "41672197",
      "doi": "10.1016/j.jtho.2026.103607",
      "title": "BiTE (CD3×EGFR)-Based Triplet Therapy Unlocks CD40/CD40L Crosstalk to Revert Immunosuppression in third-generation EGFR-TKI-Refractory NSCLC.",
      "journal": "Journal of thoracic oncology : official publication of the International Association for the Study of Lung Cancer",
      "pubdate": "2026-02-09T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Preclinical",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41672197/",
      "url_doi": "https://doi.org/10.1016/j.jtho.2026.103607",
      "abstract": "INTRODUCTION: Acquired resistance to third-generation epidermal growth factor receptor tyrosine kinase inhibitors (EGFR-TKIs) is a major challenge in non-small cell lung cancer (NSCLC), with ∼50% of cases lacking precise resistance mechanisms. This study investigates the immunosuppressive tumor microenvironment (TME) driving resistance and develops a novel triple-combination therapy to restore T-cell anti-tumor activity.\n\nMETHODS: scRNA-seq and multicolor fluorescence staining were performed on NSCLC patient samples to analyze TME changes post-EGFR-TKI resistance. A triple therapy combining BC3448 (EGFR/CD3 BiTE), Tucidinostat (HDAC inhibitor), and WBP3425 (4-1BB agonist) was tested using in vitro co-culture assays, syngeneic cell-derived xenograft (CDX) models in humanized NOG-EXL mice, and multi-omics analyses.\n\nRESULTS: scRNA-seq revealed reduced T-cell infiltration/activation and increased immunosuppressive myeloid cells in resistant NSCLC. BC3448 monotherapy activated T-cells and induced tumor cell apoptosis in vitro, but was limited in vivo due to myeloid-driven immunosuppression. The triple therapy significantly enhanced tumor regression in osimertinib-resistant models (tumor growth inhibition >70%, p<0.001), promoted CD8+ effector T-cell differentiation, and suppressed Tregs/M2 macrophages. CD40/CD40L axis activation between T cells and monocyte-derived macrophages was critical for TME remodeling, with spatial profiling showing increased CD40L+ T cell and CD40+ macrophage proximity, correlating with higher IFN-γ and reduced angiogenesis. A durable response to BC3448 monotherapy was observed in an immunotherapy-resistant NSCLC patient (>2 years of stable disease), presenting a translational potential of this approach.\n\nCONCLUSION: This study establishes a novel triple therapy that overcomes the limitations of BiTEs in cold and immunosuppressive TMEs and provides an immunomodulatory approach to addressing third-generation EGFR-TKI resistance."
    }
  ]
}