{
  "generated": "2025-12-13T05:19:50.283539Z",
  "items": [
    {
      "pmid": "41378717",
      "doi": "10.1111/cas.70242",
      "title": "Atezolizumab + Chemotherapy for Advanced Non-Small Cell Lung Cancer in Japanese Clinical Practice (J-TAIL-2).",
      "journal": "Cancer science",
      "pubdate": "2025-12-11T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://onlinelibrary.wiley.com/doi/pdfdirect/10.1111/cas.70242",
      "metric_name": "SJR",
      "metric_value": 1.661,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41378717/",
      "url_doi": "https://doi.org/10.1111/cas.70242",
      "abstract": "First-line atezolizumab combination therapies were approved for the treatment of metastatic non-small cell lung cancer (NSCLC) based on results from the global phase 3 trials IMpower130, IMpower132, and IMpower150. These trials reported 12-month overall survival (OS) rates of 60%-67% with atezolizumab combination therapy. J-TAIL-2 (NCT04501497), a prospective, multicenter, observational study, evaluated atezolizumab combination therapy in routine clinical practice in Japan. Patients ≥ 20 years old with NSCLC received atezolizumab plus carboplatin and nab-paclitaxel (atezo + CnP), atezolizumab plus carboplatin or cisplatin plus pemetrexed (atezo + PP), or atezolizumab plus bevacizumab plus carboplatin and paclitaxel (atezo + bev + CP) in clinical practice. The primary endpoint was the 12-month OS rate. Secondary endpoints included OS, progression-free survival, and subgroup analyses, including IMpower-unlike (did not meet the main eligibility criteria of each IMpower trial) and IMpower-like patients. In total, 814 patients were enrolled (atezo + CnP, n = 217; atezo + PP, n = 211; atezo + bev + CP, n = 386). The IMpower-unlike group included patients with Eastern Cooperative Oncology Group performance status ≥ 2, autoimmune disease, or interstitial lung disease. Twelve-month OS rates (95% confidence interval [CI]) were 62.9% (55.8-69.2), 72.1% (65.2-77.9), and 68.3% (63.2-72.9) with atezo + CnP, atezo + PP, and atezo + bev + CP, respectively. OS hazard ratios (95% CI) in the IMpower-unlike vs. -like subgroups were 1.36 (0.91-2.05), 1.08 (0.70-1.68), and 1.49 (1.09-2.06), respectively. No new safety signals were observed. Real-world efficacy and safety for each atezolizumab combination were comparable to those in the relevant IMpower trials."
    },
    {
      "pmid": "41378711",
      "doi": "10.1111/cas.70270",
      "title": "A Transcriptomic Analysis of Cancer-Stromal Interactome in Lung Cancer Xenograft Models.",
      "journal": "Cancer science",
      "pubdate": "2025-12-11T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Preclinical",
      "is_oa": true,
      "oa_url": "https://onlinelibrary.wiley.com/doi/pdfdirect/10.1111/cas.70270",
      "metric_name": "SJR",
      "metric_value": 1.661,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41378711/",
      "url_doi": "https://doi.org/10.1111/cas.70270",
      "abstract": "Cancer-stromal interactions play important roles in the biology of various cancers, including lung adenocarcinoma. We aimed to comprehensively analyze the lung cancer interactome and identify the key ligand-receptor pairs involved in the aggressiveness of lung adenocarcinoma. Transcriptome data were obtained from xenografts of 11 lung cancer cell lines that represented the major driver mutations in lung adenocarcinomas. A quantitative dataset was constructed in both stroma-to-cancer and cancer-to-stroma directions using the cancer-stromal interactome analysis method. The prognostic value of each factor was evaluated using multiple datasets. Analysis of 24,250 stroma-derived mouse transcripts and 26,289 human cancer-derived transcripts identified 1150 cancer-stromal interactions, from which we selected 117 interactions based on the intensity score of ligand-stromal transcript levels. Further prognostic analysis using public databases led us to identify 21 ligand-receptor pairs, including well-known as well as less well-characterized ligand-receptor pairs. Therefore, we selected tumor necrosis factor superfamily member 12/tumor necrosis factor receptor superfamily member 12A as possible factors contributing to the aggressiveness of lung adenocarcinoma via cancer-stromal interactions; immunohistochemical analysis confirmed that these factors were expressed mainly in the stroma and cancer cells, respectively, in both xenografts and primary lung adenocarcinoma. In human clinical specimens, high tumor necrosis factor receptor superfamily member 12A expression significantly correlated with tumor size, invasive diameter, and stage. Thus, tumor necrosis factor superfamily member 12 and its receptor tumor necrosis factor receptor superfamily member 12A signaling axis may be potential candidates for therapeutic intervention for lung adenocarcinoma."
    },
    {
      "pmid": "41372911",
      "doi": "10.1186/s12938-025-01497-z",
      "title": "Application and prospects of lung organ-on-a-chip in the development of new drugs.",
      "journal": "Biomedical engineering online",
      "pubdate": "2025-12-10T00:00:00+00:00",
      "pubtypes": [
        "Journal Article",
        "Review"
      ],
      "entity": "Thoracic-other",
      "trial_type": "Review/Meta",
      "study_class": "Review",
      "is_oa": true,
      "oa_url": "https://doi.org/10.1186/s12938-025-01497-z",
      "metric_name": "SJR",
      "metric_value": 0.696,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41372911/",
      "url_doi": "https://doi.org/10.1186/s12938-025-01497-z",
      "abstract": "Respiratory disease, such as lung cancer, is a major risk factor that seriously endangers human health. In the development of new drugs, conventional preclinical and clinical testing stages rely on cell culture and animal experiment. However, the two methods may fall short of fully representing human biology, thereby presenting an opportunity to advance technological innovation. In this review, we focus on the structure and the composition of supporting cells of organ-on-a-chip (OOAC), whose most notable feature is its biomimetic representation of the human body. Its core advantage lies in its biomimetic human structure, which enables broad application scenarios in the field of pulmonary diseases including lung cancer, pneumonia, pulmonary edema, and pulmonary embolism. Finally, this review summarizes the current challenges and prospects of OOAC, highlighting its vast potential for advancement."
    },
    {
      "pmid": "41371250",
      "doi": "10.1055/a-2744-9284",
      "title": "[Impact of the COVID 19 Pandemic on the Surgical Management of Lung Cancer in Germany: an Analysis from the German Thoracic Register].",
      "journal": "Zentralblatt fur Chirurgie",
      "pubdate": "2025-12-10T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": "SJR",
      "metric_value": 0.15,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41371250/",
      "url_doi": "https://doi.org/10.1055/a-2744-9284",
      "abstract": "The covid 19 pandemic has had a significant impact on healthcare worldwide, yet the effects on the surgical treatment of lung cancer patients in Germany have not yet been adequately studied.This retrospective analysis used data from the German Thoracic Register. The surgical treatment of 2989 patients with bronchial carcinoma was analysed in two periods: 2020-2021 (pandemic phase: 1297 patients) and 2018-2019 (pre-pandemic phase: 1692 patients) across 8 German hospitals.During the pandemic phase, the number of complex surgeries decreased, and the need for intensive care dropped from 39.7% to 19.4% (p < 0.001). The rates of neoadjuvant chemotherapy and radiation therapy decreased from 44% to 17% and 20% to 5%, respectively (both p < 0.001). Simultaneously, a significant reduction in postoperative complications, particularly pneumonia (8.5% to 6.2%, p = 0.020), was observed.The lower complication rates may be attributed to stricter hygiene measures and reduced visitor access during the pandemic. Consideration of these risk factors in postoperative patient care may help improve the prognosis of surgically treated lung cancer patients in the future."
    },
    {
      "pmid": "41176132",
      "doi": "10.1016/j.taap.2025.117625",
      "title": "An intestinal matrix-based human lung cancer model reflects clinical data from gefitinib on dosage-dependent efficacy.",
      "journal": "Toxicology and applied pharmacology",
      "pubdate": "2026-01-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://doi.org/10.1016/j.taap.2025.117625",
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41176132/",
      "url_doi": "https://doi.org/10.1016/j.taap.2025.117625",
      "abstract": "Lung cancer is the leading cause for cancer related death worldwide. One treatment option for patients with pulmonary adenocarcinoma is the targeted therapy gefitinib (Iressa®, ZD1839). As with other promising targeted therapies, desired in vivo effects of gefitinib came short to in vitro expectations, as preclinical testing is hampered by an inaccuracy of existing models and resistances develop frequently. We analysed the pharmacodynamics of gefitinib in a 3D tissue engineered human lung cancer model of HCC827 cells, as well as a resistant subpopulation of HCCres A2 cells. In 2D cell culture, a cell viability of 50 % was reached after treatment with 0.01-0.05 μM gefitinib. In the 3D model administering higher doses of gefitinib did not lead to a further reduction in viability and proliferation, or an increase in apoptosis. This shows that the pharmacodynamic effect of promising new therapies can often be overestimated in 2D versus 3D models. The results we obtained for gefitinib testing in the 3D models reflect astonishing well the efficacy of priorly published clinical data, suggesting that our 3D tumor models can display in vivo conditions more accurately, bridging the gap to living organisms. To mimic the clinical setting further, the lung cancer cells were cultivated under dynamic conditions in a bioreactor. The exploration of a resistant subpopulation confirmed an epithelial-mesenchymal transition. The described 3D lung cancer model can be used as a refined, preclinical testing platform for targeted therapies and with clinically relevant pharmacodynamic properties as shown exemplary for gefitinib."
    },
    {
      "pmid": "41205892",
      "doi": "10.1016/j.envpol.2025.127348",
      "title": "Association of radon exposure with lung cancer: serum biomarkers and computed tomography evidence from male miners.",
      "journal": "Environmental pollution (Barking, Essex : 1987)",
      "pubdate": "2026-01-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://doi.org/10.1016/j.envpol.2025.127348",
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41205892/",
      "url_doi": "https://doi.org/10.1016/j.envpol.2025.127348",
      "abstract": "The objective of this research is to investigate the association between occupational radon exposure and pulmonary health outcomes in male miners from Chongqing, China. Between June 2022 and December 2023, 110 miners were enrolled in this cross-sectional study. Personal radon exposure levels were measured using passive cumulative dosimeters, with pulmonary health assessed through radiologist-interpreted low-dose computed tomography (CT) scans and serum biomarker analysis (CEA, CYFRA21-1, NSE, and CA125) via ELISA. Multivariable analyses revealed strong dose-response relationships between radon exposure and both serum biomarkers and CT abnormalities. high radon exposure predicted substantial biomarker elevations including a 2.45-fold increase in CYFRA21-1 (β = 0.39, 95 % CI 0.25-0.54, p < 0.001), 1.60-fold increase in CEA (β = 0.20, 0.05-0.35, p = 0.008), and 3.58-fold increased CT abnormality risk (OR = 3.58, p = 0.023). Mediation analysis identified CYFRA21-1 as accounting for 69 % (p = 0.024) and CEA for 24.7 % (p = 0.036) of radon's effect on CT abnormalities. These findings demonstrate that occupational radon exposure contributes to pulmonary damage through both direct effects and biomarker-mediated pathways, with CYFRA21-1 and CEA emerging as potential early indicators of lung cancer in radon-exposed populations."
    },
    {
      "pmid": "41378732",
      "doi": "10.1021/acs.nanolett.5c04269",
      "title": "PBAE-PEG/Lipid Nanoparticle Delivery of RNA for the Creation of Genetically Engineered Lung Cancer Mouse Models.",
      "journal": "Nano letters",
      "pubdate": "2025-12-11T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Preclinical",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41378732/",
      "url_doi": "https://doi.org/10.1021/acs.nanolett.5c04269",
      "abstract": "We have recently developed polymer/lipid nanoparticles PBAE-PEG/4A3-SC8/DOPE/Cholesterol/DOTAP (hereafter, PBAE-PEG/LNP) that can deliver mRNA into lung cells. Here, using PBAE-PEG/LNP, we delivered"
    },
    {
      "pmid": "41372401",
      "doi": "10.1038/s41586-025-09825-y",
      "title": "Uncovering the role of LINE-1 in the evolution of lung adenocarcinoma.",
      "journal": "Nature",
      "pubdate": "2025-12-10T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41372401/",
      "url_doi": "https://doi.org/10.1038/s41586-025-09825-y",
      "abstract": "Understanding lung cancer evolution can identify tools for intercepting its growth"
    },
    {
      "pmid": "41370740",
      "doi": "10.1200/JCO-25-02102",
      "title": "Reply to: \"Improving the Reporting of Long-Term Effects in the IMpower010 Trial\" and \"Adjuvant Atezolizumab in Early-Stage Non-Small Cell Lung Cancer: Signals, Silences, and the Need for Methodological Clarity\".",
      "journal": "Journal of clinical oncology : official journal of the American Society of Clinical Oncology",
      "pubdate": "2025-12-10T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41370740/",
      "url_doi": "https://doi.org/10.1200/JCO-25-02102",
      "abstract": null
    },
    {
      "pmid": "41370734",
      "doi": "10.1200/JCO-25-01540",
      "title": "Adjuvant Atezolizumab in Early-Stage Non-Small Cell Lung Cancer: Signals, Silences, and the Need for Methodological Clarity.",
      "journal": "Journal of clinical oncology : official journal of the American Society of Clinical Oncology",
      "pubdate": "2025-12-10T00:00:00+00:00",
      "pubtypes": [
        "Letter"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41370734/",
      "url_doi": "https://doi.org/10.1200/JCO-25-01540",
      "abstract": null
    },
    {
      "pmid": "41109959",
      "doi": "10.1200/JCO-25-02023",
      "title": "Updated Overall Survival Analysis From the Phase II PHAROS Study of Encorafenib Plus Binimetinib in Patients With BRAF V600E-Mutant Metastatic Non-Small Cell Lung Cancer.",
      "journal": "Journal of clinical oncology : official journal of the American Society of Clinical Oncology",
      "pubdate": "2025-12-10T00:00:00+00:00",
      "pubtypes": [
        "Journal Article",
        "Multicenter Study"
      ],
      "entity": "NSCLC",
      "trial_type": "Phase II",
      "study_class": "Prospective",
      "is_oa": true,
      "oa_url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC12680272/",
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41109959/",
      "url_doi": "https://doi.org/10.1200/JCO-25-02023",
      "abstract": "The phase II PHAROS study previously showed that encorafenib plus binimetinib has antitumor activity in patients with BRAF V600E-mutant metastatic non-small cell lung cancer (mNSCLC). In PHAROS, 98 patients (59 treatment-naïve; 39 previously treated) received encorafenib 450 mg once daily and binimetinib 45 mg twice daily. We report updated results from data cutoff of March 14, 2025. The median duration of treatment with both encorafenib and binimetinib was 16.3 months in treatment-naïve and 5.5 months in previously treated patients. After median follow-up for overall survival (OS) of 52.3 months in treatment-naïve patients, mOS was 47.6 months (95% CI, 31.3 to not estimable); 4-year OS probability was 49% (95% CI, 35 to 62). After median follow-up for OS of 48.2 months in previously treated patients, mOS was 22.7 months (95% CI, 14.1 to 32.6); 4-year OS probability was 31% (95% CI, 16 to 47). In treatment-naïve and previously treated groups, 58% and 26% received ≥1 subsequent systemic anticancer treatment, respectively. Safety profile remained consistent with that in previous analyses. Although comparisons across trials should be done cautiously, to our knowledge, encorafenib plus binimetinib was associated with the longest mOS reported to date with targeted treatment in patients with treatment-naïve BRAF V600E-mutant mNSCLC."
    },
    {
      "pmid": "41192233",
      "doi": "10.1016/j.ejca.2025.116059",
      "title": "EORTC 1417 - REACTION: A phase II study of etoposide and cis/carboplatin with or without pembrolizumab in untreated extensive small cell lung cancer.",
      "journal": "European journal of cancer (Oxford, England : 1990)",
      "pubdate": "2025-12-09T00:00:00+00:00",
      "pubtypes": [
        "Journal Article",
        "Randomized Controlled Trial",
        "Multicenter Study"
      ],
      "entity": "SCLC",
      "trial_type": "RCT",
      "study_class": "Prospective",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41192233/",
      "url_doi": "https://doi.org/10.1016/j.ejca.2025.116059",
      "abstract": "BACKGROUND: Anti-PD-L1 antibodies with platinum-etoposide extend overall survival (OS) of extensive disease Small Cell Lung Cancer (ED-SCLC) patients. We evaluated the benefit of first-line pembrolizumab with platinum-etoposide in chemo-sensitive ED-SCLC.\n\nMETHODS: REACTION is a multicenter, open-label, randomized phase II trial. Eligible patients (responders after 2 cycles of platinum-etoposide) were randomized 1:1 to experimental arm pembrolizumab in combination with 4 cycles of platinum-etoposide then pembrolizumab vs platinum-etoposide in the control arm. The primary endpoint was progression free survival (PFS). Circulating tumour cells (CTCs) were enumerated and their association with PFS and OS was investigated.\n\nRESULTS: Between Feb 7, 2018 and Oct 31, 2019, 125 patients were recruited (61 vs 64 experimental and control arms respectively) with 119 (58 vs 61) eligible and receiving at least one dose of treatment. Baseline characteristics were median age 65 vs 63.5 years, PS 1 (62 vs 60 %), and brain metastases (8 vs 11 %), in the experimental and control arms respectively. Amongst 124 patients who started treatment, 46 (37 %) experienced adverse events grade ≥ 3 for pembrolizumab arm vs 26 % in the control arm. Response rate was 61 % (67 vs 56 %). Median PFS (95 % CI) was 4.7 months (4.2, 5.6) vs 5.4 (4.7, 5.6), HR (80 % CI) = 0.84 (0.65, 1.09) and 1-sided p = 0.194. Median OS (95 % CI) was 12.3 months (8.9, 14.8) vs 10.4 (8.2, 12.2), HR (80 % CI) = 0.73 (0.54, 1.0) and 1-sided p = 0.097. CTC count per 7.5 ml blood at randomization was associated significantly with both PFS and OS regardless of treatment arms.\n\nCONCLUSIONS: Pembrolizumab added to platinum-etoposide did not improve PFS over platinum-etoposide alone in chemo-sensitive patients with ED."
    },
    {
      "pmid": "41360981",
      "doi": "10.1038/s41467-025-65930-6",
      "title": "Precise diagnosis of small invasive pulmonary nodules driven by single-cell immune signatures in peripheral blood.",
      "journal": "Nature communications",
      "pubdate": "2025-12-08T00:00:00+00:00",
      "pubtypes": [
        "Journal Article",
        "Multicenter Study"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://www.nature.com/articles/s41467-025-65930-6.pdf",
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41360981/",
      "url_doi": "https://doi.org/10.1038/s41467-025-65930-6",
      "abstract": "Early detection of lung cancer is crucial for improving patient outcomes. However, accurately diagnosing invasive pulmonary nodules and predicting tumor invasiveness remain major clinical challenges. Given the established role of immune dysfunction in cancer development, we hypothesize that peripheral immune profiling could provide a strategy for managing pulmonary nodules. In this multi-center, prospective study, we combine peripheral immune profiling via mass cytometry with machine learning algorithms to develop an integrated pulmonary nodule management platform. This platform accurately distinguishes invasive from non-invasive pulmonary nodules (AUC = 0.952), outperforming established clinical and radiomics-based models. Furthermore, it effectively predicts tumor invasiveness, differentiating minimally invasive from invasive adenocarcinoma (AUC = 0.949), thereby offering valuable guidance for surgical decision-making. In conclusion, the platform demonstrates substantial clinical utility and holds significant promise as a precision tool for future management of pulmonary nodules."
    },
    {
      "pmid": "41351270",
      "doi": "10.1097/JS9.0000000000004151",
      "title": "A more selective risk-stratified, machine learning based, lung cancer thromboprophylaxis protocol following vats segmentectomy: a prospective cohort study.",
      "journal": "International journal of surgery (London, England)",
      "pubdate": "2025-12-08T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": "Prospective (non-RCT)",
      "study_class": "Prospective",
      "is_oa": true,
      "oa_url": "https://doi.org/10.1097/js9.0000000000004151",
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41351270/",
      "url_doi": "https://doi.org/10.1097/JS9.0000000000004151",
      "abstract": "BACKGROUND: Venous thromboembolism (VTE) represents a potentially fatal but preventable postoperative complication. We sought to establish and validate an explainable prediction model based on the machine learning (ML) approach for VTE, and assess its prognostic implications in thoracic oncology patients undergoing VATS Segmentectomy.\n\nMATERIALS AND METHODS: We prospectively developed and validated a predictive model for postoperative VTE following VATS segmentectomy. Patients were sequentially enrolled into training (n = 557, Apr.2017-Jan.2021) and validation cohorts (n = 239, Feb.2021-Oct.2022). 49 clinicopathological variables, including the novel biomarker von Willebrand factor A2 (vWF-A2), were evaluated. 11 ML algorithms were compared based on several evaluation indexes including AUC. SHapley Additive exPlanations (SHAP) analysis was utilized for feature ranking and interpretability. The final model was benchmarked against the traditional Caprini score, and the prognostic impact of postoperative VTE on long-term survival was further assessed.\n\nRESULTS: In this prospective study, eXtreme gradient boosting (XGBoost) demonstrated superior discriminative performance among 11 evaluated ML-models. After feature reduction based on ranked feature importance, a final interpretable XGBoost model comprising 11 variables was established. This model accurately predicted postoperative VTE in both training (AUC = 0.903) and validation (AUC = 0.856) cohorts, significantly outperforming the conventional Caprini score RAM. Additionally, comparison of oncologic outcomes revealed no significant difference in overall survival (P = 0.068), whereas disease-free survival was significantly shorter in patients experiencing postoperative VTE (P = 0.017).\n\nCONCLUSION: Our explainable risk-stratification ML model not only accurately predicts the risk of VTE following VATS segmentectomy in early-stage NSCLC patients, but also exhibits substantial clinical relevance to adverse prognostic outcomes in this patient cohort."
    }
  ]
}