{
  "generated": "2026-02-13T05:59:01.362957Z",
  "items": [
    {
      "pmid": "41678173",
      "doi": "10.1001/jamaoncol.2025.6430",
      "title": "Ancestry-Associated Performance Variability of Open-Source AI Models for EGFR Prediction in Lung Cancer.",
      "journal": "JAMA oncology",
      "pubdate": "2026-02-12T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": "SJR",
      "metric_value": 8.377,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41678173/",
      "url_doi": "https://doi.org/10.1001/jamaoncol.2025.6430",
      "abstract": "IMPORTANCE: Artificial intelligence (AI) models are emerging as rapid, low-cost tools for predicting targetable genomic alterations directly from routine pathology slides. Although these approaches could accelerate treatment decisions in lung cancer, little is known about whether their performance is consistent across diverse patient populations and tissue contexts.\n\nOBJECTIVE: To evaluate the performance and generalizability of 2 open-source AI pathology models for predicting EGFR mutation status in lung adenocarcinoma (LUAD) across independent cohorts and ancestral subgroups.\n\nDESIGN, SETTING, AND PARTICIPANTS: This cohort study included patients with LUAD from 2 cohorts: Dana-Farber Cancer Institute (DFCI) from June 2013 to November 2023, and a European-based trial (TNM-I) from August 2016 to February 2022. All patients had paired next-generation sequencing data and hematoxylin-eosin-stained whole-slide images. In the DFCI cohort, genetic ancestry was inferred using germline genotype data. Data analyses were performed from July 2025 to September 2025.\n\nMAIN OUTCOMES: The primary outcome was model performance for predicting EGFR mutation status, measured as the area under the receiver operating characteristic curve (AUC), evaluated overall and across ancestry subgroups and sample types.\n\nRESULTS: Overall, 2098 patients with LUAD were included (mean [SD] age, 66.6 [10.3] years; 1315 female individuals [63%] and 783 male individuals [37%]). In the DFCI cohort (n = 1759; 54 African, 101 American, 95 Asian, 1465 European), EGFR mutations were detected in 432 patients (25%). One AI-pathology model achieved an AUC of 0.83 (95% CI, 0.81-0.85) compared with 0.68 (95% CI, 0.65-0.70) for the other model. In the TNM-I cohort (n = 339), EGFR mutations were detected in 50 patients (15%), with AUCs of 0.81 (95% CI, 0.74-0.88) and 0.75 (95% CI, 0.68-0.83), respectively. In ancestry-stratified analyses of the DFCI cohort, AUCs for the higher-performing model were 0.84 (95% CI, 0.81-0.86) in patients of European ancestry, 0.85 (95% CI, 0.72-0.94) in African ancestry, and 0.68 (95% CI, 0.55-0.78) in Asian ancestry. In sample type analyses, performance declined in pleural (AUC, 0.66; 95% CI, 0.56-0.76) compared with lung specimens (AUC, 0.86; 95% CI, 0.83-0.88). AI-guided triage analyses showed a potential 57% reduction in rapid EGFR testing, while maintaining sensitivity of 0.84 and specificity of 0.99.\n\nCONCLUSIONS: This cohort study found that AI-based pathology tools may serve as preliminary adjuncts for EGFR prediction in lung cancer, though performance differences by ancestry warrant careful interpretation."
    },
    {
      "pmid": "41661652",
      "doi": "10.1158/0008-5472.CAN-25-2764",
      "title": "The farnesyl transferase inhibitor darlifarnib (KO-2806) re-sensitizes relapsing tumors to RAS inhibition.",
      "journal": "Cancer research",
      "pubdate": "2026-02-09T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://doi.org/10.1158/0008-5472.can-25-2764",
      "metric_name": "SJR",
      "metric_value": 3.879,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41661652/",
      "url_doi": "https://doi.org/10.1158/0008-5472.CAN-25-2764",
      "abstract": "Resistance remains a key issue limiting the clinical benefit from RAS-targeting therapeutic agents and necessitates combination approaches. Here, we identified persistent mTORC1 activity in preclinical KRAS-mutant non-small cell lung cancer (NSCLC) and colorectal cancer (CRC) models as a frequent, nongenetic driver of inherent and adaptive resistance to RAS inhibition. This vulnerability was targetable with the farnesyl transferase inhibitor darlifarnib (KO-2806), which blocks mTORC1 activation via RHEB while sparing mTORC2 to limit associated toxicities. The addition of KO-2806 to NSCLC or CRC tumors progressing on mutant-selective RAS inhibitors led to rapid and durable tumor regression. In contrast, switching from mutant-selective to pan-RAS inhibitor monotherapy resulted in only stasis of NSCLC tumors and had no effect on CRC tumor progression. Further, the addition of KO-2806 rescued sensitivity of progressing tumors to the pan-RAS inhibitor RMC-6236. These results establish mTORC1 as an important mediator of escape from RAS inhibition and highlight KO-2806 as a promising RAS companion inhibitor in patients with prior RAS inhibitor exposure."
    },
    {
      "pmid": "41419100",
      "doi": "10.1016/j.canlet.2025.218223",
      "title": "Consensus on the diagnosis and treatment of unresectable stage III driver gene-positive non-small cell lung cancer.",
      "journal": "Cancer letters",
      "pubdate": "2026-02-28T00:00:00+00:00",
      "pubtypes": [
        "Journal Article",
        "Review"
      ],
      "entity": "NSCLC",
      "trial_type": "Review/Meta",
      "study_class": "Review",
      "is_oa": false,
      "oa_url": null,
      "metric_name": "SJR",
      "metric_value": 2.756,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41419100/",
      "url_doi": "https://doi.org/10.1016/j.canlet.2025.218223",
      "abstract": "Unresectable stage III non-small cell lung cancer (NSCLC) exhibits substantial heterogeneity and complexity. The landmark LAURA and POLESTAR studies have established a standard therapeutic model involving targeted consolidation therapy with osimertinib or aumolertinib after definitive chemoradiotherapy for NSCLC patients harboring EGFR-sensitive mutations. However, treatment strategies for patients with other driver gene mutations (e.g., ALK fusions, ROS1 rearrangement) still lack robust support from high-level evidence-based medical study. To enhance the standardization of diagnosis and treatment for unresectable stage III driver-positive NSCLC patients, the Radiotherapy Committee of the Chinese Society of Clinical Oncology convened an expert working group. This group identified common clinical practice issues and conducted an in-depth, problem-oriented analysis of domestic and international guidelines alongside evidence-based medical data. Through multiple rounds of comprehensive discussion and expert voting, this consensus was jointly developed. It provides evidence-based recommendations addressing frequently encountered clinical questions regarding unresectable stage III driver-positive NSCLC, aiming to serve as a key reference for clinical practice."
    },
    {
      "pmid": "41654892",
      "doi": "10.1186/s12967-026-07778-y",
      "title": "Multi-omics dynamic profiling reveals predictive biomarkers for first-line immunochemotherapy in extensive-stage small-cell lung cancer.",
      "journal": "Journal of translational medicine",
      "pubdate": "2026-02-07T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://doi.org/10.1186/s12967-026-07778-y",
      "metric_name": "SJR",
      "metric_value": 1.997,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41654892/",
      "url_doi": "https://doi.org/10.1186/s12967-026-07778-y",
      "abstract": null
    },
    {
      "pmid": "41616709",
      "doi": "10.1016/j.compbiomed.2026.111501",
      "title": "Influence of CT harmonization in longitudinal radiomics for NSCLC immunotherapy response prediction.",
      "journal": "Computers in biology and medicine",
      "pubdate": "2026-02-15T00:00:00+00:00",
      "pubtypes": [
        "Journal Article",
        "Multicenter Study"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": "SJR",
      "metric_value": 1.447,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41616709/",
      "url_doi": "https://doi.org/10.1016/j.compbiomed.2026.111501",
      "abstract": "This study investigates the variability of radiomic features in longitudinal CT scans from a multi-institutional NSCLC cohort and introduces a harmonization pipeline to improve predictive modeling of immunotherapy response. Baseline and follow-up CT scans from NSCLC patients treated with anti-PD-1/PD-L1 agents were analyzed, with two institutions combined for model training and internal testing, and a third institution serving as an external test set. To address variability from imaging parameters-such as scanner manufacturer, slice thickness, and noise-we applied image harmonization followed by feature harmonization using NestedComBat. This approach substantially reduced feature dependence on acquisition confounders (from 78.8% to 12.8%) and improved feature robustness across institutions. We further assessed the temporal consistency of radiomic features across longitudinal scans using the intraclass correlation coefficient (ICC). Image harmonization yielded the largest gains in stability (mean ΔICC = +0.021, p < 0.001), while the combined approach also enhanced longitudinal reliability (ΔICC = +0.014, p < 0.001). Finally, harmonization improved predictive performance for 6-month immunotherapy response, increasing the AUC from 0.695 to 0.768 in the internal test and from 0.692 to 0.802 in the external test. These results demonstrate that combining image- and feature-level harmonization enhances the robustness and temporal consistency of radiomic features, potentially supporting more reliable and generalizable predictive modeling across diverse datasets and clinical settings."
    },
    {
      "pmid": "41593906",
      "doi": "10.1080/07853890.2026.2620201",
      "title": "Clinicopathological characteristics and therapeutic outcomes in patients with non-small cell lung cancer harboring SMARCA4 mutations.",
      "journal": "Annals of medicine",
      "pubdate": "2026-12-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://doi.org/10.1080/07853890.2026.2620201",
      "metric_name": "SJR",
      "metric_value": 1.204,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41593906/",
      "url_doi": "https://doi.org/10.1080/07853890.2026.2620201",
      "abstract": "OBJECTIVE: To investigate the clinical characteristics and impact of\n\nMETHODS: A total of 2,821 patients with NSCLC who underwent next-generation sequencing were retrospectively included. The frequency and types of"
    },
    {
      "pmid": "41662869",
      "doi": "10.17849/insm-53-1-1-7.2",
      "title": "Are There Types of Early-Stage Adenocarcinomas That Are Insurable?",
      "journal": "Journal of insurance medicine (New York, N.Y.)",
      "pubdate": "2026-02-09T00:00:00+00:00",
      "pubtypes": [
        "Journal Article",
        "Review"
      ],
      "entity": "Other",
      "trial_type": "Review/Meta",
      "study_class": "Review",
      "is_oa": false,
      "oa_url": null,
      "metric_name": "SJR",
      "metric_value": 0.113,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41662869/",
      "url_doi": "https://doi.org/10.17849/insm-53-1-1-7.2",
      "abstract": "Lung cancer is the most common cause of cancer-related mortality worldwide. With the introduction of low-dose computed tomography (LDCT), detection of adenocarcinoma in situ (AIS) and minimally invasive adenocarcinoma (MIA) are increasingly being found in young, never-smoking females in Asia. There are survival studies suggesting that these early cancers, with resection, have no recurrence in 5 and even 10 years and therefore might be considered cured, allowing for favorable underwriting consideration for life insurance. However, other studies have shown incidences of secondary primary lung cancers (SPLCs) occurring within 10 years after surgical resections of AIS and MIA tumors, but with their clinical course and response to treatment appear to be better than original primary lung cancers, potentially still allowing for insurance with rating. The goal of this article is to review the evidence both for and against insuring these populations of lung cancer patients."
    },
    {
      "pmid": "41539180",
      "doi": "10.1016/j.ejca.2026.116221",
      "title": "Preclinical characterization and first-in-human, phase I trial of the novel ALK inhibitor dirozalkib in advanced non-small cell lung cancer.",
      "journal": "European journal of cancer (Oxford, England : 1990)",
      "pubdate": "2026-02-25T00:00:00+00:00",
      "pubtypes": [
        "Journal Article",
        "Multicenter Study"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Preclinical",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41539180/",
      "url_doi": "https://doi.org/10.1016/j.ejca.2026.116221",
      "abstract": "BACKGROUND: To investigate the preclinical characterization of dirozalkib, a novel anaplastic lymphoma kinase (ALK) inhibitor, and its safety, pharmacokinetics, and preliminary antitumor activity in advanced non-small cell lung cancer (NSCLC).\n\nMETHODS: The preclinical inhibitory effects of dirozalkib were evaluated in vitro and in vivo. The first-in-human phase I study (NCT05055232) enrolled patients with advanced NSCLC harboring ALK or ROS1 rearrangements. Participants received 50-600 mg/day dirozalkib following a 3 + 3 dose-escalation design with rapid titration, and 300-600 mg/day in the dose-expansion phase. The primary endpoint was safety.\n\nRESULTS: Dirozalkib demonstrated potent inhibition of ALK fusion-positive cell lines and common resistance mutations, and suppressed tumor growth in patient-derived and intracranial xenograft lung cancer models. No dose-limiting toxicities occurred, establishing 600 mg/day as the maximum tolerated dose. Among 114 patients enrolled, 55 (48.2 %) experienced grade ≥ 3 treatment-emergent adverse events, most commonly diarrhea (8.8 %). The objective response rate (ORR) among patients with ALK rearrangements was 47.4 % (9/19) and 46.3 % (38/82) in the dose-escalation and dose-expansion cohort (89.3 % in ALK inhibitor-naive patients receiving 500 mg/day). After a single dose of 50-600 mg dirozalkib, median time to maximum concentration ranged from 3 to 4 h. C\n\nCONCLUSIONS: Dirozalkib exhibited favorable safety, antitumor activity and pharmacokinetics in patients with advanced ALK-rearranged NSCLC. The recommended phase II dose was 500 mg/day.\n\nTRIAL REGISTRATION: Clinicaltrials.gov (NCT05055232) and Chinadrugtrials.org.cn (CTR20190984)."
    },
    {
      "pmid": "41671081",
      "doi": "10.1158/1078-0432.CCR-25-2173",
      "title": "Subcutaneously Administered Tislelizumab in Locally Advanced or Metastatic Non-Small Cell Lung Cancer: Pharmacokinetics and Safety Results from the BGB-A317-103 Phase I Study.",
      "journal": "Clinical cancer research : an official journal of the American Association for Cancer Research",
      "pubdate": "2026-02-11T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://doi.org/10.1158/1078-0432.ccr-25-2173",
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41671081/",
      "url_doi": "https://doi.org/10.1158/1078-0432.CCR-25-2173",
      "abstract": "PURPOSE: Tislelizumab, an anti-programmed cell death protein-1 monoclonal antibody, is approved for various indications intravenously. Subcutaneous delivery offers potential advantages in convenience and resource utilization. BGB-A317-103 assessed pharmacokinetics, safety, and efficacy of subcutaneous tislelizumab in treatment-naïve patients with advanced or metastatic non-small cell lung cancer.\n\nPATIENTS AND METHODS: BGB-A317-103 is an open-label, multicenter, phase I study. In Part 1 (dose/injection site exploration), patients received subcutaneous tislelizumab (abdomen or thigh injections; 300 mg) in 2 of the first 3 cycles and intravenous tislelizumab (200 mg) in the remaining cycle, followed by intravenous tislelizumab thereafter. In Part 2 (dose expansion), patients received 300 mg of subcutaneous tislelizumab in the thigh in all cycles. Both parts included chemotherapy during the first 4 to 6 cycles. Pharmacokinetics, bioavailability, efficacy, immunogenicity, and safety were assessed.\n\nRESULTS: At data cutoff (December 6, 2024), in Part 1 (N = 39), subcutaneous administration yielded higher trough concentrations than intravenous (geometric means: 23.1 μg/mL [thigh], 19.5 μg/mL [abdomen], and 14.8 μg/mL [intravenously]). Estimated bioavailability was 85.6% (thigh) and 72.4% (abdomen). In Part 2 (N = 22), subcutaneous tislelizumab in the thigh showed consistent pharmacokinetics with Part 1. Preliminary analysis showed overall response rate of 44.4%; median duration of response and median progression-free survival were not reached. Tislelizumab's safety profile was consistent with previous studies, with no new signals or injection-site reactions.\n\nCONCLUSIONS: Subcutaneous tislelizumab demonstrated high bioavailability after thigh and abdomen injections. Safety and efficacy were consistent with previous tislelizumab plus chemotherapy studies, warranting further investigation of subcutaneous tislelizumab."
    },
    {
      "pmid": "41499719",
      "doi": "10.1200/JCO-25-03012",
      "title": "Erratum: Simultaneous Durvalumab and Platinum-Based Chemoradiotherapy in Unresectable Stage III Non-Small Cell Lung Cancer: The Phase III PACIFIC-2 Study.",
      "journal": "Journal of clinical oncology : official journal of the American Society of Clinical Oncology",
      "pubdate": "2026-02-10T00:00:00+00:00",
      "pubtypes": [
        "Journal Article",
        "Published Erratum"
      ],
      "entity": "NSCLC",
      "trial_type": "Phase III",
      "study_class": "Prospective",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41499719/",
      "url_doi": "https://doi.org/10.1200/JCO-25-03012",
      "abstract": null
    },
    {
      "pmid": "41672197",
      "doi": "10.1016/j.jtho.2026.103607",
      "title": "BiTE (CD3×EGFR)-Based Triplet Therapy Unlocks CD40/CD40L Crosstalk to Revert Immunosuppression in third-generation EGFR-TKI-Refractory NSCLC.",
      "journal": "Journal of thoracic oncology : official publication of the International Association for the Study of Lung Cancer",
      "pubdate": "2026-02-09T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Preclinical",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41672197/",
      "url_doi": "https://doi.org/10.1016/j.jtho.2026.103607",
      "abstract": "INTRODUCTION: Acquired resistance to third-generation epidermal growth factor receptor tyrosine kinase inhibitors (EGFR-TKIs) is a major challenge in non-small cell lung cancer (NSCLC), with ∼50% of cases lacking precise resistance mechanisms. This study investigates the immunosuppressive tumor microenvironment (TME) driving resistance and develops a novel triple-combination therapy to restore T-cell anti-tumor activity.\n\nMETHODS: scRNA-seq and multicolor fluorescence staining were performed on NSCLC patient samples to analyze TME changes post-EGFR-TKI resistance. A triple therapy combining BC3448 (EGFR/CD3 BiTE), Tucidinostat (HDAC inhibitor), and WBP3425 (4-1BB agonist) was tested using in vitro co-culture assays, syngeneic cell-derived xenograft (CDX) models in humanized NOG-EXL mice, and multi-omics analyses.\n\nRESULTS: scRNA-seq revealed reduced T-cell infiltration/activation and increased immunosuppressive myeloid cells in resistant NSCLC. BC3448 monotherapy activated T-cells and induced tumor cell apoptosis in vitro, but was limited in vivo due to myeloid-driven immunosuppression. The triple therapy significantly enhanced tumor regression in osimertinib-resistant models (tumor growth inhibition >70%, p<0.001), promoted CD8+ effector T-cell differentiation, and suppressed Tregs/M2 macrophages. CD40/CD40L axis activation between T cells and monocyte-derived macrophages was critical for TME remodeling, with spatial profiling showing increased CD40L+ T cell and CD40+ macrophage proximity, correlating with higher IFN-γ and reduced angiogenesis. A durable response to BC3448 monotherapy was observed in an immunotherapy-resistant NSCLC patient (>2 years of stable disease), presenting a translational potential of this approach.\n\nCONCLUSION: This study establishes a novel triple therapy that overcomes the limitations of BiTEs in cold and immunosuppressive TMEs and provides an immunomodulatory approach to addressing third-generation EGFR-TKI resistance."
    },
    {
      "pmid": "41671908",
      "doi": "10.1016/j.lungcan.2026.109312",
      "title": "Validity and responsiveness of patient-reported outcomes common terminology criteria for adverse events (PRO-CTCAE) among Italian lung cancer patients.",
      "journal": "Lung cancer (Amsterdam, Netherlands)",
      "pubdate": "2026-02-08T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41671908/",
      "url_doi": "https://doi.org/10.1016/j.lungcan.2026.109312",
      "abstract": "BACKGROUND: Patient-reported symptom monitoring may improve the outcomes of cancer treatment. Knowledge of psychometric properties may drive the selection of optimal tools. Here we report the analysis of PRO-CTCAE in Italian lung cancer patients.\n\nMETHODS: A PRO-CTCAE list (74 items, 44 symptoms) was administered to on-treatment patients at registration (visit 1) and after 2-6 weeks (visit 2). Convergent validity with EORTC LC-13 and Hospital Anxiety and Depression Scale (HADS) was assessed by Pearson correlation. Known-group validity and responsiveness were tested with ECOG performance status (PS 0 vs 1) and Patients' Global Impression of Change (PGIC) scale as anchors, respectively.\n\nRESULTS: From September 2019 to November 2022, 186 patients filled PRO-CTCAE at visit 1 and 164 at visit 2. Median age (IQR) was 66.4 (60.9 - 73.1) years; 58.6% were male; 68.0% had PS 0. Convergent validity showed high correlation (r ≥ 0.50) of PRO-CTCAE hair loss (r = 0.78), dyspnoea (0.63), limb numbness (0.63), cough (0.58) and pain (0.51) with selected LC-13 anchors. PRO-CTCAE anxiety, depression and sadness highly correlated with HADS. For known-group validity, small to medium correlations were found for oral, cutaneous and respiratory toxicity, fatigue, appetite loss, insomnia and depression, that were worse for PS 1; limb swelling and pain were worse in PS 0. Responsiveness analysis at visit 2 found some PRO-CTCAE score changes consistently and directly correlated with impression of change measured with PGIC.\n\nCONCLUSIONS: These results support the use of selected PRO-CTCAE items for lung cancer patients as a reliable tool for detection of treatment related toxicities."
    },
    {
      "pmid": "41671905",
      "doi": "10.1016/j.lungcan.2026.109310",
      "title": "Phase I study of amrubicin plus cisplatin and concurrent accelerated hyperfractionated thoracic radiotherapy for limited-stage small cell lung cancer.",
      "journal": "Lung cancer (Amsterdam, Netherlands)",
      "pubdate": "2026-02-08T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "SCLC",
      "trial_type": null,
      "study_class": "Preclinical",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41671905/",
      "url_doi": "https://doi.org/10.1016/j.lungcan.2026.109310",
      "abstract": "BACKGROUND: Etoposide plus cisplatin (EP) with concurrent accelerated hyperfractionated thoracic radiotherapy (AHTRT) remains the standard treatment for unresectable limited-stage (LS) small cell lung cancer (SCLC)) for over two decades. Our previous study demonstrated that amrubicin plus cisplatin (AP) with once-daily thoracic radiotherapy (50 Gy per 25 fractions) for LS-SCLC prolonged overall survival (OS) to 39.5 months with manageable toxicities. To enhance therapeutic efficacy, this study aimed to assess the feasibility of AP combined with AHTRT for LS-SCLC.\n\nMETHODS: Treatment-naïve patients aged 20-75 years with LS-SCLC, performance status 0-1, and adequate organ function were enrolled. Chemotherapy consisted of cisplatin 60 mg/m\n\nRESULTS: Nine patients were enrolled in this study. Dose-limiting toxicities included Grade 3 febrile neutropenia and Grade 3 hypokalemia. The recommended and maximum tolerated dose of amrubicin was 25 mg/m\n\nCONCLUSION: AP combined with AHTRT from the first chemotherapy cycle was well tolerated at the recommended amrubicin dose of 25 mg/m"
    },
    {
      "pmid": "41666849",
      "doi": "10.1016/j.lungcan.2026.109304",
      "title": "Participation in lung cancer biospecimen studies: an analysis of the ECOG-ACRIN phase 3 E1505 and E5508 clinical trials.",
      "journal": "Lung cancer (Amsterdam, Netherlands)",
      "pubdate": "2026-02-07T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41666849/",
      "url_doi": "https://doi.org/10.1016/j.lungcan.2026.109304",
      "abstract": "BACKGROUND: Biospecimen analyses may provide important insights into patient selection and pharmacodynamic effects. To provide generalizable findings, such studies must enroll adequate and diverse populations.\n\nMETHODS: We analyzed patient and institutional characteristics according to agreement to participate in optional, embedded biospecimen studies among patients enrolled in the E1505 and E5508 phase 3 lung cancer therapeutic trials. Differences were compared using Wilcoxon rank sum test, Pearson's Chi-squared test, and logistic regression.\n\nRESULTS: Overall, 3,017 patients were enrolled in the two trials. Mean age was 63 years, 49% were female, and 83% were non-Hispanic white. Among these individuals, 2,692 (89%) agreed to participate in at least one biospecimen study, and 2,577 (85%) agreed to studies requiring future biospecimen collection. In multivariable logistic regression, compared to non-Hispanic white patients, other patients were less likely to agree to participate: OR 0.59 (95% CI, 0.45-0.79; P < 0.001) for any biospecimen study; OR 0.62 (95% CI, 0.48-0.80; P < 0.001) for studies requiring future biospecimen collection. Women and patients treated outside main academic institutions (e.g., affiliates, community sites) were also less likely to participate.\n\nCONCLUSIONS: Among patients enrolled in lung cancer clinical trials, women, racial and ethnic minorities, and patients treated outside major academic centers are less likely to participate in optional biospecimen studies. Because some of these populations may already be under-represented in trial populations, this pattern may exacerbate disparities in translational and clinical research.\n\nTRIAL REGISTRATION: NCT00324805, NCT01107626."
    },
    {
      "pmid": "41654519",
      "doi": "10.1038/s41467-026-69216-3",
      "title": "Pan-RAF inhibitor exarafenib targets BRAF class II/III NSCLC and reveals ARAF-KSR1 resistance and combination strategies.",
      "journal": "Nature communications",
      "pubdate": "2026-02-07T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Preclinical",
      "is_oa": true,
      "oa_url": "https://doi.org/10.1038/s41467-026-69216-3",
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41654519/",
      "url_doi": "https://doi.org/10.1038/s41467-026-69216-3",
      "abstract": "Oncogenic BRAF mutations, including those in non-small cell lung cancer (NSCLC), are classified as Class I, II, or III. While approved therapies exist for BRAF Class I mutants, no approved therapies exist for Class II and III BRAF-mutated NSCLC. Analysis of a circulating tumor DNA database reveals Class II and III mutations comprise ~65% of BRAF-mutant NSCLC cases, with Class II patients showing worse outcomes than Class I. Exarafenib, a distinct pan-RAF inhibitor, demonstrates potent activity against BRAF Class II and III mutant preclinical models and initial clinical activity. Resistance studies reveal rewiring to an ARAF-mediated bypass pathway, characterized by RAS-mediated ARAF-KSR1 complexes maintaining MAPK signaling despite pan-RAF inhibitor treatment. RAS or MEK inhibition co-targeting is effective against this resistance mechanism. This study provides preclinical rationale for clinical testing of exarafenib in BRAF Class II/III cancers and unveils RAS-mediated ARAF-KSR1 complex formation as a resistance mechanism and rational co-therapy strategies."
    }
  ]
}