{
  "generated": "2026-01-10T05:19:26.985049Z",
  "items": [
    {
      "pmid": "41491099",
      "doi": "10.1038/s41591-025-04060-4",
      "title": "AI-enabled virtual spatial proteomics from histopathology for interpretable biomarker discovery in lung cancer.",
      "journal": "Nature medicine",
      "pubdate": "2026-01-05T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://doi.org/10.1038/s41591-025-04060-4",
      "metric_name": "SJR",
      "metric_value": 18.333,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41491099/",
      "url_doi": "https://doi.org/10.1038/s41591-025-04060-4",
      "abstract": "Spatial proteomics enables high-resolution mapping of protein expression and can transform our understanding of biology and disease. However, major challenges remain for clinical translation, including cost, complexity and scalability. Here we present H&E to protein expression (HEX), an AI model designed to computationally generate spatial proteomics profiles from standard histopathology slides. Trained and validated on 819,000 histopathology image tiles with matched protein expression from 382 tumor samples, HEX accurately predicts the expression of 40 biomarkers encompassing immune, structural and functional programs. HEX demonstrates substantial performance gains over alternative methods for protein expression prediction from H&E images. We develop a multimodal data integration approach that combines the original H&E image and AI-derived virtual spatial proteomics to enhance outcome prediction. Applied to six independent non-small-cell lung cancer cohorts totaling 2,298 patients, HEX-enabled multimodal integration improved prognostic accuracy by 22% and immunotherapy response prediction by 24-39% compared with conventional clinicopathological and molecular biomarkers. Biological interpretation revealed spatially organized tumor-immune niches predictive of therapeutic response, including the co-localization of T helper cells and cytotoxic T cells in responders, and immunosuppressive tumor-associated macrophage and neutrophil aggregates in non-responders. HEX provides a low-cost and scalable approach to study spatial biology and enables the discovery and clinical translation of interpretable biomarkers for precision medicine."
    },
    {
      "pmid": "41507539",
      "doi": "10.1038/s43018-025-01104-z",
      "title": "Clinical outcomes with perioperative nivolumab by nodal status in patients with stage III resectable NSCLC: phase 3 CheckMate 77T exploratory analysis.",
      "journal": "Nature cancer",
      "pubdate": "2026-01-08T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Preclinical",
      "is_oa": false,
      "oa_url": null,
      "metric_name": "SJR",
      "metric_value": 11.941,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41507539/",
      "url_doi": "https://doi.org/10.1038/s43018-025-01104-z",
      "abstract": "Individuals with non-small-cell lung cancer (NSCLC) with metastases to the ipsilateral mediastinum or subcarinal lymph nodes (N2 disease) have poor long-term survival. This exploratory analysis from the randomized phase 3 CheckMate 77T study assessed clinical outcomes by nodal status in individuals with stage III NSCLC who received neoadjuvant nivolumab plus chemotherapy followed by surgery and adjuvant nivolumab (nivolumab) versus neoadjuvant chemotherapy followed by surgery and adjuvant placebo (placebo). Here we show that among patients with N2 disease, nivolumab versus placebo improved event-free survival (1-year rate, 70% versus 45%; hazard ratio, 0.46 (95% confidence interval, 0.30-0.70)) and pathological complete response rate (22.0% versus 5.6%); 77% versus 73% had definitive surgery, of whom 84% versus 74% received a simple lobectomy. Furthermore, nivolumab improved outcomes versus placebo in patients with multistation N2 NSCLC (1-year event-free survival rate: 71% versus 46%; hazard ratio, 0.43 (0.21-0.88); pathological complete response rate, 29.0% versus 2.7%). In the N2 subgroup with definitive surgery, 67% and 59% of patients had nodal downstaging after surgery (57% versus 44% downstaged to node-negative disease). Median EFS in randomized patients with stage III non-N2 NSCLC was not reached with nivolumab and 17.0 months with placebo (1-year EFS rate, 74% versus 62%; hazard ratio, 0.60 (0.33-1.08)). No new safety signals were identified. These findings support perioperative nivolumab plus neoadjuvant chemotherapy as an efficacious treatment for stage III N2 disease and suggest that N2 status may not predict poor prognosis in resectable NSCLC treated with perioperative immunotherapy. ClinicalTrials.gov identifier: NCT04025879 ."
    },
    {
      "pmid": "41506440",
      "doi": "10.1016/j.canlet.2025.218229",
      "title": "Automated CT-derived Body Composition Predicts Pathologic Response to Neoadjuvant Immunotherapy in Non-Small Cell Lung Cancer.",
      "journal": "Cancer letters",
      "pubdate": "2026-01-06T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": "SJR",
      "metric_value": 2.756,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41506440/",
      "url_doi": "https://doi.org/10.1016/j.canlet.2025.218229",
      "abstract": "Tumor-intrinsic biomarkers alone insufficiently predict pathological complete response (pCR) to neoadjuvant immunochemotherapy (NICT) in non-small cell lung cancer (NSCLC). Artificial intelligence (AI)-based three-dimensional CT-derived body composition may provide complementary predictive value. We evaluated its association with pCR following NICT in NSCLC. This multicenter retrospective study of NSCLC patients treated with NICT in China between July 2019 and July 2024. Pre- and post-treatment CT scans were used for automated T1-T12 localization and volumetric body composition segmentation. Metrics included skeletal muscle, intermuscular, visceral, and subcutaneous adipose volume index (SAVI), and their percentage changes between scans. Among 657 patients (mean age, 61.3 years; 87.4% men), pCR rates were 39.7% (training), 38.4% (internal validation), and 34.9% (external validation). In multivariable analysis, high baseline skeletal muscle volume index (SMVI) was independently associated with pCR (OR= 2.22). During NICT, each 1% relative increase in SMVI was associated with a 16% higher likelihood of pCR (OR= 1.16), whereas every 10% relative increase in SAVI improved pCR probability (OR= 1.56). A machine learning model integrating clinical variables, baseline SMVI, %ΔSMVI, and %ΔSAVI demonstrated significantly better discrimination than models using clinical variables alone (p <0.05) in all cohorts. The performance was observed in the internal and external validation cohorts, with sensitivities of 62.1% and 52.8%, and specificities of 66.7% and 74.7%, respectively. AI-based CT-derived body composition quantification, particularly baseline SMVI and dynamic changes in SMVI and SAVI during NICT, are independently associated with pCR in NSCLC. Incorporating these modifiable biomarkers into predictive models improves performance beyond clinical variables alone."
    },
    {
      "pmid": "41491679",
      "doi": "10.1186/s12885-025-15509-7",
      "title": "Patient preference for first-line treatments of ALK-positive metastatic non-small cell lung cancer: a discrete choice experiment.",
      "journal": "BMC cancer",
      "pubdate": "2026-01-05T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://doi.org/10.1186/s12885-025-15509-7",
      "metric_name": "SJR",
      "metric_value": 1.178,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41491679/",
      "url_doi": "https://doi.org/10.1186/s12885-025-15509-7",
      "abstract": null
    },
    {
      "pmid": "41421886",
      "doi": "10.1016/j.ejca.2025.116069",
      "title": "Bridging the gap in lung cancer: A comprehensive global strategy for change.",
      "journal": "European journal of cancer (Oxford, England : 1990)",
      "pubdate": "2026-01-17T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Preclinical",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41421886/",
      "url_doi": "https://doi.org/10.1016/j.ejca.2025.116069",
      "abstract": "BACKGROUND: Unless greater awareness inspires action, lung cancer will become the next global public health emergency. Despite improvements in screening, diagnosis, and treatments, more must be done because global incidence continues to increase. Concerted action must address the burden both between and within countries. Inequalities result from the uneven distribution of resources while inequities result from differences in prevention, screening, diagnosis, and treatment.\n\nMETHOD: Participants in the 9th International Lung Cancer Network conference (Athens, June 2023) received an advanced draft of the declaration with a confidentiality notice by email upon completion of online registration. They were invited to provide comments and suggestions up to seven days before the meeting. All contributions were reviewed by the authors and incorporated into the final version circulated the day before the meeting began. Although not a formal Delphi-style process, this approach prioritized inclusivity, transparency, and broad endorsement. Outreach extended beyond onsite attendees, ensuring diverse perspectives and representation. This process complements methodological consensus approaches by uniting stakeholders around shared policy goals.\n\nRESULTS: At the 9th International Lung Cancer Network conference, participants were invited to sign the final declaration, and 785 did so. Since then, 20 organizations worldwide have formally endorsed the Consensus Statement, and support continues to grow. The inclusive design has fostered broad and sustained backing, underscoring the value of the Statement as a unifying policy declaration advancing shared principles.\n\nCONCLUSION: The Consensus Statement, Bridging the Gap in the Diagnosis and Management of Lung Cancer, reinforces five unifying principles: improve and expand prevention; focus on early detection; ensure equitable and sustainable access to treatment; build partnerships and promote investment; and, combat stigma, recognizing it as a social determinant of public health."
    },
    {
      "pmid": "41501152",
      "doi": "10.1038/s41571-025-01112-z",
      "title": "A guide to cancer screening.",
      "journal": "Nature reviews. Clinical oncology",
      "pubdate": "2026-01-07T00:00:00+00:00",
      "pubtypes": [
        "Journal Article",
        "Review"
      ],
      "entity": "Other",
      "trial_type": "Review/Meta",
      "study_class": "Review",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41501152/",
      "url_doi": "https://doi.org/10.1038/s41571-025-01112-z",
      "abstract": "The aim of cancer screening is to identify pre-malignant conditions, which can be removed or treated, or earlier-stage disease, for which treatment is more likely to be curative, in non-symptomatic individuals. Currently, screening programmes are being consolidated for five cancer types (breast, prostate, cervical, colorectal and lung) and several other cancer types are the focus of specific initiatives. Cancer screening is at a point of potential major transformation owing to technological advances in detection. In this Review, we first recapitulate the general principles of cancer screening. We then provide a timely overview of the current screening practices for breast, cervical, colorectal, prostate and lung cancer, addressing major challenges and potential future changes in practice. We also discuss other malignancies for which screening initiatives might be worth considering. Finally, we highlight technological developments in cancer detection that might hold promise for screening an increasing number of cancers in the future, notably some that reflect unmet needs."
    },
    {
      "pmid": "41499719",
      "doi": "10.1200/JCO-25-03012",
      "title": "Erratum: Simultaneous Durvalumab and Platinum-Based Chemoradiotherapy in Unresectable Stage III Non-Small Cell Lung Cancer: The Phase III PACIFIC-2 Study.",
      "journal": "Journal of clinical oncology : official journal of the American Society of Clinical Oncology",
      "pubdate": "2026-01-07T00:00:00+00:00",
      "pubtypes": [
        "Journal Article",
        "Published Erratum"
      ],
      "entity": "NSCLC",
      "trial_type": "Phase III",
      "study_class": "Prospective",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41499719/",
      "url_doi": "https://doi.org/10.1200/JCO-25-03012",
      "abstract": null
    },
    {
      "pmid": "41494984",
      "doi": "10.1093/ejcts/ezag008",
      "title": "Financial burden of postoperative adverse events following lobectomy: Cost analysis from 10 high volume Canadian hospitals.",
      "journal": "European journal of cardio-thoracic surgery : official journal of the European Association for Cardio-thoracic Surgery",
      "pubdate": "2026-01-06T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Other",
      "trial_type": null,
      "study_class": "Preclinical",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41494984/",
      "url_doi": "https://doi.org/10.1093/ejcts/ezag008",
      "abstract": "OBJECTIVES: Lobectomy remains a cornerstone of curative intent treatment for lung cancer; however, postoperative adverse events remain common, harmful and costly. To support value-based quality improvement programs, we sought to estimate the in-hospital costs of adverse events following lobectomy and identify which complications are the primary cost drivers.\n\nMETHODS: Lobectomy data from 10 Canadian hospitals were included (2017-2022). Annual lobectomy volume, demographics, length of stay, incidence and severity of adverse events were obtained from a prospectively collected national database. Using literature-derived index hospitalization costs of adverse events, supported by Canadian Institution of Health Information database, estimates of annual AE costs were obtained (2025 CDN$).\n\nRESULTS: Mean annual lobectomy volume 1150 (SD = 165): 44% male, aged 67 years (SD = 10.9), median length of stay of 4 days (IQR = 4), with minimally invasive surgery performed in 86%. Prolonged Air Leak contributed 51% of total adverse events occurrences, followed by atrial arrhythmia (13%), pneumonia (7.9%), reoperation (5.2%), atelectasis (3.9%), delirium (3.4%), transfusion (2.8%), respiratory failure (2.8%), empyema (2.2%), acute kidney injury (1.7%), and pulmonary embolism (1.2%), adding over $7.31 million (M) to hospital-level costs. Prolonged Air Leak, mean annual incidence of 17%, was the strongest driver of costs. Extrapolated nationally, lobectomy-related adverse events are estimated to contribute over $48 million in excess annual costs.\n\nCONCLUSIONS: Postoperative adverse events following lobectomy impose substantial financial burdens, with Prolonged Air Leak alone accounting for more than half of total costs. These findings underscore the need for value-based quality improvement initiatives targeting high-impact adverse events, requiring coordinated action among surgeons, hospital leadership, and policymakers."
    }
  ]
}