{
  "generated": "2026-02-03T05:49:25.055286Z",
  "items": [
    {
      "pmid": "41616774",
      "doi": "10.1016/j.ccell.2026.01.001",
      "title": "Emerging landscape of KRAS inhibitors in cancer treatment.",
      "journal": "Cancer cell",
      "pubdate": "2026-01-29T00:00:00+00:00",
      "pubtypes": [
        "Journal Article",
        "Review"
      ],
      "entity": "Other",
      "trial_type": "Review/Meta",
      "study_class": "Review",
      "is_oa": true,
      "oa_url": "https://doi.org/10.1016/j.ccell.2026.01.001",
      "metric_name": "SJR",
      "metric_value": 19.027,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41616774/",
      "url_doi": "https://doi.org/10.1016/j.ccell.2026.01.001",
      "abstract": "Alterations in KRAS, NRAS, and HRAS occur in roughly 20% of patients with cancer, making RAS one of the most intensively studied oncogenic targets. The discovery of mutant-selective KRAS"
    },
    {
      "pmid": "41629425",
      "doi": "10.1038/s41591-025-04181-w",
      "title": "Time-of-day immunochemotherapy in nonsmall cell lung cancer: a randomized phase 3 trial.",
      "journal": "Nature medicine",
      "pubdate": "2026-02-02T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "SCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": "SJR",
      "metric_value": 18.333,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41629425/",
      "url_doi": "https://doi.org/10.1038/s41591-025-04181-w",
      "abstract": "Retrospective studies suggest that early time-of-day (ToD) infusions of immunochemotherapy may improve efficacy. However, prospective randomized controlled trials are needed to validate it. In this randomized phase 3 LungTIME-C01 trial, 210 patients with treatment naive stage IIIC-IV nonsmall cell lung cancer (NSCLC) lacking driver mutations were randomly assigned in a 1:1 ratio to either an early or late ToD group, defined by the administration of the first four cycles of an anti-PD-1 agent before or after 15:00 h. The primary endpoint was progression-free survival (PFS), while secondary endpoints included overall survival (OS) and objective response rate (ORR). After a median follow-up of 28.7 months, the median PFS was 11.3 months (95% confidence interval (CI) = 9.2-13.4) in the early ToD group and 5.7 months (95% CI = 5.2-6.2) in the late ToD group, corresponding to a hazard ratio (HR) for earlier disease progression of 0.40 (95% CI = 0.29-0.55; P < 0.001). The median OS was 28.0 months (95% CI = not estimable (NE)-NE) in the early ToD group and 16.8 months (95% CI = 13.7-19.9) in the late ToD group, corresponding to an HR of an earlier death of 0.42 (95% CI = 0.29-0.60; P < 0.001). Treatment-related adverse events were consistent with the established safety profile, with no new safety signals observed. No significant differences in immune-related adverse events were observed between the two groups. Over the first four cycles, morning circulating CD8"
    },
    {
      "pmid": "41606121",
      "doi": "10.1038/s41591-025-04186-5",
      "title": "Fecal microbiota transplantation plus immunotherapy in non-small cell lung cancer and melanoma: the phase 2 FMT-LUMINate trial.",
      "journal": "Nature medicine",
      "pubdate": "2026-01-28T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://www.nature.com/articles/s41591-025-04186-5.pdf",
      "metric_name": "SJR",
      "metric_value": 18.333,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41606121/",
      "url_doi": "https://doi.org/10.1038/s41591-025-04186-5",
      "abstract": "Immune checkpoint inhibitors (ICI) have improved outcomes for patients with non-small cell lung cancer (NSCLC) and melanoma, yet over half of patients exhibit primary resistance. Fecal microbiota transplantation (FMT) may overcome resistance to anti-programmed cell death protein 1 (PD-1) therapy. The clinical activity and safety of FMT plus anti-PD-1 in NSCLC or anti-PD-1 plus anti-cytotoxic T-lymphocyte antigen 4 (CTLA-4) therapy in melanoma have not been evaluated. Here we report results from FMT-LUMINate, a multicenter, open-label, phase 2 trial assessing healthy donor FMT plus anti-PD-1 in NSCLC (n = 20) or anti-PD-1 plus anti-CTLA-4 (dual ICI) in melanoma (n = 20), in the first-line setting. Eligible patients received a single FMT via oral capsules prior to ICI initiation. The primary endpoint was objective response rate (ORR) in NSCLC. Secondary endpoints included ORR in melanoma, safety and donor-host microbiome similarity. In NSCLC, the ORR was 80% (16/20), meeting the study primary endpoint. In melanoma, the ORR was 75% (15/20). FMT was deemed safe in both cohorts by an independent data and safety monitoring committee, with no grade 3 or higher adverse events (AEs) in NSCLC and 13 (65%) patients experiencing grade 3 or higher AEs in melanoma. Shotgun metagenomic sequencing revealed that responders developed a distinct post-FMT gut microbiome composition, independent of acquired donor-recipient similarity or strain-level engraftment. Responders exhibited significantly greater loss of baseline bacterial species compared to non-responders, with frequent depletion of Enterocloster citroniae, E. lavalensis and Clostridium innocuum. This finding was reproduced across three published FMT oncology trials. We recolonized antibiotic-treated, tumor-bearing mice with post-FMT stool from two responder patients, and reintroduction of the specific bacterial species that were lost after FMT abrogated the antitumor effect of ICI. Taken together, these findings confirm the clinical activity of FMT in combination with ICI and suggest that the elimination of deleterious taxa is required for FMT-mediated therapeutic benefit. ClinicalTrials.gov identifier: NCT04951583 ."
    },
    {
      "pmid": "41604461",
      "doi": "10.1126/scitranslmed.adx6873",
      "title": "SREBP-1 increases glucose uptake to promote tumor resistance to lysosome inhibition.",
      "journal": "Science translational medicine",
      "pubdate": "2026-01-28T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": "SJR",
      "metric_value": 6.722,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41604461/",
      "url_doi": "https://doi.org/10.1126/scitranslmed.adx6873",
      "abstract": "Lysosomes are critical for maintaining cellular homeostasis and nutrient availability, yet how tumor cells survive under lysosomal inhibition remains unclear. Here, we revealed that inhibiting lysosome function with chloroquine unexpectedly stimulated glucose uptake across various cancer cells. This effect was driven by sterol regulatory element-binding protein 1 (SREBP-1), a key lipogenic transcription factor, which specifically increased the expression of glucose transporters GLUT3 and GLUT6, enhancing glucose uptake and macromolecule synthesis. Elevated glucose, induced by chloroquine, stabilized SREBP cleavage-activating protein (SCAP), the activator of SREBP-1, further amplifying its activity and contributing to tumor resistance to lysosome inhibition. Disrupting this SREBP-1-glucose uptake feedforward loop by combining chloroquine with inhibitors of glucose transporters, SREBP-1, or lipogenic enzymes induced a synergistic antitumor effect in squamous cell and adenocarcinoma lung cancer patient-derived organoids and xenografts. This combination impaired mitochondrial structure and function, inducing apoptotic tumor cell death. Our study uncovers a role for SREBP-1 in regulating glucose metabolism and provides a promising therapeutic strategy that combines lysosome inhibition with glucose transporter or lipogenic enzyme inhibition for effective cancer treatment."
    },
    {
      "pmid": "41619151",
      "doi": "10.1007/s40265-025-02276-9",
      "title": "First Line and Treatment Sequencing in EGFR-Mutated Metastatic NSCLC: What is Right for Which Patient?",
      "journal": "Drugs",
      "pubdate": "2026-01-31T00:00:00+00:00",
      "pubtypes": [
        "Journal Article",
        "Review"
      ],
      "entity": "NSCLC",
      "trial_type": "Review/Meta",
      "study_class": "Review",
      "is_oa": false,
      "oa_url": null,
      "metric_name": "SJR",
      "metric_value": 3.362,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41619151/",
      "url_doi": "https://doi.org/10.1007/s40265-025-02276-9",
      "abstract": "The therapeutic landscape for non-small-cell lung cancer (NSCLC) harbouring epidermal growth factor (EGFR) gene mutations is undergoing significant transformation. For classical EGFR mutations such as exon 19 deletion and exon 21 L858R mutation, combination strategies in the first-line setting, based on the results of the MARIPOSA (lazertinib and amivantamab) and FLAURA 2 (platinum-based doublet chemotherapy and osimertinib) trials, provide promising outcomes. Compared to osimertinib monotherapy, they potentially delay both the onset of molecular resistance to treatment and the intracranial progression of the disease. Selecting the best first-line option should take into consideration patient and genome-related factors as well as the burden of the disease including the presence of central nervous system metastases. Beyond first-line therapy, novel agents-including antibody-drug conjugates, bispecific antibodies, and T-cell engagers-have emerged as innovative options for pretreated patients with EGFR-mutated disease. Optimising the treatment sequence in advanced EGFR-mutated NSCLC is crucial to ensure the best survival outcomes along with the best treatment tolerance and quality of life. Predictive biomarkers are strongly needed as well as biomarker-based escalation and de-escalation clinical trials."
    },
    {
      "pmid": "41419100",
      "doi": "10.1016/j.canlet.2025.218223",
      "title": "Consensus on the diagnosis and treatment of unresectable stage III driver gene-positive non-small cell lung cancer.",
      "journal": "Cancer letters",
      "pubdate": "2026-02-28T00:00:00+00:00",
      "pubtypes": [
        "Journal Article",
        "Review"
      ],
      "entity": "NSCLC",
      "trial_type": "Review/Meta",
      "study_class": "Review",
      "is_oa": false,
      "oa_url": null,
      "metric_name": "SJR",
      "metric_value": 2.756,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41419100/",
      "url_doi": "https://doi.org/10.1016/j.canlet.2025.218223",
      "abstract": "Unresectable stage III non-small cell lung cancer (NSCLC) exhibits substantial heterogeneity and complexity. The landmark LAURA and POLESTAR studies have established a standard therapeutic model involving targeted consolidation therapy with osimertinib or aumolertinib after definitive chemoradiotherapy for NSCLC patients harboring EGFR-sensitive mutations. However, treatment strategies for patients with other driver gene mutations (e.g., ALK fusions, ROS1 rearrangement) still lack robust support from high-level evidence-based medical study. To enhance the standardization of diagnosis and treatment for unresectable stage III driver-positive NSCLC patients, the Radiotherapy Committee of the Chinese Society of Clinical Oncology convened an expert working group. This group identified common clinical practice issues and conducted an in-depth, problem-oriented analysis of domestic and international guidelines alongside evidence-based medical data. Through multiple rounds of comprehensive discussion and expert voting, this consensus was jointly developed. It provides evidence-based recommendations addressing frequently encountered clinical questions regarding unresectable stage III driver-positive NSCLC, aiming to serve as a key reference for clinical practice."
    },
    {
      "pmid": "41622242",
      "doi": "10.1186/s12967-026-07766-2",
      "title": "Multiomics analysis reveals that senescent CXCL16(+) macrophages promote lung adenocarcinoma progression through TGF-β signalling.",
      "journal": "Journal of translational medicine",
      "pubdate": "2026-02-02T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": "SJR",
      "metric_value": 1.997,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41622242/",
      "url_doi": "https://doi.org/10.1186/s12967-026-07766-2",
      "abstract": "BACKGROUND: Lung adenocarcinoma (LUAD) is the most common histological subtype of lung cancer and remains a leading cause of cancer-related mortality worldwide. Although, immunotherapy has become a cornerstone of first-line treatment, only 20-30% of patients achieve a durable clinical benefit, largely because of the complexity and heterogeneity of the tumour immune microenvironment. Emerging evidence indicates that cellular senescence, particularly within immune cells, contributes to tumour progression by impairing antitumour immunity; however, its mechanistic role in LUAD remains incompletely understood.\n\nMETHODS: We performed an integrative multiomics analysis incorporating genome-wide association studies (GWASs), bulk RNA sequencing, single-cell RNA sequencing, and spatial transcriptomics to characterize immune heterogeneity in LUAD. Cellular senescence was validated by performing staining for senescence-associated β-galactosidase and the canonical markers p16 and p21. SHAP analysis was applied to evaluate the contribution of CXCL16\n\nRESULTS: A summary data-based on Mendelian randomization analysis integrating GWAS and TCGA data identified CXCL16 as a senescence-associated gene that is causally linked to the LUAD risk. Single-cell RNA sequencing revealed that CXCL16 is predominantly expressed in macrophages, and the pseudotime analysis together with β-galactosidase staining confirmed its association with macrophage senescence. Spatial transcriptomics and immunofluorescence staining showed the marked enrichment of CXCL16\n\nCONCLUSIONS: CXCL16 promotes macrophage senescence, and senescent CXCL16"
    },
    {
      "pmid": "41627979",
      "doi": "10.1111/cas.70310",
      "title": "Analysis of Peripheral T Cell Profiling and Plasma Proteomics in Advanced NSCLC Patients Treated With Atezolizumab.",
      "journal": "Cancer science",
      "pubdate": "2026-02-02T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": "SJR",
      "metric_value": 1.661,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41627979/",
      "url_doi": "https://doi.org/10.1111/cas.70310",
      "abstract": "We investigated immunologic biomarkers that predict outcomes of patients with previously treated metastatic non-small cell lung cancer who were enrolled in the J-TAIL study, a prospective, observational study of atezolizumab monotherapy. Of 262 patients participating in the J-TAIL exploratory study, peripheral blood mononuclear cells were obtained from 51 patients and analyzed by T-cell fractionation analysis using Helios mass cytometry and serum proteomics analysis. Following treatment with atezolizumab, an increase in programmed cell death-1 (PD-1)-expressing CD8 and CD4 T-cell populations was observed. A more pronounced increase in PD-1 expression was seen in T cells from patients whose progression-free survival (PFS) was 100 days or longer compared with those with shorter PFS. The proximity extension assay, which is highly sensitive multiplex analysis technology that combines antibody-based affinity assays with next-generation sequencing, showed a significant increase in FOXO1, possibly in response to precursor-exhausted T-cell population activation. Immune-related adverse events were associated with a high percentage of PD-1-positive cells on effector memory CD8 T cells, which was thought to be accompanied by extremely high CD8 T-cell activation. Further analysis distinguished poor prognosis populations with significant differences in CD62L"
    },
    {
      "pmid": "41611341",
      "doi": "10.1111/cas.70330",
      "title": "Four-Year Outcomes for Nivolumab With Chemotherapy and Bevacizumab in Patients With Nonsquamous NSCLC in the TASUKI-52.",
      "journal": "Cancer science",
      "pubdate": "2026-01-29T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://onlinelibrary.wiley.com/doi/pdfdirect/10.1111/cas.70330",
      "metric_name": "SJR",
      "metric_value": 1.661,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41611341/",
      "url_doi": "https://doi.org/10.1111/cas.70330",
      "abstract": "In the Phase III TASUKI-52 trial, nivolumab with carboplatin, paclitaxel (CP), plus bevacizumab significantly prolonged progression-free survival (PFS), and resulted in longer overall survival (OS) in patients with advanced nonsquamous non-small cell lung cancer (NSCLC). This final analysis evaluated 4-year treatment outcomes in terms of OS, PFS and duration of response (DOR) by investigator assessment and safety, as well as the background characteristics and treatment courses associated with 4-year survivors. Patients were randomized 1:1 to receive nivolumab (n = 275) or placebo (n = 275) in addition to CP plus bevacizumab. With a minimum follow-up of 53.1 months, nivolumab with CP plus bevacizumab continued to show improvement in OS (hazard ratio [HR], 0.71; 95% confidence interval [CI], 0.58-0.88) and PFS (HR: 0.61; 95% CI: 0.50-0.74) compared to placebo with CP plus bevacizumab. The 4-year OS rate was 34.7% in the nivolumab arm versus 22.1% in the placebo arm, and the 4-year PFS rate was 13.7% in the nivolumab arm versus 3.3% in the placebo arm. Among 4-year survivors, the median DOR was numerically longer in the nivolumab arm than in the placebo arm (34.7 vs. 13.5 months). No new safety signals were observed. Four-year survival in the nivolumab arm was associated with the absence of bone metastases and age < 65, but not with PD-L1 status and tumor size. In conclusion, treatment with nivolumab demonstrated long-term survival benefit and durable response, which supports nivolumab with CP plus bevacizumab as a first-line treatment option for advanced nonsquamous NSCLC. Trial Registration: ClinicalTrials.gov identifier: NCT03117049."
    },
    {
      "pmid": "41609978",
      "doi": "10.1007/s11523-025-01196-8",
      "title": "Current and Emerging Treatment Landscape of Common EGFR-Mutated Advanced Non-small Cell Lung Cancer.",
      "journal": "Targeted oncology",
      "pubdate": "2026-01-29T00:00:00+00:00",
      "pubtypes": [
        "Journal Article",
        "Review"
      ],
      "entity": "NSCLC",
      "trial_type": "Review/Meta",
      "study_class": "Review",
      "is_oa": false,
      "oa_url": null,
      "metric_name": "SJR",
      "metric_value": 1.645,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41609978/",
      "url_doi": "https://doi.org/10.1007/s11523-025-01196-8",
      "abstract": "Osimertinib, a third-generation epidermal growth factor receptor (EGFR) tyrosine kinase inhibitor, has been standard of care as monotherapy for EGFR-mutated advanced non-small cell lung cancer since reporting of the FLAURA phase III clinical trial, which demonstrated superiority over first-generation EGFR tyrosine kinase inhibitors. Efforts to improve efficacy have led to combination therapies with chemotherapy or co-inhibition of EGFR and MET, which have become additional standards. Choosing between these strategies requires careful understanding of disease biology and disease burden, and joint decision making with patients. Despite increasing understanding of acquired resistance mechanisms in later-line therapies, advances in the first-line options have made second-line treatment decision making increasingly nuanced. Physicians require an in-depth understanding of the genomics of the disease, and ideally an ability to reassess the tumour genomic/expression profile to guide next-line therapy at each timepoint of progression. Targeting on-target resistance (e.g. C797X mutations) with fourth-generation EGFR tyrosine kinase inhibitors has been disappointing, and in addition to biological challenges, there are regulatory challenges with approaches combining tyrosine kinase inhibitors targeting EGFR and off-target oncogenic resistance kinases. There are multiple broader approaches to improve second"
    },
    {
      "pmid": "41616709",
      "doi": "10.1016/j.compbiomed.2026.111501",
      "title": "Influence of CT harmonization in longitudinal radiomics for NSCLC immunotherapy response prediction.",
      "journal": "Computers in biology and medicine",
      "pubdate": "2026-01-29T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": "SJR",
      "metric_value": 1.447,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41616709/",
      "url_doi": "https://doi.org/10.1016/j.compbiomed.2026.111501",
      "abstract": "This study investigates the variability of radiomic features in longitudinal CT scans from a multi-institutional NSCLC cohort and introduces a harmonization pipeline to improve predictive modeling of immunotherapy response. Baseline and follow-up CT scans from NSCLC patients treated with anti-PD-1/PD-L1 agents were analyzed, with two institutions combined for model training and internal testing, and a third institution serving as an external test set. To address variability from imaging parameters-such as scanner manufacturer, slice thickness, and noise-we applied image harmonization followed by feature harmonization using NestedComBat. This approach substantially reduced feature dependence on acquisition confounders (from 78.8% to 12.8%) and improved feature robustness across institutions. We further assessed the temporal consistency of radiomic features across longitudinal scans using the intraclass correlation coefficient (ICC). Image harmonization yielded the largest gains in stability (mean ΔICC = +0.021, p < 0.001), while the combined approach also enhanced longitudinal reliability (ΔICC = +0.014, p < 0.001). Finally, harmonization improved predictive performance for 6-month immunotherapy response, increasing the AUC from 0.695 to 0.768 in the internal test and from 0.692 to 0.802 in the external test. These results demonstrate that combining image- and feature-level harmonization enhances the robustness and temporal consistency of radiomic features, potentially supporting more reliable and generalizable predictive modeling across diverse datasets and clinical settings."
    },
    {
      "pmid": "41308576",
      "doi": "10.1016/j.ejrad.2025.112561",
      "title": "Potential for AI as first reader in lung cancer screening.",
      "journal": "European journal of radiology",
      "pubdate": "2026-02-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://www.ejradiology.com/article/S0720-048X(25)00647-3/pdf",
      "metric_name": "SJR",
      "metric_value": 1.003,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41308576/",
      "url_doi": "https://doi.org/10.1016/j.ejrad.2025.112561",
      "abstract": "PURPOSE: To retrospectively assess the agreement between human and automated AI-based readings for low-dose computed tomography (LDCT) outcomes according to LungRADS v1.1 in lung cancer screening (LCS); to test the diagnostic performance of both readings.\n\nMETHODS: We included 4104 baseline LDCTs from the BioMILD trial. Original readings were retrospectively classified into \"negative\" (LungRADSv1.1 categories 1, 2) and \"positive\" (categories 3, 4) by a radiologist and analyzed by AI software for category assignment. Diagnosis of lung cancer (LC) at 2 years served as reference standard to assess sensitivity, specificity, negative predictive value (NPV), and positive predictive value (PPV) of both human and AI. Agreement between readers was measured by the k-Cohen Index with Fleiss-Cohen weights (K\n\nRESULTS: Median age of participants was 60 years; 60.8 % were male and 79.2 % current smokers; 68/4104 (1.7 %) were diagnosed with LC; 6/68 (8.8 %) and 7/68 (10.3 %) LDCT were classified as negative by AI and human reading, respectively. The agreement between human and AI readings for negative and positive LDCTs was 83.5 % (K\n\nCONCLUSION: AI reading showed comparable sensitivity but lower specificity than human reading. High NPV of AI may support its use as a first reader in LCS."
    },
    {
      "pmid": "41617462",
      "doi": "10.21873/anticanres.18009",
      "title": "Clinical Activity of MET-TKIs in METex14 Skipping NSCLC With Poor Performance Status.",
      "journal": "Anticancer research",
      "pubdate": "2026-02-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": "SJR",
      "metric_value": 0.545,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41617462/",
      "url_doi": "https://doi.org/10.21873/anticanres.18009",
      "abstract": "BACKGROUND/AIM: The mesenchymal-epithelial transition (MET) receptor plays a key role in cell growth and survival. The MET exon 14 (METex14) skipping mutation occurs in 3% to 4% of patients with non-small cell lung cancer (NSCLC) and leads to prolonged MET signaling and oncogenesis. MET tyrosine kinase inhibitors (TKIs), such as tepotinib and capmatinib, are effective for METex14-altered NSCLC; however, their impact on patients with a poor performance status (PS) is unclear. We retrospectively analyzed clinical outcomes of MET-TKI treatment for NSCLC with the METex14 skipping mutation.\n\nPATIENTS AND METHODS: We reviewed 59 cases of NSCLC with the METex14 skipping mutation diagnosed at the National Cancer Center Hospital between June 2020 and April 2024. Clinical data included demographics, PS, histology, PD-L1 expression, treatment response, progression-free survival (PFS), and overall survival (OS).\n\nRESULTS: Forty-nine patients (median age, 72 years; range=50-87 years; 53.1% male) received MET-TKIs (tepotinib or capmatinib). Thirty-seven patients and 12 patients had PS scores of 0 or 1 and ≥2, respectively. The median PFS and median OS of patients who received MET-TKI treatment were 5.6 months and 18.7 months, respectively. Thirty-seven patients who received first-line MET-TKI treatment had median PFS, median OS, and a median overall response rate (ORR) of 5.6 months, 21.3 months, and 48.6%, respectively. For patients with a PS score ≥2 (n=9), the median PFS, median OS, and median ORR were 0.95 months, 1.3 months, and 11.1%, respectively. A PS score ≥2 was strongly associated with shorter OS. Two of nine (22.2%) patients with a poor PS experienced improvement.\n\nCONCLUSION: MET-TKIs are effective for NSCLC with the METex14 skipping mutation; however, their efficacy for patients with a poor PS is limited."
    },
    {
      "pmid": "41475048",
      "doi": "10.1016/j.ejca.2025.116191",
      "title": "Braf-mutant metastatic non-small-cell lung cancer: Real world data from the Italian biomarker atlas database.",
      "journal": "European journal of cancer (Oxford, England : 1990)",
      "pubdate": "2026-02-05T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://doi.org/10.1016/j.ejca.2025.116191",
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41475048/",
      "url_doi": "https://doi.org/10.1016/j.ejca.2025.116191",
      "abstract": "BACKGROUND: BRAF mutations identify a small subgroup of patients (pts) with non-small cell lung cancer (NSCLC). Dabrafenib/trametinib (D/T) combination is associated with high response rates and durable anti-tumor activity in BRAF-V600-mutants. Several open questions still remain unanswered in clinical practice, including the efficacy of treatments based on clinical and molecular characteristics, the activity in patients with brain metastases, the optimal sequence with immunotherapy-based therapies. Here we present outcomes among advanced BRAF-mutant NSCLC patients from the Italian ATLAS registry.\n\nMETHODS: Patients with metastatic BRAF-mutated NSCLC were included. Clinical-pathological features, treatment effectiveness and safety outcomes were retrospectively collected from the Italian real-world ATLAS registry.\n\nRESULTS: A total of 244 BRAF-mutated NSCLC pts were enrolled, including 70 % V600E mutations. The median PFS of first line D/T was 19.8 months (95 % CI: 10.7-29.0), with a 2-year OS rate of 65.4 % and a PFS2 of 6.6 months (95 % CI: 0-14.3). The activity of D/T differs among sex (mPFS was 13.6 mos and 25.3 mos and 2-yr OS rate were 54.9 % and 72.3 % in males and females, respectively) and smoking status (mPFS was 18.4 mos, 25.6 mos and 24 mos in never, former and current smokers, respectively). Concomitant MET amplification was associated with a shorter median PFS (mPFS was 13.6 mos vs. 44.3 mos with and without MET amplification respectively) in pts treated with D/T as 1st line.\n\nCONCLUSIONS: These data confirm the efficacy and safety of first line D/T in BRAF V600E-mutated pts in the real-world setting consistently with prior studies, suggesting a differential activity among key clinical-molecular subgroups."
    },
    {
      "pmid": "41526205",
      "doi": "10.1016/j.lungcan.2026.108909",
      "title": "Corrigendum to \"Global trends in lung cancer incidence and mortality by age, gender and morphology and forecast: A bootstrap-based analysis\". [Lung Cancer 205 (2025) 108626].",
      "journal": "Lung cancer (Amsterdam, Netherlands)",
      "pubdate": "2026-02-01T00:00:00+00:00",
      "pubtypes": [
        "Published Erratum"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://www.lungcancerjournal.info/article/S0169-5002(26)00004-8/pdf",
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41526205/",
      "url_doi": "https://doi.org/10.1016/j.lungcan.2026.108909",
      "abstract": null
    },
    {
      "pmid": "41520595",
      "doi": "10.1016/j.lungcan.2026.108914",
      "title": "Comparative efficacy and safety of post-TKI treatments for advanced EGFR-mutant non-small-cell lung cancer: a systematic review and network meta-analysis.",
      "journal": "Lung cancer (Amsterdam, Netherlands)",
      "pubdate": "2026-02-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Preclinical",
      "is_oa": true,
      "oa_url": "https://www.lungcancerjournal.info/article/S0169-5002(26)00009-7/pdf",
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41520595/",
      "url_doi": "https://doi.org/10.1016/j.lungcan.2026.108914",
      "abstract": "BACKGROUND: Despite the availability of several validated therapies, the optimal second-line regimen for EGFR-mutant non-small cell lung cancer (NSCLC) after tyrosine kinase inhibitor (TKI) failure remains uncertain.\n\nMETHODS: The protocol was registered in PROSPERO (CRD420251157131). We systematically searched MEDLINE, Embase, CENTRAL, and conference proceedings (to Oct 20, 2025) for phase III randomized controlled trials (RCTs). A Bayesian network meta-analysis was performed. The primary outcome was progression-free survival (PFS). Secondary outcomes included overall survival (OS) and the incidence of grade ≥3 treatment-related adverse events (TRAEs).\n\nRESULTS: Eleven RCTs (3,650 patients, seven regimens) were included. Compared to chemotherapy, sacituzumab tirumotecan (SacTMT), amivantamab plus chemotherapy (Chemo-Ami), and chemo-immunotherapy plus anti-angiogenic agent (Chemo-IO-anti-VEGF) demonstrated superior PFS (HR 0.49, 0.48, 0.53, respectively) and OS (HR 0.60, 0.73, 0.83, respectively). SacTMT also significantly improved OS over chemo-immunotherapy (HR 0.68, 95 % CrI 0.48 to 0.95). Regarding safety, Chemo-Ami carried higher grade ≥3 TRAEs risk (OR 2.83, 95 % CrI 1.01 to 7.90) versus chemotherapy, while SacTMT and Chemo-IO-anti-VEGF demonstrated toxicity comparable to chemotherapy.\n\nCONCLUSIONS: SacTMT, Chemo-Ami, and Chemo-IO-anti-VEGF offer superior efficacy over chemotherapy for EGFR-mutant NSCLC after TKI progression. SacTMT and Chemo-IO-anti-VEGF may have more favorable safety profiles than Chemo-Ami. This comparative evidence helps to inform clinical decision-making."
    },
    {
      "pmid": "41512381",
      "doi": "10.1016/j.lungcan.2026.108908",
      "title": "Survival outcomes of patients with uncommon EGFR mutations in surgically resected lung adenocarcinoma: A multi-institutional real-world database study (CReGYT-01 EGFR study).",
      "journal": "Lung cancer (Amsterdam, Netherlands)",
      "pubdate": "2026-02-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article",
        "Multicenter Study"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41512381/",
      "url_doi": "https://doi.org/10.1016/j.lungcan.2026.108908",
      "abstract": "INTRODUCTION: Uncommon epidermal growth factor receptor (EGFR) mutations (UCM) account for approximately 10% of EGFR-mutant lung adenocarcinoma (LUAD) cases; however, their prognostic impact remains unclear. This study aimed to evaluate postoperative outcomes in patients with UCM compared to those with common mutations (CM) using a large multicenter database.\n\nMATERIALS AND METHODS: This retrospective study included 1,636 patients with EGFR-mutant LUAD who underwent complete resection between 2015 and 2018 at 21 Japanese institutions. Patients were classified into the CM and UCM groups. Recurrence-free survival (RFS), overall survival (OS), lung cancer-specific survival (LCSS), and survival after recurrence (SAR) were analyzed using univariable and multivariable analyses and the inverse probability of treatment weighting (IPTW) method.\n\nRESULTS: Among the patients, 1,441 (88.1%) had CM and 195 (11.9%) had UCM. RFS was comparable between the groups. However, patients with UCM showed significantly shorter OS and LCSS than those with CM (OS: multivariable hazard ratio [HR] 1.538, 95% confidence interval [CI] 1.003-2.359; LCSS: multivariable HR 1.803, 95% CI 1.064-3.056). This trend was consistently validated using IPTW methods. SAR was also significantly shorter in patients with UCM. Subtype-specific analyses revealed that patients with exon 20 insertions (Ex20ins) had a significantly worse prognosis than those with other UCMs.\n\nCONCLUSION: Patients with UCM had significantly worse OS, LCSS, and SAR than those with CM despite similar RFS. These survival disadvantages in UCM were strongly associated with the Ex20ins subtype. These findings highlight the urgent need for novel perioperative treatments for patients with UCM, especially Ex20ins."
    },
    {
      "pmid": "41500085",
      "doi": "10.1016/j.lungcan.2025.108884",
      "title": "External evaluation of the Manchester score in a contemporary SCLC cohort.",
      "journal": "Lung cancer (Amsterdam, Netherlands)",
      "pubdate": "2026-02-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "SCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://doi.org/10.1016/j.lungcan.2025.108884",
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41500085/",
      "url_doi": "https://doi.org/10.1016/j.lungcan.2025.108884",
      "abstract": "OBJECTIVES: The Manchester Score, a prognostic model developed in 1987, was used to stratify patients with Small Cell Lung Cancer (SCLC) by mortality risk, including stage, performance status, and three blood tests as risk factors. Many tools have since been developed for this purpose, but few have seen clinical use, with lack of robust external validation frequently cited as a barrier. In this study we apply a robust and pragmatic external validation approach to the Manchester Score to understand if it remains valid in an unselected modern patient cohort.\n\nMETHODS: SCLC patients treated in an academic centre between 2013 and 2022 (N = 1783) were included in the validation cohort. Discrimination was assessed using Kaplan-Meier curves, AUC, and Harrell's C-index for the Manchester score and its underlying Cox model. Three levels of Cox model updating were used to address missing baseline hazard data: recalibration, recalibration with rescaling, and model refitting. Calibration was then evaluated with optimism adjustment at 6-, 12-, and 24-months post-diagnosis.\n\nRESULTS: The Manchester score shows good discrimination in the modern patient cohort. There is clear separation between risk groups in the Kaplan-Meier curves, with AUC = 0.75 and C-index = 0.68 for the Manchester Score and (AUC = 0.79, C-index = 0.70) for the underlying Cox model. Median survival in the 'good' prognostic group (meeting < 2/5 risk criteria) has increased compared to that from 1987. All model updating methods reported good calibration, with recalibration alone providing the best observed-to-expected ratio at 6 months (1.012 [0.978,1.045]).\n\nCONCLUSION: The original Manchester Score prognostic groups remain discriminative of survival, and when updated can predict survival probability at multiple timepoints."
    },
    {
      "pmid": "41500084",
      "doi": "10.1016/j.lungcan.2025.108858",
      "title": "Real-world incidence, prevalence, and clinical impact of brain metastases in patients with ALK-positive metastatic non-small cell lung cancer treated with first-line ALK tyrosine kinase inhibitors.",
      "journal": "Lung cancer (Amsterdam, Netherlands)",
      "pubdate": "2026-02-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41500084/",
      "url_doi": "https://doi.org/10.1016/j.lungcan.2025.108858",
      "abstract": "INTRODUCTION: This real-world study evaluated the incidence and clinical impact of brain metastases in patients with anaplastic lymphoma kinase-positive (ALK + ) metastatic non-small cell lung cancer (mNSCLC) receiving first-line (1L) treatment with second- or first-generation ALK tyrosine kinase inhibitors (TKIs).\n\nMETHODS: A retrospective analysis of patients with ALK + mNSCLC receiving 1L ALK TKI was conducted using Flatiron data. Baseline and incident brain metastases were assessed, and their impact on mortality was quantified using time-varying Cox proportional hazards models.\n\nRESULTS: Among 475 patients, 80 % received second-generation (n = 382) and 20 % received first-generation (n = 93) ALK TKIs. Baseline brain metastases were present among 32 % patients in second-generation cohort and 29 % in first-generation cohort. Among patients without baseline brain metastases, 5-year cumulative incidence of brain metastases during the follow-up period was 21 % in second-generation cohort and 25 % in first-generation cohort. In the second-generation cohort, patients who developed incident brain metastasis had a statistically significant 3-fold-higher risk of death (hazard ratio [HR], 2.97 [95 % confidence interval [CI], 1.59-5.53]) compared to those who did not develop incident brain metastases. In the first-generation cohort, the risk of death was numerically higher for patients with incident brain metastasis compared to those without (HR, 1.42 [0.58-3.51]), although this was not statistically significant, likely limited by the small sample size. Baseline brain metastases, compared with no baseline brain metastases, were not associated with a significantly increased risk of death, after adjusting for incident brain metastasis and other covariates.\n\nCONCLUSIONS: Brain metastases remains a clinically important concern in patients with ALK + mNSCLC treated with 1L ALK TKIs. Incident brain metastases were strongly associated with increased mortality, highlighting the need for CNS-penetrant 1L therapies with durable intracranial efficacy."
    },
    {
      "pmid": "41500083",
      "doi": "10.1016/j.lungcan.2025.108891",
      "title": "Clinical impact of TP53 classifications in previously treated advanced driver-negative non-small cell lung cancer: A biomarker analysis of the OAK and POPLAR randomized clinical trials.",
      "journal": "Lung cancer (Amsterdam, Netherlands)",
      "pubdate": "2026-02-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article",
        "Randomized Controlled Trial"
      ],
      "entity": "NSCLC",
      "trial_type": "RCT",
      "study_class": "Prospective",
      "is_oa": true,
      "oa_url": "https://www.lungcancerjournal.info/article/S0169-5002(25)00783-4/pdf",
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41500083/",
      "url_doi": "https://doi.org/10.1016/j.lungcan.2025.108891",
      "abstract": "BACKGROUND: In NSCLC, TP53 mutations are heterogeneous with varied effects on protein synthesis, function and clinical outcomes. We hypothesize that a refined classification of TP53 mutations, beyond binary categorization, could improve prognostication. Furthermore, specific mutations could be associated with enhanced benefit from immune checkpoint inhibitors (ICI) versus chemotherapy. To investigate this, we analyzed data from randomized trials (OAK and POPLAR) which compared atezolizumab to chemotherapy in previously treated advanced driver-negative NSCLC.\n\nMETHODS: Participants were classified as TP53 mutant or wild-type using baseline plasma, and by coding mutation, and Olivier's and Poeta's classification. We performed multivariable Cox regression analyses to evaluate the prognostic significance of TP53 mutations, and interaction tests to assess their predictive value.\n\nRESULTS: Among 762 participants, 49% harbored a TP53 mutation. TP53 mutations based on binary categorization were associated with poorer but not statistically significant OS compared to wild-type (adjusted-HR 1.15; 95 %CI 0.96-1.38; P = .12). However, nonsense mutations classified by coding mutations (adjusted-HR 1.71; 95% CI 1.22-2.39;P = .002), non-missense mutations classified by Olivier's classification (adjusted-HR 1.33; 95% CI 1.03-1.74; P = .03) and disruptive mutations classified by Poeta's classification (adjusted-HR 1.33; 95% CI 1.37-1.77; P = .03) were associated with statistically significant poorer OS. TP53 status did not predict differential benefit from ICI versus chemotherapy (interaction P = .45).\n\nCONCLUSION: In advanced driver-negative NSCLC following progression on first-line chemotherapy, nonsense, non-missense and disruptive mutations of TP53 were strongly associated with inferior OS. These data support utilizing a nuanced classification of TP53 mutations as a stratification factor in future trials, and laboratory reporting to aid prognostication."
    },
    {
      "pmid": "41478211",
      "doi": "10.1016/j.lungcan.2025.108886",
      "title": "Is sublobar resection a valid option for radiologically pure-solid clinical stage IA non-small cell lung cancer?: insights from real-world data and current status.",
      "journal": "Lung cancer (Amsterdam, Netherlands)",
      "pubdate": "2026-02-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41478211/",
      "url_doi": "https://doi.org/10.1016/j.lungcan.2025.108886",
      "abstract": "OBJECTIVES: We aimed to evaluate the oncologic outcomes of sublobar resection (SLR) compared with lobectomy in patients with radiologically pure-solid stage IA non-small cell lung cancer (NSCLC).\n\nMETHODS: We retrospectively reviewed 363 patients with clinical stage IA pure-solid NSCLC who underwent curative-intent resection between 2018 and 2020. Patients were divided into SLR (n = 60) and lobectomy (n = 303) groups. Kaplan-Meier analysis was used to estimate overall survival (OS) and recurrence-free survival (RFS), and Cox regression identified prognostic factors. Subgroup analyses were performed for stage IA2 and IA3 patients.\n\nRESULTS: In the overall cohort, the SLR group had significantly worse 5-year OS (75.5 % vs. 93.3 %, p < 0.01) and RFS (58.3 % vs. 77.4 %, p < 0.01) compared with lobectomy. In stage IA2, OS was comparable (87.2 % vs. 91.7 %, p = 0.1), but RFS was inferior after SLR (65.9 % vs. 81.2 %, p = 0.02). In stage IA3, both OS (54.3 % vs. 94.4 %, p < 0.01) and RFS (40.6 % vs. 74.9 %, p < 0.01) were markedly worse after SLR. Segmentectomy showed outcomes similar to lobectomy in IA2 but was inferior in IA3, whereas wedge resection was consistently associated with poor survival.\n\nCONCLUSIONS: Lobectomy remains the standard surgical procedure for pure-solid stage IA NSCLC, particularly IA3 disease. Segmentectomy may be considered in carefully selected IA2 patients, while it is advisable to avoid wedge resection. These findings emphasize the importance of selecting the most appropriate patients for SLR and support the need for prospective validation."
    },
    {
      "pmid": "41475039",
      "doi": "10.1016/j.lungcan.2025.108892",
      "title": "The role of APOBEC in early-stage epidermal growth factor receptor-mutant non-small cell lung cancer.",
      "journal": "Lung cancer (Amsterdam, Netherlands)",
      "pubdate": "2026-02-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://doi.org/10.1016/j.lungcan.2025.108892",
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41475039/",
      "url_doi": "https://doi.org/10.1016/j.lungcan.2025.108892",
      "abstract": "BACKGROUND: APOBEC plays a crucial role in the mutation process and immune response of non-small cell lung cancer (NSCLC). This study evaluated the role of the APOBEC mutation signature in early-stage epidermal growth factor receptor (EGFR) mutant NSCLC. This study aimed to assess the impact of APOBEC enrichment on recurrence-free survival (RFS), post-recurrence tyrosine kinase inhibitor (TKI) progression-free survival (PFS), and post-recurrence survival (PRS).\n\nMETHODS: We conducted whole-exome sequencing and whole-transcriptome sequencing in 100 patients diagnosed with pathologic stage II-IIIA non-squamous NSCLC.\n\nRESULTS: Among the 100 patients, 18 (18 %) exhibited APOBEC (≥2) enrichment, which did not show a significant association with RFS (P = 0.14). Patients with APOBEC enrichment showed a shorter post-recurrence TKI PFS compared to those without APOBEC enrichment (8.13 months vs. 24.57 months, P = 0.017). In multivariate analysis, poor post-recurrence TKI PFS was associated with the type of EGFR mutation (L858R vs. exon 19 deletion, HR = 1.91, P = 0.04), TP53 mutation (HR = 2.07, P = 0.03), and APOBEC enrichment (≥2 vs. < 2, HR = 2.23, P = 0.02). PRS was 61.10 months and 21.77 months for patients with APOBEC enrichment and patients without APOBEC enrichment, respectively (P = 0.029). In multivariate analysis, poor PRS of EGFR-TKI was associated with the type of EGFR mutation (L858R vs. exon 19 deletion, HR = 2.29, P = 0.04) and APOBEC enrichment (≥2 vs. < 2, HR = 2.71, P = 0.02).\n\nCONCLUSIONS: APOBEC enrichment may present at initial diagnosis of early-stage EGFR mutant NSCLC and is associated with poor post-recurrence TKI PFS and PRS rather than RFS."
    },
    {
      "pmid": "41475038",
      "doi": "10.1016/j.lungcan.2025.108889",
      "title": "Effect of treatment sequencing on outcome of patients with non-small cell lung cancer with a synchronous solitary extrathoracic metastasis.",
      "journal": "Lung cancer (Amsterdam, Netherlands)",
      "pubdate": "2026-02-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Preclinical",
      "is_oa": true,
      "oa_url": "https://doi.org/10.1016/j.lungcan.2025.108889",
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41475038/",
      "url_doi": "https://doi.org/10.1016/j.lungcan.2025.108889",
      "abstract": "Currently, guidelines advise local radical treatment (LRT) to all disease sites in addition to systemic therapy in patients with synchronous oligometastatic non-small cell lung cancer (NSCLC). However, the best order of treatments is unknown. This advice is largely based on expert opinion and on studies without immune checkpoint inhibitors (ICI), while an ICI-based regimen is now standard of care first-line treatment for stage IV NSCLC without an actionable genetic alteration (AGA). We conducted a retrospective study to evaluate the order of treatments in patients with synchronous oligometastatic NSCLC without an AGA, with a single extrathoracic metastasis treated with an ICI-based regimen between 2018 and 2022. We evaluated upfront LRT to the metastasis followed by ICI and if indicated LRT to the local disease (Netherlands Cancer Registry: cohort 1, n = 225), and ICI followed by LRT to all disease sites if no progression (regional retrospective series: cohort 2, n = 33). The primary endpoint was overall survival (OS). The median OS for cohort 1 and cohort 2 were 26 and 25 months, respectively, and 3-year OS rates of 45 % and 44 %, respectively. In cohort 1, better survival was seen for those with brain metastasis, good performance status, non-squamous histology and high PD-L1 expression. In cohort 2, better survival was seen for younger age and non-squamous histology. In conclusion, both upfront and delayed LRT combined with an ICI-based treatment can result in long-term survival in this patient population, however the most optimal sequence has yet to determined."
    },
    {
      "pmid": "41468825",
      "doi": "10.1016/j.lungcan.2025.108890",
      "title": "Inavolisib for PIK3CA-mutant non-small cell lung cancer: A case report.",
      "journal": "Lung cancer (Amsterdam, Netherlands)",
      "pubdate": "2026-02-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41468825/",
      "url_doi": "https://doi.org/10.1016/j.lungcan.2025.108890",
      "abstract": "INTRODUCTION: PIK3CA mutations are oncogenic drivers in 2-4% of non-small cell lung cancers (NSCLC), often co-occurring with other drivers and conferring therapeutic resistance. This report is unique in describing the efficacy of the novel, highly selective PI3Kα inhibitor inavolisib in two heavily pre-treated patients with PIK3CA-mutant NSCLC harboring divergent co-drivers (EGFR and KRAS).\n\nCASE PRESENTATION: We present a 71-year-old male with EGFR/PIK3CA-mutant adenocarcinoma and brain metastases, and a 54-year-old female with KRAS/PIK3CA-mutant squamous cell carcinoma. Both patients reported rapid symptomatic improvement (hoarseness and shoulder pain, respectively) within two weeks of initiating inavolisib.\n\nDIAGNOSIS, INTERVENTION, AND OUTCOMES: Both patients received oral inavolisib (6 mg daily). Follow-up imaging after one month revealed significant tumor reduction. Notably, regressing intrapulmonary lesions exhibited tumor cavitation, and the male patient demonstrated a marked regression of central nervous system (CNS) metastases. The treatment was well-tolerated, with only Grade 1 oral mucositis reported.\n\nCONCLUSION: The primary take-away lesson is that selective PI3Kα inhibition with inavolisib can induce potent systemic and intracranial responses in PIK3CA-mutant NSCLC, regardless of the primary oncogenic co-driver. The observed tumor cavitation suggests a potential anti-angiogenic mechanism, warranting further investigation."
    },
    {
      "pmid": "41203001",
      "doi": "10.1016/j.athoracsur.2025.10.016",
      "title": "Clinical Characteristics and Surgical Outcomes of Patients Receiving Perioperative Pembrolizumab in KEYNOTE-671.",
      "journal": "The Annals of thoracic surgery",
      "pubdate": "2026-02-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article",
        "Randomized Controlled Trial",
        "Multicenter Study"
      ],
      "entity": "Other",
      "trial_type": "RCT",
      "study_class": "Prospective",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41203001/",
      "url_doi": "https://doi.org/10.1016/j.athoracsur.2025.10.016",
      "abstract": "BACKGROUND: The phase 3 KEYNOTE-671 study (NCT03425643) demonstrated significantly improved event-free survival (EFS) and overall survival with neoadjuvant pembrolizumab plus chemotherapy followed by surgery and adjuvant pembrolizumab vs neoadjuvant chemotherapy and surgery for early-stage non-small cell lung cancer (NSCLC). We describe participant characteristics, surgical outcomes, and EFS in surgically relevant subgroups.\n\nMETHODS: Participants with untreated, resectable, stage II-IIIB (N2) NSCLC were randomized 1:1 to neoadjuvant pembrolizumab 200 mg or placebo plus cisplatin-based chemotherapy every 3 weeks for 4 cycles, then surgery and adjuvant pembrolizumab or placebo for 13 cycles. Surgery was performed ≤20 weeks after first neoadjuvant dose (if 4 cycles of neoadjuvant therapy) or 4-8 weeks after last neoadjuvant dose (1-3 cycles); surgery beyond this was considered surgical delay. Adjuvant therapy began 4-12 weeks after surgery. EFS was assessed in the surgical population.\n\nRESULTS: Of 397 participants randomized to pembrolizumab and 400 to placebo, 325 (82.1%) and 317 (79.4%), respectively, underwent surgery. At data cutoff (July 10, 2023), 4.9% (pembrolizumab) and 7.6% (placebo) of participants experienced surgical delay; 38.9% and 28.4%, respectively, experienced nodal downstaging; 78.8% and 75.1% underwent lobectomy; and 92.0% and 84.2% had R0 resections. Pembrolizumab improved EFS irrespective of disease stage, nodal status, and type of surgery vs chemotherapy. Eight participants (pembrolizumab, n = 6; placebo, n = 2) died ≤30 days after surgery from surgery-related adverse events.\n\nCONCLUSIONS: Neoadjuvant pembrolizumab did not adversely affect surgical outcomes, was associated with numerically higher R0 resections, and improved EFS vs neoadjuvant chemotherapy in surgically relevant subgroups in early-stage NSCLC."
    },
    {
      "pmid": "41621752",
      "doi": "10.1016/j.jtho.2026.103564",
      "title": "Patient-Reported Outcomes with Consolidation Durvalumab Versus Placebo Following Concurrent Chemoradiotherapy in Limited-Stage Small-Cell Lung Cancer: Results from the Phase 3 ADRIATIC Trial.",
      "journal": "Journal of thoracic oncology : official publication of the International Association for the Study of Lung Cancer",
      "pubdate": "2026-01-30T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41621752/",
      "url_doi": "https://doi.org/10.1016/j.jtho.2026.103564",
      "abstract": "INTRODUCTION: In the first interim analysis of the phase 3 ADRIATIC trial, consolidation durvalumab significantly improved overall survival and progression-free survival (primary endpoints) versus placebo in patients with limited-stage small-cell lung cancer (LS-SCLC) without disease progression after concurrent chemoradiotherapy (cCRT). We report the patient-reported outcomes.\n\nMETHODS: Patients received durvalumab, durvalumab-tremelimumab, or placebo every 4 weeks for up to 24 months. Patient-reported global health status/quality of life (GHS/QoL), functioning, and symptoms, assessed using the European Organisation for Research and Treatment of Cancer QoL Questionnaire-Core 30/Questionnaire-Lung Cancer 13 (secondary endpoints), are reported for durvalumab and placebo only; the durvalumab-tremelimumab arm remained blinded at this analysis. Change from baseline (for prespecified key scales), time to deterioration (TTD), and improvement rates (all scales) were examined. A score change of ≥10 from baseline was considered a clinically meaningful deterioration/improvement. Analyses were not alpha-controlled.\n\nRESULTS: In both arms (durvalumab, n=264; placebo, n=266), mean score changes in prespecified key scales from baseline up to 24 months were small and not clinically meaningful. There were no between-arm differences in TTD except for arm/shoulder pain (longer with durvalumab versus placebo [median TTD: 25.7 versus 9.1 months; HR: 0.70 (95% CI: 0.51-0.94)]) and similar improvement rates between arms for most scales; a higher improvement rate for chest pain was observed with durvalumab versus placebo (odds ratio: 2.28 [95% CI: 1.08-4.95]).\n\nCONCLUSIONS: Consolidation durvalumab following cCRT did not compromise patients' GHS/QoL, functioning, or symptoms versus placebo, further supporting this treatment regimen as the new standard of care for LS-SCLC."
    },
    {
      "pmid": "41619904",
      "doi": "10.1016/j.jtho.2026.103565",
      "title": "Impact of KRAS Mutations and Co-Alterations on Outcomes in Stage III Non-Squamous Non-Small Cell Lung Cancer Treated with Chemoradiation and Immunotherapy.",
      "journal": "Journal of thoracic oncology : official publication of the International Association for the Study of Lung Cancer",
      "pubdate": "2026-01-29T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Preclinical",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41619904/",
      "url_doi": "https://doi.org/10.1016/j.jtho.2026.103565",
      "abstract": "BACKGROUND: Outcomes in unresected locally advanced non-small cell lung cancer (LA-NSCLC) are poor despite improvement with immunotherapy following concurrent chemoradiation (cCRT). Although KRAS is the most common mutated oncogene in NSCLC, its impact on outcomes in LA-NSCLC treated with cCRT and durvalumab remains underexplored.\n\nMETHODS: We conducted a multicenter retrospective analysis of patients with stage III non-squamous non-small cell lung cancer (non-sq NSCLC) treated with definitive cCRT followed by durvalumab. Progression-free survival (PFS) and incidence of distant metastasis and locoregional recurrence were compared by KRAS status. Of patients who underwent next generation sequencing (NGS), we assessed the impact of co-alterations on PFS.\n\nRESULTS: Among 208 consecutive patients, 117 were KRAS wild type (WT) and 91 were KRAS mutant. Median PFS was shorter for KRAS mutant disease compared to KRAS WT (16 vs. 28 months, p = 0.024). KRAS mutations were associated with worse PFS on univariable and multivariable analyses. There was an increased incidence of distant metastasis for KRAS mutant compared to KRAS WT disease (2-year 44% vs. 34%, p = 0.042), including increased brain metastasis incidence (p = 0.007). Among KRAS-mutant tumors, co-alterations with CDKN2A and/or STK11 were associated with worse PFS compared to KRAS WT, whereas KRAS mutations without CDKN2A or STK11 co-alterations were not.\n\nCONCLUSIONS: KRAS mutant non-sq LA-NSCLC is associated with inferior outcomes, largely driven by increased distant and brain metastases. Tumors with concurrent CDKN2A and/or STK11 alterations had the poorest outcomes. These findings support the evaluation of KRAS inhibitors in this high-risk stage III population."
    },
    {
      "pmid": "41617618",
      "doi": "10.1016/j.lungcan.2026.108942",
      "title": "Corrigendum to \"Radiotherapy outcomes in patients with interstitial lung disease and interstitial lung abnormalities: Adverse events and survival from a UK tertiary centre\" [Lung Cancer 211 (2026) 108873.",
      "journal": "Lung cancer (Amsterdam, Netherlands)",
      "pubdate": "2026-01-29T00:00:00+00:00",
      "pubtypes": [
        "Published Erratum"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://doi.org/10.1016/j.lungcan.2026.108942",
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41617618/",
      "url_doi": "https://doi.org/10.1016/j.lungcan.2026.108942",
      "abstract": null
    }
  ]
}