{
  "generated": "2026-01-08T05:23:23.081392Z",
  "items": [
    {
      "pmid": "41491099",
      "doi": "10.1038/s41591-025-04060-4",
      "title": "AI-enabled virtual spatial proteomics from histopathology for interpretable biomarker discovery in lung cancer.",
      "journal": "Nature medicine",
      "pubdate": "2026-01-05T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://doi.org/10.1038/s41591-025-04060-4",
      "metric_name": "SJR",
      "metric_value": 18.333,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41491099/",
      "url_doi": "https://doi.org/10.1038/s41591-025-04060-4",
      "abstract": "Spatial proteomics enables high-resolution mapping of protein expression and can transform our understanding of biology and disease. However, major challenges remain for clinical translation, including cost, complexity and scalability. Here we present H&E to protein expression (HEX), an AI model designed to computationally generate spatial proteomics profiles from standard histopathology slides. Trained and validated on 819,000 histopathology image tiles with matched protein expression from 382 tumor samples, HEX accurately predicts the expression of 40 biomarkers encompassing immune, structural and functional programs. HEX demonstrates substantial performance gains over alternative methods for protein expression prediction from H&E images. We develop a multimodal data integration approach that combines the original H&E image and AI-derived virtual spatial proteomics to enhance outcome prediction. Applied to six independent non-small-cell lung cancer cohorts totaling 2,298 patients, HEX-enabled multimodal integration improved prognostic accuracy by 22% and immunotherapy response prediction by 24-39% compared with conventional clinicopathological and molecular biomarkers. Biological interpretation revealed spatially organized tumor-immune niches predictive of therapeutic response, including the co-localization of T helper cells and cytotoxic T cells in responders, and immunosuppressive tumor-associated macrophage and neutrophil aggregates in non-responders. HEX provides a low-cost and scalable approach to study spatial biology and enables the discovery and clinical translation of interpretable biomarkers for precision medicine."
    },
    {
      "pmid": "41482562",
      "doi": "10.1038/s41591-025-04042-6",
      "title": "Generative AI-based low-dose digital subtraction angiography for intra-operative radiation dose reduction: a randomized controlled trial.",
      "journal": "Nature medicine",
      "pubdate": "2026-01-02T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Other",
      "trial_type": null,
      "study_class": "Preclinical",
      "is_oa": false,
      "oa_url": null,
      "metric_name": "SJR",
      "metric_value": 18.333,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41482562/",
      "url_doi": "https://doi.org/10.1038/s41591-025-04042-6",
      "abstract": "Digital subtraction angiography (DSA) devices guide procedures across numerous diseases, performed on more than 100,000 patients daily worldwide. However, these procedures expose patients and healthcare providers to radiation, increasing the risk of health issues. Despite many low-dose DSA imaging methods proposed, none have been prospectively clinically validated. In this study, 46,829 patients (over 5 million DSA images) from 70 centers were used to iterate our previously developed generative artificial intelligence system (named GenDSA-V2). A total of 1,068 patients (533 in intervention arm and 535 in control arm), with suspected cerebral aneurysms (n = 435), lung cancer (n = 417) or advanced liver cancer (n = 216), meeting surgical criteria, were enrolled to validate the GenDSA-V2. The primary outcome was radiation dose, while secondary outcomes included efficiency, operation time and intraoperative complications. Group assignments were blinded to patients, surgeons and investigators, while technicians were aware but not involved in data collection or analysis. The GenDSA-V2 group showed substantially reduced radiation exposure, with an air kerma (AK) of 151.3 ± 125.1 mGy compared to 457.4 ± 407.4 mGy in the standard clinical protocols (SCP) group (mean difference = -306.1 mGy, 95% confidence interval (CI) = -342.3 to -269.9, P < 0.001 for superiority) and a dose-area product (DAP) of 4009.7 ± 2767.9 μGy m"
    },
    {
      "pmid": "41491679",
      "doi": "10.1186/s12885-025-15509-7",
      "title": "Patient preference for first-line treatments of ALK-positive metastatic non-small cell lung cancer: a discrete choice experiment.",
      "journal": "BMC cancer",
      "pubdate": "2026-01-05T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://doi.org/10.1186/s12885-025-15509-7",
      "metric_name": "SJR",
      "metric_value": 1.178,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41491679/",
      "url_doi": "https://doi.org/10.1186/s12885-025-15509-7",
      "abstract": null
    },
    {
      "pmid": "41192526",
      "doi": "10.1016/j.cellsig.2025.112211",
      "title": "RIPK2/STAT3 signaling axis drives lung cancer metastasis through SNAIL activation: Molecular mechanisms and clinical implications.",
      "journal": "Cellular signalling",
      "pubdate": "2026-02-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41192526/",
      "url_doi": "https://doi.org/10.1016/j.cellsig.2025.112211",
      "abstract": "BACKGROUND: Lung adenocarcinoma is the most common histological subtype of lung cancer with high metastatic propensity. Epithelial-mesenchymal transition (EMT) plays a crucial role in tumor metastasis, but the molecular mechanisms remain incompletely elucidated. This study investigates the role of RIPK2 in EMT and metastasis of lung adenocarcinoma.\n\nMETHODS: TCGA database analysis determined RIPK2 expression and clinical significance. RNA interference, overexpression, qRT-PCR, Western blot, co-immunoprecipitation, and immunofluorescence were employed in A549 and PC-9 cell lines. Transwell, EdU, colony formation assays, and cytoskeletal staining assessed cell invasion, proliferation, and EMT changes. Nuclear localization signal (NLS) and nuclear export signal (NES) fusion proteins investigated subcellular localization effects. Tail vein injection in nude mice validated in vivo effects.\n\nRESULTS: RIPK2 was highly expressed in lung adenocarcinoma tissues and associated with poor prognosis. RIPK2 knockdown inhibited while overexpression promoted EMT, invasion, and metastasis. Co-immunoprecipitation and immunofluorescence confirmed direct RIPK2-STAT3 interaction. RIPK2 specifically upregulated EMT transcription factor SNAIL expression. Co-expression of RIPK2 and SNAIL correlated with shorter patient survival. STAT3 or SNAIL knockdown inhibited RIPK2-induced EMT and metastasis. Nuclear-localized RIPK2 completely restored cellular EMT, invasion, and metastatic capabilities while enhancing cisplatin resistance.\n\nCONCLUSION: RIPK2 translocates to the nucleus, interacts with STAT3, and synergistically upregulates SNAIL expression, promoting EMT, invasion, metastasis, and chemotherapy resistance in lung adenocarcinoma. The RIPK2-STAT3-SNAIL signaling axis represents a potential therapeutic target."
    },
    {
      "pmid": "41389771",
      "doi": "10.1016/j.ejca.2025.116165",
      "title": "Long-term outcomes of preoperative nivolumab with or without relatlimab in patients with resectable non-small-cell lung cancer (NEOpredict-Lung).",
      "journal": "European journal of cancer (Oxford, England : 1990)",
      "pubdate": "2026-01-17T00:00:00+00:00",
      "pubtypes": [
        "Journal Article",
        "Randomized Controlled Trial"
      ],
      "entity": "Thoracic-other",
      "trial_type": "RCT",
      "study_class": "Prospective",
      "is_oa": true,
      "oa_url": "https://www.ejcancer.com/article/S0959-8049(25)01051-2/pdf",
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41389771/",
      "url_doi": "https://doi.org/10.1016/j.ejca.2025.116165",
      "abstract": "BACKGROUND: Preoperative immunotherapy targeting PD-1/-L1 with chemotherapy induces histopathological responses and improves survival in patients with resectable non-small cell lung cancer (NSCLC). NEOpredict-Lung (NCT04205552) established the feasibility of dual blockade of PD-1 and LAG-3 immune checkpoints prior to curatively intended resection. Here we report extended follow-up, postoperative treatments and patterns of response and recurrence.\n\nPATIENTS AND METHODS: Patients with resectable NSCLC (stages IB-IIIA) were randomized to receive two doses nivolumab (240 mg, arm A) with or without relatlimab (80 mg, arm B) every 2 weeks. Overall and disease-free survival (OS, DFS) rates, response and recurrence patterns and subsequent therapies were evaluated.\n\nRESULTS: 60 patients were enrolled from March 2020 to July 2022. The present analysis was conducted per December 2024 with a median follow-up of 37.4 months. 45 patients were alive without disease recurrence,15 patients recurred (4 locoregional and 11 metastatic), and 7 patients died. The 3-year OS and DFS rates were 88.4 % and 73.3 % in arm A and 88.9 % and 60.3 % in arm B. Patients achieving major pathological response (≤10 % viable tumor cells in resected NSCLC) trended towards better DFS (HR 0.35; 95 % CI, 0.1-1.19). Downstaging was confirmed in 53.3 % of patients in arm A and in 66.7 % of patients in arm B. Nodal downstaging occurred in 28.6 % of patients with nodal disease in arm A and in 66.7 % of patients in arm B.\n\nCONCLUSIONS: Short course preoperative nivolumab with or without relatlimab showed encouraging efficacy and survival outcomes, which compare favorably with chemo-immunotherapy-based perioperative treatment regimens."
    },
    {
      "pmid": "41421886",
      "doi": "10.1016/j.ejca.2025.116069",
      "title": "Bridging the gap in lung cancer: A comprehensive global strategy for change.",
      "journal": "European journal of cancer (Oxford, England : 1990)",
      "pubdate": "2026-01-17T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Preclinical",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41421886/",
      "url_doi": "https://doi.org/10.1016/j.ejca.2025.116069",
      "abstract": "BACKGROUND: Unless greater awareness inspires action, lung cancer will become the next global public health emergency. Despite improvements in screening, diagnosis, and treatments, more must be done because global incidence continues to increase. Concerted action must address the burden both between and within countries. Inequalities result from the uneven distribution of resources while inequities result from differences in prevention, screening, diagnosis, and treatment.\n\nMETHOD: Participants in the 9th International Lung Cancer Network conference (Athens, June 2023) received an advanced draft of the declaration with a confidentiality notice by email upon completion of online registration. They were invited to provide comments and suggestions up to seven days before the meeting. All contributions were reviewed by the authors and incorporated into the final version circulated the day before the meeting began. Although not a formal Delphi-style process, this approach prioritized inclusivity, transparency, and broad endorsement. Outreach extended beyond onsite attendees, ensuring diverse perspectives and representation. This process complements methodological consensus approaches by uniting stakeholders around shared policy goals.\n\nRESULTS: At the 9th International Lung Cancer Network conference, participants were invited to sign the final declaration, and 785 did so. Since then, 20 organizations worldwide have formally endorsed the Consensus Statement, and support continues to grow. The inclusive design has fostered broad and sustained backing, underscoring the value of the Statement as a unifying policy declaration advancing shared principles.\n\nCONCLUSION: The Consensus Statement, Bridging the Gap in the Diagnosis and Management of Lung Cancer, reinforces five unifying principles: improve and expand prevention; focus on early detection; ensure equitable and sustainable access to treatment; build partnerships and promote investment; and, combat stigma, recognizing it as a social determinant of public health."
    },
    {
      "pmid": "41499719",
      "doi": "10.1200/JCO-25-03012",
      "title": "Erratum: Simultaneous Durvalumab and Platinum-Based Chemoradiotherapy in Unresectable Stage III Non-Small Cell Lung Cancer: The Phase III PACIFIC-2 Study.",
      "journal": "Journal of clinical oncology : official journal of the American Society of Clinical Oncology",
      "pubdate": "2026-01-07T00:00:00+00:00",
      "pubtypes": [
        "Journal Article",
        "Published Erratum"
      ],
      "entity": "NSCLC",
      "trial_type": "Phase III",
      "study_class": "Prospective",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41499719/",
      "url_doi": "https://doi.org/10.1200/JCO-25-03012",
      "abstract": null
    },
    {
      "pmid": "41494984",
      "doi": "10.1093/ejcts/ezag008",
      "title": "Financial burden of postoperative adverse events following lobectomy: Cost analysis from 10 high volume Canadian hospitals.",
      "journal": "European journal of cardio-thoracic surgery : official journal of the European Association for Cardio-thoracic Surgery",
      "pubdate": "2026-01-06T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Other",
      "trial_type": null,
      "study_class": "Preclinical",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41494984/",
      "url_doi": "https://doi.org/10.1093/ejcts/ezag008",
      "abstract": "OBJECTIVES: Lobectomy remains a cornerstone of curative intent treatment for lung cancer; however, postoperative adverse events remain common, harmful and costly. To support value-based quality improvement programs, we sought to estimate the in-hospital costs of adverse events following lobectomy and identify which complications are the primary cost drivers.\n\nMETHODS: Lobectomy data from 10 Canadian hospitals were included (2017-2022). Annual lobectomy volume, demographics, length of stay, incidence and severity of adverse events were obtained from a prospectively collected national database. Using literature-derived index hospitalization costs of adverse events, supported by Canadian Institution of Health Information database, estimates of annual AE costs were obtained (2025 CDN$).\n\nRESULTS: Mean annual lobectomy volume 1150 (SD = 165): 44% male, aged 67 years (SD = 10.9), median length of stay of 4 days (IQR = 4), with minimally invasive surgery performed in 86%. Prolonged Air Leak contributed 51% of total adverse events occurrences, followed by atrial arrhythmia (13%), pneumonia (7.9%), reoperation (5.2%), atelectasis (3.9%), delirium (3.4%), transfusion (2.8%), respiratory failure (2.8%), empyema (2.2%), acute kidney injury (1.7%), and pulmonary embolism (1.2%), adding over $7.31 million (M) to hospital-level costs. Prolonged Air Leak, mean annual incidence of 17%, was the strongest driver of costs. Extrapolated nationally, lobectomy-related adverse events are estimated to contribute over $48 million in excess annual costs.\n\nCONCLUSIONS: Postoperative adverse events following lobectomy impose substantial financial burdens, with Prolonged Air Leak alone accounting for more than half of total costs. These findings underscore the need for value-based quality improvement initiatives targeting high-impact adverse events, requiring coordinated action among surgeons, hospital leadership, and policymakers."
    },
    {
      "pmid": "41484568",
      "doi": "10.1007/s12094-025-04152-0",
      "title": "Real-world adoption of off-label combinations for targeted therapy resistance in non-small cell lung cancer.",
      "journal": "Clinical & translational oncology : official publication of the Federation of Spanish Oncology Societies and of the National Cancer Institute of Mexico",
      "pubdate": "2026-01-03T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41484568/",
      "url_doi": "https://doi.org/10.1007/s12094-025-04152-0",
      "abstract": "PURPOSE: No targeted therapy combinations have achieved regulatory approval for the treatment of biomarker-positive resistance in non-small cell lung cancer (NSCLC). Given the widespread availability of next-generation sequencing (NGS) to detect resistance, we reviewed the real-world experience of using off-label targeted therapy combinations to treat advanced NSCLC at our academic safety-net hospital.\n\nMETHODS: Pharmacy records from the Hematology/Oncology Department at Boston Medical Center during the years 2017 to 2024 were reviewed. One hundred eleven patients received oral, targeted therapy during this time. Our study focused on those patients who received an off-label combination of targeted therapies for advanced NSCLC. We reviewed their demographics, treatment history, molecular data, and published evidence to support the combination.\n\nRESULTS: Eight patients were treated with nine combination regimens. The median age was 69 years (age 29-89 years). Six patients had EGFR exon 19 deletions and two had EML4-ALK fusions. The nine combination regimens included addition of a MET inhibitor (n = 3), a RET inhibitor (n = 2), a MEK inhibitor (n = 2), an ALK inhibitor (n = 1), and an EGFR antibody (n = 1). The median duration of treatment was 7 months (range: 1-35 months), and was longest for alectinib and capmatinib (15 months ongoing and 25 months, ongoing) and gefitinib and selpercatinib (35 months, ongoing). Available supporting evidence included retrospective cohort studies (n = 5), published case reports/series (n = 2), and a prospective cohort study (n = 1).\n\nCONCLUSION: Off-label combination therapy to treat targeted therapy resistance in advanced NSCLC is feasible in routine clinical practice. Additional real-world evidence is needed to clarify best practices with this emerging approach."
    },
    {
      "pmid": "41487977",
      "doi": "10.1002/ccr3.71811",
      "title": "Case Report of Acute Central Airway Obstruction Induced by Anti-PD-1 Sintilimab: Clinical Presentation and Review.",
      "journal": "Clinical case reports",
      "pubdate": "2026-01-02T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://onlinelibrary.wiley.com/doi/pdfdirect/10.1002/ccr3.71811",
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41487977/",
      "url_doi": "https://doi.org/10.1002/ccr3.71811",
      "abstract": "Immune checkpoint inhibitors (ICIs), such as sintilimab, have revolutionized non-small cell lung cancer (NSCLC) treatment but can trigger immune-related adverse events (irAEs). While pneumonitis is well documented, central airway obstruction (CAO) due to immune-mediated necrosis is an extremely rare and life-threatening phenotype that poses significant diagnostic challenges. A patient with recurrent squamous cell carcinoma of the lung achieved partial remission after two cycles of sintilimab combined with chemotherapy. However, 48 h after the third cycle, the patient developed acute, severe dyspnea and hypoxemia. Emergency bronchoscopy revealed extensive necrotic material occluding the right main bronchus and carina. Pathological analysis indicated lymphocytic infiltration with necrosis, while microbiological tests were negative for pathogens. Given the temporal relationship, exclusion of alternative etiologies, and response to corticosteroids, the event was considered"
    }
  ]
}