{
  "generated": "2025-10-01T05:17:21.732011Z",
  "items": [
    {
      "pmid": "40996757",
      "doi": "10.1001/jamaoncol.2025.3320",
      "title": "Understanding Lung Cancer in Younger People.",
      "journal": "JAMA oncology",
      "pubdate": "2025-09-25T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": "SJR",
      "metric_value": 8.377,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40996757/",
      "url_doi": "https://doi.org/10.1001/jamaoncol.2025.3320",
      "abstract": null
    },
    {
      "pmid": "41022528",
      "doi": "10.1136/jitc-2025-012423",
      "title": "Transformer-based AI approach to unravel long-term, time-dependent prognostic complexity in patients with advanced NSCLC and PD-L1 ≥50%: insights from the pembrolizumab 5-year global registry.",
      "journal": "Journal for immunotherapy of cancer",
      "pubdate": "2025-09-29T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://jitc.bmj.com/content/13/9/e012423.full.pdf",
      "metric_name": "SJR",
      "metric_value": 4.22,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41022528/",
      "url_doi": "https://doi.org/10.1136/jitc-2025-012423",
      "abstract": "BACKGROUND: With nearly one-third of patients with advanced non-small cell lung cancer (NSCLC) and PD-L1 Tumor Proportion Score≥50% surviving beyond 5 years following first-line pembrolizumab, long-term outcomes challenge traditional paradigms of cancer prognostication. The emergence of non-cancer-related factors and time-dependent trends underscores the need for advanced analytical frameworks to unravel their complex interplay.\n\nMETHODS: We analyzed the Pembro-real 5Y registry, a global real-world dataset of 1050 patients treated across 61 institutions in 14 countries with a long-term follow-up and a large panel of baseline variables. Two complementary approaches were employed: ridge regression, chosen for its ability to address multicollinearity while retaining interpretability, and not another imputation method (NAIM), a transformer-based artificial intelligence model designed to handle missing data without imputation. Endpoints included risk of death at 6, 12, 24, 60 months and 5-year survival.\n\nRESULTS: The ridge regression model achieved a c-statistic of 0.66 (95% CI: 0.59 to 0.72) for the risk of death and an area under the curve (AUC) of 0.72 (95% CI: 0.65 to 0.78) for 5-year survival, identifying Eastern Cooperative Oncology Group Performance Status (ECOG-PS)≥2, increasing age, and metastatic burden as primary risk factors. However, wide CIs for some predictors highlighted statistical instability. NAIM demonstrated robust handling of missing data, with a c-index of 62.98±2.11 for risk of death and an AUC of 60.52±3.71 for 5-year survival. The comprehensive SHapley Additive exPlanations analysis revealed dynamic, time-dependent patterns, with early mortality dominated by acute factors (eg, ECOG-PS, steroids) and long-term outcomes increasingly influenced by systemic health markers (eg, absence of hypertension, increasing body mass index). Unexpected insights included the protective role of dyslipidemia (but not statins) and the nuanced impact of smoking status, reflecting evolving disease dynamics and host-tumor interplay.\n\nCONCLUSIONS: Our integrative framework illuminates the complexity of long-term outcomes in patients with NSCLC treated with pembrolizumab, uncovering dynamic, non-linear prognostication trends. This analysis provides insights into patient trajectories, emphasizing the need for holistic, long-term management strategies."
    },
    {
      "pmid": "41027069",
      "doi": "10.1016/j.esmoop.2025.105811",
      "title": "Venous thromboembolic event risk with PARP inhibitors in solid tumors: a systematic review and meta-analysis.",
      "journal": "ESMO open",
      "pubdate": "2025-09-29T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": "SJR",
      "metric_value": 3.582,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41027069/",
      "url_doi": "https://doi.org/10.1016/j.esmoop.2025.105811",
      "abstract": "BACKGROUND: Poly (ADP-ribose) polymerase inhibitors (PARPi) are linked to thrombotic events, but the thrombosis risk in various cancers is unclear. This study evaluates the incidence and risk of venous thromboembolic events (VTEs) in patients with solid tumors treated with PARPi.\n\nMATERIALS AND METHODS: This meta-analysis included randomized controlled phase II and III clinical trials in which patients with prostate, breast, ovarian, pancreatic, glioblastoma, small-cell lung (SCLC), and non-small-cell lung (NSCLC) cancers were treated with PARPi as monotherapy or in combination. The primary endpoint was to assess the frequency and risk of VTEs in patients treated with PARPi, while the secondary endpoint compared the incidence across different cancer subtypes.\n\nRESULTS: The analysis included 15 008 patients from 38 studies: 8805 in the PARPi group and 6203 in the control group. There were 11 ovarian cancer (n = 4348), 8 prostate cancer (n = 3872), 9 breast cancer (n = 4448), 4 NSCLC (n = 1063), and 3 SCLC (n = 583) studies, and 1 study each for pancreatic cancer (n = 50), glioblastoma (n = 123), and gastric (n = 521) cancer. The incidence of any-grade VTEs with PARPi was observed to be 2.4%, compared with 1.6% in controls, suggesting a possible increase in risk [odds ratio (OR) 1.37, 95% confidence interval (CI) 1.00-1.88, P = 0.050]. This association appeared to be more pronounced in patients with prostate cancer (OR 1.98, 95% CI 1.06-3.70, P = 0.030) and pancreatic cancer (OR 7.22, 95% CI 1.40-37.25, P = 0.020).\n\nCONCLUSIONS: While our findings indicate a possible association between PARPi and VTE risk in certain cancer types, this risk appears to be influenced by factors such as cancer subtype and treatment combinations. The overall contribution of PARPi monotherapy to VTE risk may be limited, and the results should be interpreted with caution due to study heterogeneity, wide CIs, and the absence of patient-level data."
    },
    {
      "pmid": "40721523",
      "doi": "10.1038/s41416-025-03126-x",
      "title": "Enhanced HER2 internalization by clathrin-dependent endocytosis in non-small cell lung cancer positive for HER2 mutations.",
      "journal": "British journal of cancer",
      "pubdate": "2025-10-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": "SJR",
      "metric_value": 3.144,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40721523/",
      "url_doi": "https://doi.org/10.1038/s41416-025-03126-x",
      "abstract": "BACKGROUND: HER2-targeted antibody-drug conjugates (ADCs) have shown marked efficacy for HER2 mutation-positive non-small cell lung cancer (NSCLC). The intracellular trafficking of mutant HER2 has remained to be fully elucidated, however.\n\nMETHODS: HER2 dynamics were examined in cells expressing wild-type (WT) or mutant HER2 with the use of live cell imaging and an in situ proximity ligation assay. Proteins related to mutant HER2 trafficking were identified by liquid chromatography and tandem mass spectrometry.\n\nRESULTS: HER2 internalization was enhanced in NSCLC cells expressing mutant HER2 compared with those expressing HER2(WT). Homodimers of HER2(WT) were localized mainly at the cell surface, whereas those of mutant HER2 were present mostly in the cytoplasm. Knockdown of EGFR or HER3 suppressed internalization of HER2(WT) but not that of mutant HER2. The enhanced internalization of mutant HER2 was mediated by clathrin-dependent endocytosis, as was reflected by increased binding of the ubiquitin ligase c-Cbl to mutant HER2 and its consequent ubiquitination, and was attenuated by treatment with zongertinib, a HER2-specific tyrosine kinase inhibitor.\n\nCONCLUSIONS: Upregulation of HER2 phosphorylation promotes internalization of mutant HER2 mediated by clathrin-dependent endocytosis, likely contributing to the efficacy of HER2-targeted ADCs in NSCLC positive for HER2 mutations."
    },
    {
      "pmid": "40670667",
      "doi": "10.1038/s41416-025-03088-0",
      "title": "Single-cell spatial analysis with Xenium reveals anti-tumour responses of CXCL13 + T and CXCL9+ cells after radiotherapy combined with anti-PD-L1 therapy.",
      "journal": "British journal of cancer",
      "pubdate": "2025-10-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://www.nature.com/articles/s41416-025-03088-0.pdf",
      "metric_name": "SJR",
      "metric_value": 3.144,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40670667/",
      "url_doi": "https://doi.org/10.1038/s41416-025-03088-0",
      "abstract": "BACKGROUND: The standard treatment for unresectable non-small cell lung cancer (NSCLC) is anti-PD-L1 therapy combined with chemoradiotherapy (anti-PD-L1-CRT). Although some patients achieve complete cancer eradication and cure, more than half of patients retain persistent cancer cells. Our research aimed to unravel the nuanced mechanisms involved in both immune attack and evasion induced by anti-PD-L1-CRT with single cell spatial transcriptome.\n\nMETHODS: Xenium is a cutting-edge single-cell spatial analysis tool that enables pathology-based and single-cell analyses while preserving spatial information. In our study, we used Xenium to identify the tumour microenvironment (TME), immune dynamics, and residual cancer cells at the single-cell level following treatment with anti-PD-L1-CRT.\n\nRESULTS: Posttreatment alterations included a significant increase in CXCL9+ cells and CXCL13 + T cells, particularly around tumour cells. Additionally, we discovered that CXCL13 + T cells directly impact cancer cells in the posttreatment environment. Moreover, we identified clusters of immune-cold cancer cells posttreatment, revealing their activation of DNA repair pathways and high proliferative capacity. The novel spatial analysis tool Xenium enabled identification of the immune environment at the single-cell level following treatment with anti-PD-L1-CRT, elucidating its characteristics.\n\nCONCLUSIONS: These findings suggest potential advancements in developing new treatments to improve posttreatment immune responses and address resistance challenges."
    },
    {
      "pmid": "40189749",
      "doi": "10.1080/2162402X.2025.2484880",
      "title": "Surrogate markers of intestinal dysfunction associated with survival in advanced cancers.",
      "journal": "Oncoimmunology",
      "pubdate": "2025-12-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://doi.org/10.1080/2162402x.2025.2484880",
      "metric_name": "SJR",
      "metric_value": 2.542,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40189749/",
      "url_doi": "https://doi.org/10.1080/2162402X.2025.2484880",
      "abstract": "Deviations in the diversity and composition of the gut microbiota are called \"gut dysbiosis\". They have been linked to various chronic diseases including cancers and resistance to immunotherapy. Stool shotgun based-metagenomics informs on the ecological composition of the gut microbiota and the prevalence of homeostatic bacteria such as"
    },
    {
      "pmid": "40581545",
      "doi": "10.1016/j.critrevonc.2025.104821",
      "title": "Resistance mechanisms in anaplastic lymphoma kinase-positive lung cancer.",
      "journal": "Critical reviews in oncology/hematology",
      "pubdate": "2025-10-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article",
        "Review"
      ],
      "entity": "Thoracic-other",
      "trial_type": "Review/Meta",
      "study_class": "Review",
      "is_oa": false,
      "oa_url": null,
      "metric_name": "SJR",
      "metric_value": 1.82,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40581545/",
      "url_doi": "https://doi.org/10.1016/j.critrevonc.2025.104821",
      "abstract": "Non-small cell lung cancer has been discovered to have many unique molecular subsets that are associated with different phenotypic behaviors and overall prognoses. In particular, anaplastic lymphoma kinase (ALK)-positive non-small cell lung cancers (NSCLCs) have distinctive presentations and disease courses. Patients with ALK NSCLC are typically younger, have significantly less smoking exposure, and often experience prolonged survival. When patients recur, drug-tolerant persister (DTP) cells may be implicated in disease recurrence. In this review we will discuss the phenomenon of DTP related to ALK NSCLC, possible mechanistic explanations and potential treatment strategies to eliminate DTPs."
    },
    {
      "pmid": "40684711",
      "doi": "10.1016/j.ejrad.2025.112290",
      "title": "Comparison of nodule volumetric classification by using two different nodule segmentation algorithms in an LDCT lung cancer baseline screening dataset.",
      "journal": "European journal of radiology",
      "pubdate": "2025-10-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": "SJR",
      "metric_value": 1.003,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40684711/",
      "url_doi": "https://doi.org/10.1016/j.ejrad.2025.112290",
      "abstract": "OBJECTIVES: To investigate the performance of two segmentation algorithms for nodule volumetric classification at participant/scan level in the NELCIN-B3 cohort (Netherlands and China Big-3), a lung cancer screening program (LCS) using low-dose CT (LDCT).\n\nMETHODS: Baseline scans with qualified LDCT images from consecutive NELCIN-B3 participants were included from June 2017 to July 2018. Performance of two software algorithms were independently evaluated by two radiologists: software A (Syngo.via VB30A) by reader 1 and software B (AVIEW v1.1.39.14) by reader 2. According to the NELSON2.0 protocol, nodules with a solid component ≥ 100 mm\n\nRESULTS: In total, 300 participants were evaluated comprising 159 women (53.0 %) and 193 (64.3 %) never smokers, with a mean ± standard deviation age of 61.2 ± 7.1 years. There were disagreements in 17 cases: in 11 (11/300, 3.7 %), this was due to differences in nodule selection and nodule type classification between readers; and in 6 (6/300, 2.0 %), this was due to variations in nodule volume metrics between algorithms. Inter-software agreement was almost perfect (κ = 0.88 [95 %CI: 0.83-0.93]). In the consensus read, reader 1/software A generated 12 misclassifications (11 PM, 1 NM), giving a negative predictive value of 99.6 % (95 % CI: 98.9 %-100.0 %). Reader 2/software B generated 5 misclassifications (2 PM, 3 NM), giving a negative predictive value of 98.9 % (95 % CI: 97.7 %-100.0 %).\n\nCONCLUSION: Two software algorithms (Syngo.via VB30A and AVIEW v1.1.39.14) showed comparable performance for lung nodule volumetric classification at participant/scan level. Further research is needed to confirm the results in other LDCT LCS programs."
    },
    {
      "pmid": "40168159",
      "doi": "10.1080/17581966.2025.2477411",
      "title": "The association between blood-based HYAL2 methylation and early-stage lung cancer: a case-control study.",
      "journal": "Lung cancer management",
      "pubdate": "2025-12-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://doi.org/10.1080/17581966.2025.2477411",
      "metric_name": "SJR",
      "metric_value": 0.506,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40168159/",
      "url_doi": "https://doi.org/10.1080/17581966.2025.2477411",
      "abstract": "BACKGROUND: Blood-based DNA methylation biomarkers have great potential for the early detection of lung cancer (LC). Here, we investigated the association between\n\nMETHODS: Matrix-assisted laser desorption ionization time-of-flight (MALDI-TOF) mass spectrometry was performed to measure the methylation levels of 4 CpG sites in\n\nRESULTS: Hypomethylation of all 4 CpG sites in\n\nCONCLUSIONS: Our results suggested blood-based"
    },
    {
      "pmid": "41026583",
      "doi": "10.1158/1078-0432.CCR-25-0089",
      "title": "D3-GPC2-directed CAR T cells are safe and efficacious in preclinical models of neuroblastoma and small cell lung cancer.",
      "journal": "Clinical cancer research : an official journal of the American Association for Cancer Research",
      "pubdate": "2025-09-30T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "SCLC",
      "trial_type": null,
      "study_class": "Preclinical",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41026583/",
      "url_doi": "https://doi.org/10.1158/1078-0432.CCR-25-0089",
      "abstract": "BACKGROUND: We previously identified glypican 2 (GPC2) as a cell surface MYCN-regulated neuroblastoma oncoprotein and developed a D3-GPC2 antibody that specifically binds a conformational, tumor-specific epitope conserved between mouse and human.\n\nEXPERIMENTAL DESIGN: Here we sought to further validate GPC2 as an immunotherapeutic target and develop Investigational New Drug application-enabling data to support the clinical translation of D3-GPC2 chimeric antigen receptor (CAR) T cells.\n\nRESULTS: Immunohistochemistry validated that GPC2 is widely expressed on human neuroblastomas and flow cytometry showed high levels of cell surface GPC2 on neuroblastoma cellular models. Second-generation D3-GPC2 CAR T cells with either a 4-1BB or CD28 co-stimulatory domain were selectively activated and induced potent neuroblastoma cell cytotoxicity in several complementary in vitro co-incubation assays. Conversely, no measurable cytotoxicity or D3-GPC2 CAR T cell activation was observed in co-incubation studies with nine primary human normal tissue cell lines. Moreover, GPC2 CAR T cells induced significant regression of GPC2-expressing neuroblastoma xenografts. No GPC2 CAR-related toxicities were noted, including in comprehensive mouse necropsies performed after GPC2 CAR T cell administration. Finally, to explore the potential broader clinical impact of GPC2 CAR T cells we showed that they are also potently cytotoxic to preclinical models of GPC2-expressing small cell lung cancers.\n\nCONCLUSIONS: These data validate GPC2 as a bona fide CAR T cell target in neuroblastoma and other cancers. The safety and preliminary efficacy of GPC2 CAR T cells are being tested in a first-in-human phase 1 clinical trial for children with relapsed/refractory neuroblastoma (NCT05650749)."
    },
    {
      "pmid": "41027867",
      "doi": "10.1038/s41467-025-63696-5",
      "title": "Tumor immune dynamics and long-term clinical outcome of stage IIIA NSCLC patients treated with neoadjuvant chemoimmunotherapy.",
      "journal": "Nature communications",
      "pubdate": "2025-09-30T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://doi.org/10.1038/s41467-025-63696-5",
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41027867/",
      "url_doi": "https://doi.org/10.1038/s41467-025-63696-5",
      "abstract": "Neoadjuvant chemoimmunotherapy offers promise to improve outcomes for patients with resectable non-small cell lung cancer (NSCLC). Yet not all patients derive treatment benefits, and reliable biomarkers of response are still lacking. We here assess the long-term clinical outcome of neoadjuvant chemotherapy and perioperative anti-PD-L1 inhibition in resectable stage IIIA NSCLC in the SAKK 16/14 trial and provide a comprehensive characterization of anti-tumor immune responses for biomarker-based treatment personalization. We report secondary outcomes of median event-free survival (EFS) of 4.0 years and median overall survival not being reached after a median follow-up of 5.4 years. Computer-aided spatial image analysis emphasizes the importance of CD8"
    },
    {
      "pmid": "41004707",
      "doi": "10.1200/JCO-25-01817",
      "title": "Bridging the Gap: The Evolving Landscape of CNS Management in Small Cell Lung Cancer: Prophylactic Cranial Irradiation in the Modern Era.",
      "journal": "Journal of clinical oncology : official journal of the American Society of Clinical Oncology",
      "pubdate": "2025-09-26T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "SCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41004707/",
      "url_doi": "https://doi.org/10.1200/JCO-25-01817",
      "abstract": null
    },
    {
      "pmid": "41006257",
      "doi": "10.1038/s41467-025-63461-8",
      "title": "AI cancer driver mutation predictions are valid in real-world data.",
      "journal": "Nature communications",
      "pubdate": "2025-09-26T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://www.nature.com/articles/s41467-025-63461-8.pdf",
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41006257/",
      "url_doi": "https://doi.org/10.1038/s41467-025-63461-8",
      "abstract": "Characterizing and validating which mutations influence development of cancer is challenging. Artificial intelligence (AI) has delivered significant advances in protein structure prediction, but its utility for identifying cancer drivers is less explored. We evaluate multiple computational methods for identifying cancer driver mutations. For re-identifying known drivers, methods incorporating protein structure or functional genomic data outperform methods trained only on evolutionary data. We validate variants of unknown significance (VUSs) annotated as pathogenic by testing their association with overall survival in two cohorts of patients with non-small cell lung cancer (N = 7965 and 977). VUSs identified as pathogenic drivers by AI in KEAP1 and SMARCA4 are associated with worse survival, unlike \"benign\" VUSs. \"Pathogenic\" VUSs also exhibit mutual exclusivity with known oncogenic alterations at the pathway level, further suggesting biological validity. AI predictions thus contribute to a more comprehensive understanding of tumor genetics as validated by real-world data."
    },
    {
      "pmid": "40995949",
      "doi": "10.1080/14796694.2025.2560225",
      "title": "RELAY: safety and efficacy of ramucirumab plus erlotinib in elderly Japanese patients with metastatic EGFR-mutated NSCLC.",
      "journal": "Future oncology (London, England)",
      "pubdate": "2025-09-25T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40995949/",
      "url_doi": "https://doi.org/10.1080/14796694.2025.2560225",
      "abstract": "AIM: The global phase III RELAY trial demonstrated the efficacy of ramucirumab (RAM) plus erlotinib (ERL) in patients with untreated metastatic epidermal growth factor receptor (\n\nMETHODS: Patients were randomized (1:1) to RAM (10 mg/kg) or placebo (PL) intravenously every 2 weeks plus 150 mg/day ERL orally. Primary endpoint was progression-free survival (reported elsewhere). This report describes response rates, study drug exposure, dose adjustments, safety, and post-study treatment discontinuation therapies in Japanese elderly patients (RAM+ERL, n = 12; PL+ERL, n = 17).\n\nRESULTS: Overall response rate was similar in RAM+ERL (83.3%) and PL+ERL (82.4%) arms. Median treatment duration of RAM and ERL was 6.0 and 15.4 months, respectively. Most patients had RAM and/or ERL dose adjustments. Adverse events, including grade ≥ 3 events, were similar in both treatment arms, although proteinuria occurred exclusively in the RAM+ERL arm (six patients; no grade ≥ 3 events). All patients received subsequent therapy after first-line study treatment; various subsequent therapies were used.\n\nCONCLUSION: These results suggest that RAM+ERL may be a suitable first-line treatment option for elderly patients with\n\nCLINICAL TRIAL REGISTRATION: www.clinicaltrials.gov identifier is NCT02411448."
    }
  ]
}