{
  "generated": "2025-10-16T05:16:44.307677Z",
  "items": [
    {
      "pmid": "41090369",
      "doi": "10.1158/2159-8290.CD-25-0605",
      "title": "Sevabertinib, a Reversible HER2 Inhibitor with Activity in Lung Cancer.",
      "journal": "Cancer discovery",
      "pubdate": "2025-10-15T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": "SJR",
      "metric_value": 7.283,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41090369/",
      "url_doi": "https://doi.org/10.1158/2159-8290.CD-25-0605",
      "abstract": "Exon 20 insertions of HER2, encoded by ERBB2, and other activating HER2 mutations occur in 2-4% of lung adenocarcinomas, but there are only limited therapeutic options available for these patients. Sevabertinib (BAY 2927088) is a potent and reversible dual EGFR-HER2 inhibitor that is selective with respect to wild-type EGFR. Here, we report the preclinical activity of sevabertinib in lung cancer models harboring alterations of HER2, including exon 20 insertions, point mutations, and amplification of wild-type ERBB2. We furthermore demonstrate the activity of sevabertinib in a cancer cell line dependent on a fusion of NRG1, a ligand for the HER2 family member and heterodimerization partner, HER3. Finally, we report patient responses to sevabertinib from a Phase 1/2 clinical trial, indicating potential benefit for patients with HER2-mutant lung cancer."
    },
    {
      "pmid": "41088878",
      "doi": "10.1158/0008-5472.CAN-25-4003",
      "title": "Precision Epigenetic Reprogramming: CoREST Inhibition Sensitizes STK11-Mutant Tumors to Immune Checkpoint Blockade Therapy.",
      "journal": "Cancer research",
      "pubdate": "2025-10-15T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": "SJR",
      "metric_value": 3.879,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41088878/",
      "url_doi": "https://doi.org/10.1158/0008-5472.CAN-25-4003",
      "abstract": "Loss-of-function mutations in STK11 (also known as LKB1) define a molecular subtype of non-small cell lung cancer that is resistant to immune checkpoint blockade therapy, partially owing to impaired T-cell infiltration and suppressed antigen presentation. Emerging evidence implicates epigenetic deregulation as a key driver of immune evasion in STK11-mutant tumors. In this issue of Cancer Research, Ahronian and colleagues identified the CoREST complex, via histone deacetylase 1, as a vulnerability that can be targeted pharmacologically to restore immune sensitivity in STK11-mutant tumors. The authors developed TNG260, a selective small-molecule CoREST inhibitor with favorable pharmacologic properties and reduced toxicity relative to pan-histone deacetylase inhibitors. In preclinical models of STK11-deficient non-small cell lung cancer, TNG260 reprograms the tumor epigenome to upregulate immune genes and synergizes with anti-PD-1 therapy to induce durable tumor regressions. Early clinical data from an ongoing trial (NCT05887492) show increased histone acetylation and CD8+ T-cell infiltration in patient tumors treated with TNG260 and pembrolizumab. This commentary places these findings in the broader context of epigenetic modulation of antitumor immune response. We also outline key questions for future investigation, including durability of immune response, tumor-type specificity, and biomarker strategies for patient selection and response monitoring. See related article by Ahronian et al., p. 3966."
    },
    {
      "pmid": "41088890",
      "doi": "10.1158/1078-0432.CCR-25-3281",
      "title": "Editor's Note: Identification of Existing Drugs That Effectively Target NTRK1 and ROS1 Rearrangements in Lung Cancer.",
      "journal": "Clinical cancer research : an official journal of the American Association for Cancer Research",
      "pubdate": "2025-10-15T00:00:00+00:00",
      "pubtypes": [
        "Published Erratum"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41088890/",
      "url_doi": "https://doi.org/10.1158/1078-0432.CCR-25-3281",
      "abstract": null
    },
    {
      "pmid": "41086386",
      "doi": "10.1200/JCO-25-02142",
      "title": "Ifinatamab Deruxtecan in Patients With Extensive-Stage Small-Cell Lung Cancer: Primary Analysis of the Phase 2 IDeate-Lung01 Trial.",
      "journal": "Journal of clinical oncology : official journal of the American Society of Clinical Oncology",
      "pubdate": "2025-10-14T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://doi.org/10.1200/jco-25-02142",
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41086386/",
      "url_doi": "https://doi.org/10.1200/JCO-25-02142",
      "abstract": "PURPOSE: Treatment options for patients with recurrent or progressive extensive-stage small-cell lung cancer (ES-SCLC) are limited. This phase 2 trial evaluated the efficacy and safety of ifinatamab deruxtecan (I-DXd), a B7 homolog 3-directed antibody-drug conjugate, in patients with previously treated ES-SCLC.\n\nMETHODS: Patients were randomized to receive I-DXd 8 or 12 mg/kg intravenously every 3 weeks (Q3W) in part 1 (dose optimization) and received I-DXd 12 mg/kg in part 2 (extension). The primary endpoint was objective response rate by blinded independent central review per Response Evaluation Criteria in Solid Tumours, version 1.1.\n\nRESULTS: Overall, 183 patients received I-DXd: 88 in part 1 (8 mg/kg, n=46; 12 mg/kg, n=42) and 95 in part 2. The median number of prior lines of treatment was two. In the total 12-mg/kg group from parts 1 and 2 (n=137), the confirmed objective response rate was 48.2% (95% confidence interval [CI], 39.6-56.9), median duration of response was 5.3 (95% CI, 4.0-6.5) months, median time to response was 1.4 (range, 1.0-8.1) months, median progression-free survival was 4.9 (95% CI, 4.2-5.5) months, and the 9-month overall survival estimate was 59.1%. Any-grade treatment-related adverse events (TRAEs) occurred in 89.8% of patients (grade ≥3, 36.5%). The most common TRAEs were nausea (43.1%), anemia (34.3%), and neutropenia (34.3%). TRAEs associated with treatment discontinuation and death were reported in 9.5% and 4.4% of patients, respectively. Treatment-related interstitial lung disease (ILD) as determined by the ILD adjudication committee was reported in 12.4% of patients (grade ≥3, 4.4%).\n\nCONCLUSION: I-DXd 12 mg/kg Q3W showed promising efficacy in patients with previously treated ES-SCLC. The observed safety profile was consistent with previous reports, with no new safety signals identified."
    },
    {
      "pmid": "41082707",
      "doi": "10.1200/JCO-25-00036",
      "title": "Simultaneous Durvalumab and Platinum-Based Chemoradiotherapy in Unresectable Stage III Non-Small Cell Lung Cancer: The Phase III PACIFIC-2 Study.",
      "journal": "Journal of clinical oncology : official journal of the American Society of Clinical Oncology",
      "pubdate": "2025-10-13T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": "Phase III",
      "study_class": "Prospective",
      "is_oa": true,
      "oa_url": "https://doi.org/10.1200/jco-25-00036",
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41082707/",
      "url_doi": "https://doi.org/10.1200/JCO-25-00036",
      "abstract": "PURPOSE: Immunotherapy targeting PD-L1 improves outcomes in patients with unresectable stage III non-small cell lung cancer (NSCLC) and no progression after definitive, concurrent chemoradiotherapy (cCRT). Earlier administration of immunotherapy, simultaneously with cCRT, may improve outcomes further.\n\nMETHODS: Eligible patients were randomly assigned (2:1) to receive either durvalumab or placebo administered from the start of cCRT. Patients without progression after completing cCRT received consolidation durvalumab or placebo (per initial random assignment) until progression. The primary end point was progression-free survival (PFS) by blinded independent central review. Key secondary end points included objective response rate (ORR), overall survival (OS), the proportion of patients alive at 24 months (OS24), and safety.\n\nRESULTS: In total, 328 patients were randomly assigned to receive durvalumab (n = 219) or placebo (n = 109). There was no statistically significant difference with durvalumab versus placebo in PFS (hazard ratio [HR], 0.85 [95% CI, 0.65 to 1.12];\n\nCONCLUSION: Among patients with unresectable stage III NSCLC, durvalumab administered from the start of cCRT failed to demonstrate additional benefit compared with cCRT plus placebo. Consolidation durvalumab following definitive cCRT remains the standard of care in this setting."
    },
    {
      "pmid": "41082894",
      "doi": "10.1016/S1470-2045(25)00485-1",
      "title": "Radiotherapy-free approach in inoperable locally advanced non-small-cell lung cancer: are we ready for this shift?",
      "journal": "The Lancet. Oncology",
      "pubdate": "2025-10-10T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41082894/",
      "url_doi": "https://doi.org/10.1016/S1470-2045(25)00485-1",
      "abstract": null
    },
    {
      "pmid": "41082893",
      "doi": "10.1016/S1470-2045(25)00462-0",
      "title": "Radiotherapy-free pembrolizumab combined with chemotherapy for locally advanced non-small-cell lung cancer with PD-L1 tumour proportion score of 50% or higher (Evolution trial): a multicentre, single-arm, phase 2 study.",
      "journal": "The Lancet. Oncology",
      "pubdate": "2025-10-10T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41082893/",
      "url_doi": "https://doi.org/10.1016/S1470-2045(25)00462-0",
      "abstract": "BACKGROUND: The standard of care for unresectable, locally advanced non-small-cell lung cancer (NSCLC) is chemoradiotherapy followed by durvalumab. This study (Evolution trial WJOG11819L) aimed to evaluate the efficacy and safety of radiotherapy-free pembrolizumab and chemotherapy in patients with unresectable, locally advanced NSCLC with a PD-L1 tumour proportion score (TPS) of 50% or higher.\n\nMETHODS: This prospective, multicentre, single-arm, phase 2 study was conducted in nine institutes in Japan. Inclusion criteria were age 20 years or older, histologically confirmed unresectable, locally advanced NSCLC with a PD-L1 TPS of 50% or higher, an Eastern Cooperative Oncology Group performance status of 0 or 1, at least one measurable lesion, no previous systemic therapy, and adequate organ function. Patients received intravenous induction therapy comprising pembrolizumab 200 mg every 3 weeks plus platinum-based chemotherapy for four cycles: either cisplatin 75 mg/m\n\nFINDINGS: Between May 18, 2020, and Feb 22, 2022, 21 patients were assessed for eligibility and all were enrolled. Median age was 73 years (IQR 68-80); 16 (76%) patients were male; race and ethnicity data were not collected. Three (14%) patients discontinued and 18 (86%) patients completed the induction therapy; eight (38%) patients discontinued during maintenance therapy and ten (48%) patients completed the maintenance therapy. Median follow-up was 32·5 months (IQR 26·2-39·5). The 2-year progression-free survival rate was 67% (90% CI 46-83). The most common grade 3 or worse adverse events were neutropenia (eight [38%] of 21 patients), leukopenia (four [19%]), and pneumonia (three [14%]). Serious adverse events occurred in seven (33%) patients. No treatment-related deaths were reported.\n\nINTERPRETATION: These findings suggest that pembrolizumab combined with platinum-based chemotherapy, without radiotherapy, might provide a feasible and promising alternative treatment strategy for patients with unresectable, locally advanced NSCLC with a PD-L1 TPS of 50% or higher.\n\nFUNDING: Merck Sharp & Dohme."
    },
    {
      "pmid": "40923280",
      "doi": "10.1200/JCO-25-00788",
      "title": "Phase II Dose-Randomized Study of Sunvozertinib in Platinum-Pretreated Non-Small Cell Lung Cancer With Epidermal Growth Factor Receptor Exon 20 Insertion Mutations (WU-KONG1B).",
      "journal": "Journal of clinical oncology : official journal of the American Society of Clinical Oncology",
      "pubdate": "2025-10-10T00:00:00+00:00",
      "pubtypes": [
        "Journal Article",
        "Randomized Controlled Trial",
        "Multicenter Study"
      ],
      "entity": "NSCLC",
      "trial_type": "RCT",
      "study_class": "Prospective",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40923280/",
      "url_doi": "https://doi.org/10.1200/JCO-25-00788",
      "abstract": "PURPOSE: WU-KONG1B (ClinicalTrials.gov identifier: NCT03974022) is a multinational phase II, dose-randomized study to assess the antitumor efficacy of sunvozertinib in pretreated patients with advanced non-small cell lung cancer (NSCLC) with epidermal growth factor receptor (\n\nMETHODS: Eligible patients with advanced-stage\n\nRESULTS: Among 85, 89, and 107 efficacy-evaluable patients in 200 mg-rand, 300 mg-rand, and 300 mg-all (including randomly assigned and nonrandomized patients) cohorts, the cORRs were 45.9% (97.5% CI, 33.6% to 58.5%), 47.2% (97.5% CI, 35.1% to 59.5%), and 45.8% (97.5% CI, 34.8% to 57.0%), respectively, per IRC assessment. The predefined null hypothesis was rejected with statistical significance (\n\nCONCLUSION: Sunvozertinib is efficacious at both 200 and 300 mg once daily in treating platinum-pretreated patients with advanced"
    }
  ]
}