{
  "generated": "2026-01-21T05:26:57.611566Z",
  "items": [
    {
      "pmid": "41538156",
      "doi": "10.1001/jamaoncol.2025.5924",
      "title": "Lymph Node Dissection Guideline Adherence and Survival in Patients With T1N0M0 Lung Adenocarcinoma.",
      "journal": "JAMA oncology",
      "pubdate": "2026-01-15T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC12809417/",
      "metric_name": "SJR",
      "metric_value": 8.377,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41538156/",
      "url_doi": "https://doi.org/10.1001/jamaoncol.2025.5924",
      "abstract": "IMPORTANCE: Lymph node dissection for early-stage lung adenocarcinoma is controversial. Histologic pattern subtyping reveals heterogeneity of lung adenocarcinoma, yet its association with lymph node involvement and dissection is understudied.\n\nOBJECTIVE: To assess the association between guideline-adherent lymph node dissection, histologic pattern subtyping, and overall survival in patients with clinical T1N0M0 lung adenocarcinoma.\n\nDESIGN, SETTING, AND PARTICIPANTS: This multicenter cohort study used data from the National Cancer Center LungReal database, a multicenter, electronic health records-based database for patients undergoing surgery for lung cancer, from January 2014 to December 2021, with the last follow-up in December 2022. Patients were categorized based on histologic pattern of adenocarcinoma into 2 groups: lepidic without high-grade pattern, and high-grade or no lepidic pattern. The data analysis was performed from April to November 2025.\n\nEXPOSURE: Lymph node dissection adherence or nonadherence with the 3 + 1 standard (3 N2 plus 1 N1 station) and the 6-station standard (the subcarinal plus 2 other N2 stations and 3 N1 stations).\n\nMAIN OUTCOME AND MEASURE: Overall survival.\n\nRESULTS: Of 35 265 patients screened, 27 191 participants (mean [SD] age, 58.3 [11.7] years; 16 280 female [59.9%] and 10 911 male [40.1%] individuals) from 19 centers were included; among them, 15 593 (57.3%) received lymph node dissection adherent with the 3 + 1 standard and 4023 (14.8%) with the 6-station standard. Among the group of 13 369 patients (49.2%) with adenocarcinoma of lepidic without high-grade pattern, no association was observed between survival and adherence with the 3 + 1 standard (hazard ratio [HR], 0.81; 95% CI, 0.57-1.15) or the 6-station standard (HR, 0.54; 95% CI, 0.26-1.13). Whereas, among the group of 13 822 patients (50.8%) with adenocarcinoma of high-grade or no lepidic pattern, adherence with the 3 + 1 standard (HR, 0.81; 95% CI, 0.69-0.95; absolute risk difference at 3-year, 1.2%; 95% CI, 0.2%-2.2%; E-value, 1.78) or the 6-station standard (HR, 0.61; 95% CI, 0.45-0.83; absolute risk difference at 3 years, 1.0%; 95% CI, 0.1%-1.9%; E-value, 2.67) was associated with a significant but small absolute survival benefit.\n\nCONCLUSION AND RELEVANCE: In this cohort study, guideline-adherent nodal dissection was associated with small absolute survival benefit for patients with adenocarcinoma of high-grade or no lepidic pattern, but not for those with lepidic without high-grade pattern. These observational findings warrant prospective validation and should not be interpreted as causal."
    },
    {
      "pmid": "41557983",
      "doi": "10.1158/2159-8290.CD-25-1346",
      "title": "Preclinical Characterization and Clinical Activity of RNK08954, a Highly Selective and Orally Bioavailable KRAS G12D Inhibitor.",
      "journal": "Cancer discovery",
      "pubdate": "2026-01-21T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Other",
      "trial_type": null,
      "study_class": "Preclinical",
      "is_oa": false,
      "oa_url": null,
      "metric_name": "SJR",
      "metric_value": 7.283,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41557983/",
      "url_doi": "https://doi.org/10.1158/2159-8290.CD-25-1346",
      "abstract": "KRAS G12D is the most prevalent subtype of KRAS mutation across solid tumors, but no drug is available in the clinic. RNK08954 is a potent and selective KRAS G12D inhibitor that inhibits proliferation of KRAS G12D-mutant cells and demonstrates significant tumor regressions in mouse xenograft models while inhibiting KRAS-mediated signaling. The in vivo effects of RNK08954 are explained by its unique pharmacokinetic (PK) profile and significantly prolonged retention time in tumor tissues. RNK08954 shows synergy with immune check blockade (ICB). In a Phase 1a study, the median follow-up was 4.85 months for 36 evaluable patients. In patients with non-small cell lung cancer (NSCLC), the objective response rate (ORR, unconfirmed) is 58.33%, and in patients with pancreatic ductal adenocarcinoma (PDAC) the ORR (unconfirmed) was 33.33% in the 1000-1200mg cohort. This study supports the clinical potential of RNK08954 in patients with KRAS G12D mutation either as a single agent or in combination."
    },
    {
      "pmid": "41554849",
      "doi": "10.1038/s41698-025-01267-z",
      "title": "Validation of histopathology-based deep learning algorithms for detection of actionable non-small cell lung cancer biomarkers.",
      "journal": "NPJ precision oncology",
      "pubdate": "2026-01-20T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": "SJR",
      "metric_value": 3.37,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41554849/",
      "url_doi": "https://doi.org/10.1038/s41698-025-01267-z",
      "abstract": "Non-small cell lung cancer (NSCLC) patient management relies on molecular analysis to determine eligibility for targeted therapy. Furthermore, neoadjuvant immunotherapy is primarily suitable in the absence of specific genomic alterations. However, significant challenges remain, including suboptimal molecular testing and patients being assigned to non-optimal treatment strategies. Here, we present AI classifiers for the identification of EGFR, ALK, BRAF and MET alterations directly from hematoxylin and eosin (H&E)-stained tissue using CanvOI 1.1, a digital pathology foundation model. Their performance was evaluated on an independent validation dataset of 968 NSCLC samples. The classifiers achieved AUCs of 0.87 for EGFR, 0.96 for ALK, 0.88 for BRAF and 0.83 for MET. Moreover, they demonstrated high accuracy in identifying cases lacking alterations. Our results highlight the potential of deep-learning tools for the detection of NSCLC biomarkers and specifically the identification of tumors without EGFR or ALK driver alterations, supporting more informed clinical decision-making."
    },
    {
      "pmid": "41555860",
      "doi": "10.1177/17588359251414535",
      "title": "Impact of vulnerability on concurrent chemoradiotherapy outcomes in patients with locally advanced non-small cell lung cancer using an integrated clinical trial database.",
      "journal": "Therapeutic advances in medical oncology",
      "pubdate": "2026-01-17T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Preclinical",
      "is_oa": true,
      "oa_url": "https://doi.org/10.1177/17588359251414535",
      "metric_name": "SJR",
      "metric_value": 1.549,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41555860/",
      "url_doi": "https://doi.org/10.1177/17588359251414535",
      "abstract": "BACKGROUND: The effect of vulnerability on the outcomes of patients with locally advanced non-small cell lung cancer (NSCLC) undergoing concurrent chemoradiotherapy (CCRT) remains unclear.\n\nOBJECTIVES: To examine the impact of vulnerability on the outcomes in patients with locally advanced NSCLC undergoing CCRT.\n\nDESIGN: We analyzed data from the Japan Lung Cancer Society Integrated Clinical Trial Database, which included 1288 patients with locally advanced NSCLC treated with CCRT.\n\nMETHODS: Vulnerability was defined as meeting one or more of the following: age ⩾75 years; history of chronic obstructive pulmonary disease (COPD) or emphysema; chronic kidney disease with at least one other comorbidity; or cancer cachexia (C-reactive protein >1.0 mg/dL and albumin <3.5 g/dL).\n\nRESULTS: Among 741 eligible patients, 283 (38.2%) were classified as vulnerable. Vulnerable patients had significantly shorter overall survival (OS; 19.7 vs 27.4 months,\n\nCONCLUSION: Clinical vulnerability was associated with poorer OS after CCRT, mediated by multiple factors, including reduced CDDP use, lower subsequent therapy rates, and cachexia. Individualized strategies that balance treatment intensity, supportive care, and access to post-CCRT are essential for improving outcomes."
    },
    {
      "pmid": "41203001",
      "doi": "10.1016/j.athoracsur.2025.10.016",
      "title": "Clinical Characteristics and Surgical Outcomes of Patients Receiving Perioperative Pembrolizumab in KEYNOTE-671.",
      "journal": "The Annals of thoracic surgery",
      "pubdate": "2026-02-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article",
        "Randomized Controlled Trial",
        "Multicenter Study"
      ],
      "entity": "Other",
      "trial_type": "RCT",
      "study_class": "Prospective",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41203001/",
      "url_doi": "https://doi.org/10.1016/j.athoracsur.2025.10.016",
      "abstract": "BACKGROUND: The phase 3 KEYNOTE-671 study (NCT03425643) demonstrated significantly improved event-free survival (EFS) and overall survival with neoadjuvant pembrolizumab plus chemotherapy followed by surgery and adjuvant pembrolizumab vs neoadjuvant chemotherapy and surgery for early-stage non-small cell lung cancer (NSCLC). We describe participant characteristics, surgical outcomes, and EFS in surgically relevant subgroups.\n\nMETHODS: Participants with untreated, resectable, stage II-IIIB (N2) NSCLC were randomized 1:1 to neoadjuvant pembrolizumab 200 mg or placebo plus cisplatin-based chemotherapy every 3 weeks for 4 cycles, then surgery and adjuvant pembrolizumab or placebo for 13 cycles. Surgery was performed ≤20 weeks after first neoadjuvant dose (if 4 cycles of neoadjuvant therapy) or 4-8 weeks after last neoadjuvant dose (1-3 cycles); surgery beyond this was considered surgical delay. Adjuvant therapy began 4-12 weeks after surgery. EFS was assessed in the surgical population.\n\nRESULTS: Of 397 participants randomized to pembrolizumab and 400 to placebo, 325 (82.1%) and 317 (79.4%), respectively, underwent surgery. At data cutoff (July 10, 2023), 4.9% (pembrolizumab) and 7.6% (placebo) of participants experienced surgical delay; 38.9% and 28.4%, respectively, experienced nodal downstaging; 78.8% and 75.1% underwent lobectomy; and 92.0% and 84.2% had R0 resections. Pembrolizumab improved EFS irrespective of disease stage, nodal status, and type of surgery vs chemotherapy. Eight participants (pembrolizumab, n = 6; placebo, n = 2) died ≤30 days after surgery from surgery-related adverse events.\n\nCONCLUSIONS: Neoadjuvant pembrolizumab did not adversely affect surgical outcomes, was associated with numerically higher R0 resections, and improved EFS vs neoadjuvant chemotherapy in surgically relevant subgroups in early-stage NSCLC."
    },
    {
      "pmid": "41192526",
      "doi": "10.1016/j.cellsig.2025.112211",
      "title": "RIPK2/STAT3 signaling axis drives lung cancer metastasis through SNAIL activation: Molecular mechanisms and clinical implications.",
      "journal": "Cellular signalling",
      "pubdate": "2026-02-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41192526/",
      "url_doi": "https://doi.org/10.1016/j.cellsig.2025.112211",
      "abstract": "BACKGROUND: Lung adenocarcinoma is the most common histological subtype of lung cancer with high metastatic propensity. Epithelial-mesenchymal transition (EMT) plays a crucial role in tumor metastasis, but the molecular mechanisms remain incompletely elucidated. This study investigates the role of RIPK2 in EMT and metastasis of lung adenocarcinoma.\n\nMETHODS: TCGA database analysis determined RIPK2 expression and clinical significance. RNA interference, overexpression, qRT-PCR, Western blot, co-immunoprecipitation, and immunofluorescence were employed in A549 and PC-9 cell lines. Transwell, EdU, colony formation assays, and cytoskeletal staining assessed cell invasion, proliferation, and EMT changes. Nuclear localization signal (NLS) and nuclear export signal (NES) fusion proteins investigated subcellular localization effects. Tail vein injection in nude mice validated in vivo effects.\n\nRESULTS: RIPK2 was highly expressed in lung adenocarcinoma tissues and associated with poor prognosis. RIPK2 knockdown inhibited while overexpression promoted EMT, invasion, and metastasis. Co-immunoprecipitation and immunofluorescence confirmed direct RIPK2-STAT3 interaction. RIPK2 specifically upregulated EMT transcription factor SNAIL expression. Co-expression of RIPK2 and SNAIL correlated with shorter patient survival. STAT3 or SNAIL knockdown inhibited RIPK2-induced EMT and metastasis. Nuclear-localized RIPK2 completely restored cellular EMT, invasion, and metastatic capabilities while enhancing cisplatin resistance.\n\nCONCLUSION: RIPK2 translocates to the nucleus, interacts with STAT3, and synergistically upregulates SNAIL expression, promoting EMT, invasion, metastasis, and chemotherapy resistance in lung adenocarcinoma. The RIPK2-STAT3-SNAIL signaling axis represents a potential therapeutic target."
    },
    {
      "pmid": "41557980",
      "doi": "10.1200/JCO-25-01794",
      "title": "Radiosurgery for Small Cell Lung Cancer Brain Metastases: Comparing the JLGK0901 and BWH/DFCI Trials.",
      "journal": "Journal of clinical oncology : official journal of the American Society of Clinical Oncology",
      "pubdate": "2026-01-20T00:00:00+00:00",
      "pubtypes": [
        "Letter"
      ],
      "entity": "SCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41557980/",
      "url_doi": "https://doi.org/10.1200/JCO-25-01794",
      "abstract": null
    },
    {
      "pmid": "41557979",
      "doi": "10.1200/JCO-25-01867",
      "title": "Expanding Indications for Stereotactic Radiosurgery in Small Cell Lung Cancer With Brain Metastases.",
      "journal": "Journal of clinical oncology : official journal of the American Society of Clinical Oncology",
      "pubdate": "2026-01-20T00:00:00+00:00",
      "pubtypes": [
        "Letter"
      ],
      "entity": "SCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41557979/",
      "url_doi": "https://doi.org/10.1200/JCO-25-01867",
      "abstract": null
    },
    {
      "pmid": "41557973",
      "doi": "10.1200/JCO-25-01729",
      "title": "Limitations in Study Design and Stratification in Phase II Stereotactic Radiosurgery Trial for Small Cell Lung Cancer Brain Metastases.",
      "journal": "Journal of clinical oncology : official journal of the American Society of Clinical Oncology",
      "pubdate": "2026-01-20T00:00:00+00:00",
      "pubtypes": [
        "Letter"
      ],
      "entity": "SCLC",
      "trial_type": "Phase II",
      "study_class": "Prospective",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41557973/",
      "url_doi": "https://doi.org/10.1200/JCO-25-01729",
      "abstract": null
    },
    {
      "pmid": "41557968",
      "doi": "10.1200/JCO-25-02528",
      "title": "Reply to: \"Limitations in Study Design and Stratification in Phase II Stereotactic Radiosurgery Trial for Small Cell Lung Cancer Brain Metastases,\" \"Radiosurgery for Small Cell Lung Cancer Brain Metastases: Comparing the JLGK0901 and BWH/DFCI Trials,\" and \"Expanding Indications for Stereotactic Radiosurgery in Small Cell Lung Cancer With Brain Metastases\".",
      "journal": "Journal of clinical oncology : official journal of the American Society of Clinical Oncology",
      "pubdate": "2026-01-20T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "SCLC",
      "trial_type": "Phase II",
      "study_class": "Prospective",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41557968/",
      "url_doi": "https://doi.org/10.1200/JCO-25-02528",
      "abstract": null
    },
    {
      "pmid": "41553307",
      "doi": "10.1016/j.jtho.2025.12.001",
      "title": "Biology and Clinical Management of Non-V600 BRAF Alterations in NSCLC.",
      "journal": "Journal of thoracic oncology : official publication of the International Association for the Study of Lung Cancer",
      "pubdate": "2026-01-19T00:00:00+00:00",
      "pubtypes": [
        "Journal Article",
        "Review"
      ],
      "entity": "NSCLC",
      "trial_type": "Review/Meta",
      "study_class": "Review",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41553307/",
      "url_doi": "https://doi.org/10.1016/j.jtho.2025.12.001",
      "abstract": "BRAF mutations are detected in approximately 3% to 8% of patients with NSCLC. In contrast to melanoma, in which most BRAF mutations occur at the V600 codon, only approximately 35% of BRAF-mutant NSCLC tumors harbor V600 mutations. Among the remaining cases, 60% to 70% present non-V600 mutations, primarily in exons 11 and 15. BRAF mutations are classified into three classes according to their kinase activity and their dependence on RAS activation. Compared with class I (V600), patients with class II and class III mutations are associated with poorer clinical outcomes partly due to the lack of effective targeted therapeutic strategies. Indeed, although dual BRAF and MEK inhibition has demonstrated clinical benefit in BRAF V600-mutant NSCLC, there is currently no consensus on treatment strategies for patients with class II and class III mutations. Beyond point mutations, other BRAF alterations (e.g., gene fusions, deletions, and amplifications) have been identified in treatment-naive tumors and in the context of acquired resistance to targeted therapies in other oncogene-driven NSCLC subtypes. However, the biology and clinical implications of these alterations remain poorly characterized. In this review, we provide a comprehensive overview on the biology, epidemiology, and therapeutic strategies of class II/III BRAF mutations, fusions, deletions, and amplifications in NSCLC. We highlight current challenges in the clinical management of BRAF-mutant NSCLC, emerging inhibitors, and combinatorial therapeutic strategies developed to treat non-V600E BRAF-driven cancers. Finally, we briefly discuss BRAF alterations in the context of resistance to targeted therapies in other oncogene-driven NSCLC."
    },
    {
      "pmid": "41389771",
      "doi": "10.1016/j.ejca.2025.116165",
      "title": "Long-term outcomes of preoperative nivolumab with or without relatlimab in patients with resectable non-small-cell lung cancer (NEOpredict-Lung).",
      "journal": "European journal of cancer (Oxford, England : 1990)",
      "pubdate": "2026-01-17T00:00:00+00:00",
      "pubtypes": [
        "Journal Article",
        "Randomized Controlled Trial"
      ],
      "entity": "Thoracic-other",
      "trial_type": "RCT",
      "study_class": "Prospective",
      "is_oa": true,
      "oa_url": "https://www.ejcancer.com/article/S0959-8049(25)01051-2/pdf",
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41389771/",
      "url_doi": "https://doi.org/10.1016/j.ejca.2025.116165",
      "abstract": "BACKGROUND: Preoperative immunotherapy targeting PD-1/-L1 with chemotherapy induces histopathological responses and improves survival in patients with resectable non-small cell lung cancer (NSCLC). NEOpredict-Lung (NCT04205552) established the feasibility of dual blockade of PD-1 and LAG-3 immune checkpoints prior to curatively intended resection. Here we report extended follow-up, postoperative treatments and patterns of response and recurrence.\n\nPATIENTS AND METHODS: Patients with resectable NSCLC (stages IB-IIIA) were randomized to receive two doses nivolumab (240 mg, arm A) with or without relatlimab (80 mg, arm B) every 2 weeks. Overall and disease-free survival (OS, DFS) rates, response and recurrence patterns and subsequent therapies were evaluated.\n\nRESULTS: 60 patients were enrolled from March 2020 to July 2022. The present analysis was conducted per December 2024 with a median follow-up of 37.4 months. 45 patients were alive without disease recurrence,15 patients recurred (4 locoregional and 11 metastatic), and 7 patients died. The 3-year OS and DFS rates were 88.4 % and 73.3 % in arm A and 88.9 % and 60.3 % in arm B. Patients achieving major pathological response (≤10 % viable tumor cells in resected NSCLC) trended towards better DFS (HR 0.35; 95 % CI, 0.1-1.19). Downstaging was confirmed in 53.3 % of patients in arm A and in 66.7 % of patients in arm B. Nodal downstaging occurred in 28.6 % of patients with nodal disease in arm A and in 66.7 % of patients in arm B.\n\nCONCLUSIONS: Short course preoperative nivolumab with or without relatlimab showed encouraging efficacy and survival outcomes, which compare favorably with chemo-immunotherapy-based perioperative treatment regimens."
    },
    {
      "pmid": "41421886",
      "doi": "10.1016/j.ejca.2025.116069",
      "title": "Bridging the gap in lung cancer: A comprehensive global strategy for change.",
      "journal": "European journal of cancer (Oxford, England : 1990)",
      "pubdate": "2026-01-17T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Preclinical",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41421886/",
      "url_doi": "https://doi.org/10.1016/j.ejca.2025.116069",
      "abstract": "BACKGROUND: Unless greater awareness inspires action, lung cancer will become the next global public health emergency. Despite improvements in screening, diagnosis, and treatments, more must be done because global incidence continues to increase. Concerted action must address the burden both between and within countries. Inequalities result from the uneven distribution of resources while inequities result from differences in prevention, screening, diagnosis, and treatment.\n\nMETHOD: Participants in the 9th International Lung Cancer Network conference (Athens, June 2023) received an advanced draft of the declaration with a confidentiality notice by email upon completion of online registration. They were invited to provide comments and suggestions up to seven days before the meeting. All contributions were reviewed by the authors and incorporated into the final version circulated the day before the meeting began. Although not a formal Delphi-style process, this approach prioritized inclusivity, transparency, and broad endorsement. Outreach extended beyond onsite attendees, ensuring diverse perspectives and representation. This process complements methodological consensus approaches by uniting stakeholders around shared policy goals.\n\nRESULTS: At the 9th International Lung Cancer Network conference, participants were invited to sign the final declaration, and 785 did so. Since then, 20 organizations worldwide have formally endorsed the Consensus Statement, and support continues to grow. The inclusive design has fostered broad and sustained backing, underscoring the value of the Statement as a unifying policy declaration advancing shared principles.\n\nCONCLUSION: The Consensus Statement, Bridging the Gap in the Diagnosis and Management of Lung Cancer, reinforces five unifying principles: improve and expand prevention; focus on early detection; ensure equitable and sustainable access to treatment; build partnerships and promote investment; and, combat stigma, recognizing it as a social determinant of public health."
    },
    {
      "pmid": "41543339",
      "doi": "10.1158/1078-0432.CCR-25-2734",
      "title": "RRAS and RRAS2 mutations are recurrent oncogenic drivers in lung cancer and are sensitive to the pan-RAS inhibitor RMC-6236.",
      "journal": "Clinical cancer research : an official journal of the American Association for Cancer Research",
      "pubdate": "2026-01-16T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41543339/",
      "url_doi": "https://doi.org/10.1158/1078-0432.CCR-25-2734",
      "abstract": "INTRODUCTION: RRAS and RRAS2 encode a subfamily of RAS-like small GTPases that share considerable structural and functional similarities with KRAS, HRAS, and NRAS. Whether homologous RRAS/RRAS2 mutations are oncogenic and actionable drivers in lung cancer remains underexplored.\n\nMETHODS: An institutional cohort of 8,488 non-small cell lung carcinomas (NSCLC) sequenced by comprehensive targeted DNA sequencing (MSK-IMPACT) between 2016-2024 was evaluated for RRAS/RRAS2 mutations. RRASQ87L or RRAS2Q72L were modeled in murine IL3-dependent Ba/F3 cells and immortalized human bronchiolar epithelial cells (HBECs). The oncogenic potential, signaling characteristics, and sensitivity to PI3K and MAPK pathway inhibitors, including the novel pan-RAS inhibitor RMC-6236, were evaluated in vitro and in vivo.\n\nRESULTS: RRASQ87L or RRAS2Q72L, homologous to KRAS-codon Q61 substitutions, were found in ~0.45% of NSCLCs (38/8,488), with all but two lacking other MAPK pathway oncogenic drivers. RRASQ87L and RRAS2Q72L mutations transformed Ba/F3 and HBEC cells and robustly activated MAPK and PI3K-mTOR pathway signaling. RMC-6236 suppressed proliferation of RRASQ87L and RRAS2Q72L mutant cell lines, reduced ERK phosphorylation, induced apoptosis, and impeded cell-cycle progression. In vivo, RMC-6236 significantly inhibited growth of RRASQ87L/RRAS2Q72L-mutant HBEC-derived xenografts.\n\nCONCLUSIONS: RRASQ87L and RRAS2Q72L are recurrent, oncogenic, and potentially actionable drivers in NSCLC. Our study supports the inclusion of RRAS/RRAS2 into routine molecular diagnostic panels for precision oncology and provides preclinical rationale for investigating the potential therapeutic utility of pan-RAS inhibitors for patients with RRASQ87L/RRAS2Q72L-mutant lung cancers."
    },
    {
      "pmid": "41545766",
      "doi": "10.1038/s44321-025-00354-9",
      "title": "NOTCH1 intracellular domain stabilization by MDM2 plays a major role in NSCLC response to platinum.",
      "journal": "EMBO molecular medicine",
      "pubdate": "2026-01-16T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://link.springer.com/content/pdf/10.1038/s44321-025-00354-9.pdf",
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41545766/",
      "url_doi": "https://doi.org/10.1038/s44321-025-00354-9",
      "abstract": "Despite major advances in the clinical management of non-small cell lung carcinoma (NSCLC), most patients treated with first-line platinum-based chemotherapy combined with immune checkpoint inhibitors will relapse, which constitutes an unmet medical need. Here, we found that various DNA damage inducers increase the levels of Notch Intracellular Domain (NICD), the active form of NOTCH1. Mechanistically, we revealed that, upon platinum treatment, the expression levels of both MDM2 and NICD were increased and that MDM2 stabilised NICD through ubiquitination. Using NSCLC patient-derived xenografts displaying intrinsic carboplatin resistance, we demonstrated that combining carboplatin with a γ-secretase inhibitor, which hinders NICD generation, significantly improves survival and reduces tumour growth compared with carboplatin monotherapy. Furthermore, in patients with NSCLC who received platinum-based chemotherapy, the level of MDM2 expression in the tumour correlated with poor progression-free survival, which further validates the key role of MDM2 in response to platinum compounds. Our findings present a new therapeutic opportunity for patients with NSCLC, the most common form of lung cancer."
    },
    {
      "pmid": "41537704",
      "doi": "10.1158/1078-0432.CCR-25-4382",
      "title": "Landscape of Genomic Mechanisms of Resistance to Selective RET Inhibitors in RET-Altered Solid Tumors: Analysis of the RETgistry Global Consortium.",
      "journal": "Clinical cancer research : an official journal of the American Association for Cancer Research",
      "pubdate": "2026-01-15T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41537704/",
      "url_doi": "https://doi.org/10.1158/1078-0432.CCR-25-4382",
      "abstract": "PURPOSE: Rearranged during transfection (RET) alterations are oncogenic drivers across solid tumors. Selective RET inhibitors (SRIs) selpercatinib and pralsetinib have transformed outcomes for patients with RET-altered malignancies. Limited knowledge exists on genomic mechanisms of resistance to SRIs.\n\nEXPERIMENTAL DESIGN: We established 'RETgistry,' a global consortium of patients with advanced RET-altered solid tumors who received SRIs and underwent post-progression tissue or plasma biopsies assessed by next-generation sequencing. Frequencies of secondary RET resistance mutations and acquired non-RET gene alterations were determined. Progression-free survival (PFS) and time to treatment discontinuation (TTD) on first SRI were estimated with Kaplan-Meier method.\n\nRESULTS: RETgistry included 109 patients with RET-altered advanced solid tumors (lung: n=94; thyroid: n=15) who underwent 143 post-SRI progression biopsies (tissue: 91; plasma: 52). Median PFS and TTD were 13.9 months (95% confidence interval [CI] 10.1-16.6) and 17.3 months (95% CI 14.0-20.2), respectively. Secondary RET mutations were detected in 20 (14.0%) biopsies (lung cancer: 15 [12.4%], thyroid carcinoma: 5 [22.7%]). Common acquired off-target alterations involved MET (18.2%; amplification: 15.0%), TP53 (8.2%), APC (7.6%), KRAS (7.1%), KEAP1 (5.9%), and CDKN2A/B (5.3%). MET alterations were enriched in post-SRI versus pre-SRI specimens (full cohort: 17.6% vs 2.0%, p=0.022; lung cancer: 19.1% vs 2.1%, p=0.022).\n\nCONCLUSIONS: Prevalence of secondary RET mutations after SRIs was low, underscoring greater role for off-target resistance. Recurrent acquired alterations involving tumor suppressor genes or upstream regulators of MAPK and PI3K pathways were identified, most commonly MET amplification. Continued efforts to characterize SRI resistance biology are critical to guide development of novel therapeutic strategies."
    },
    {
      "pmid": "41537692",
      "doi": "10.1158/1078-0432.CCR-25-2958",
      "title": "Minimal Residual Disease Enhances Prognostic Stratification Beyond Pathological Response in Resectable Non-Small Cell Lung Cancer.",
      "journal": "Clinical cancer research : an official journal of the American Association for Cancer Research",
      "pubdate": "2026-01-15T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Preclinical",
      "is_oa": true,
      "oa_url": "https://aacrjournals.org/clincancerres/article-pdf/doi/10.1158/1078-0432.CCR-25-2958/3724125/ccr-25-2958.pdf",
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41537692/",
      "url_doi": "https://doi.org/10.1158/1078-0432.CCR-25-2958",
      "abstract": "PURPOSE: Perioperative chemoimmunotherapy is the standard of care for resectable, locally advanced non-small cell lung cancer (NSCLC). While pathological complete response (pCR) correlates with excellent survival outcomes, some patients without pCR still exhibit long-term survival. Here we evaluate the added value of minimal residual disease (MRD).\n\nEXPERIMENTAL DESIGN: MRD was assessed in 60 patients from the NADIM II trial (NCT03838159) using Guardant Reveal assay. In NADIM II, NSCLC patients without EGFR or ALK alterations were randomized to receive neoadjuvant nivolumab plus chemotherapy (experimental arm) or chemotherapy alone, followed by surgery. Patients in the experimental arm with R0 resection received adjuvant nivolumab.\n\nRESULTS: MRD detection rate was 9.6%. MRD after surgery or during adjuvant treatment was associated with inferior EFS and OS (HR: 10.2; 95%CI: 3.7-28.3 and HR: 10.0; 95%CI: 2.0-49.9, respectively). All patients with MRD-negative plasma samples in at least two time points were alive (HR: not estimable [NE], p < 0.001), with only one relapse (HR: 41.6; 95%CI: 5.0-348.8), corresponding to a patient relapsing with a single brain metastasis. MRD enhanced the prognostic value of pCR for both EFS (p<0.001) and OS (p=0.015). Among non-pCR patients, MRD remained a significant prognostic marker (HR: 6.2; 95%CI: 2.2-17.1 and HR: 6.5; 95%CI: 1.3-32.5, for EFS and OS respectively). All non-pCR patients with MRD-negative results in at least two time points were alive (HR: NE, p=0.025), with one relapse (HR: 19.9; 95%CI: 2.4-165.6), corresponding to the aforementioned case.\n\nCONCLUSIONS: MRD may refine prognostic evaluation beyond pCR in resectable NSCLC undergoing perioperative chemoimmunotherapy."
    },
    {
      "pmid": "41538410",
      "doi": "10.1126/science.adz9353",
      "title": "A genetically encoded device for transcriptome storage in mammalian cells.",
      "journal": "Science (New York, N.Y.)",
      "pubdate": "2026-01-15T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41538410/",
      "url_doi": "https://doi.org/10.1126/science.adz9353",
      "abstract": "Understanding how cells make decisions over time requires the ability to link past molecular states to future phenotypic outcomes. We present TimeVault, a genetically encoded system that records and stores transcriptomes within living mammalian cells for future readout. TimeVault leverages engineered vault particles that capture mRNA through poly(A) binding protein. We demonstrate that the transcriptome stored by TimeVaults is stable in living cells for over 7 days. TimeVault enables high-fidelity transcriptome-wide recording with minimal cellular perturbation, capturing transient stress responses and revealing gene expression changes underlying drug-naive persister states in lung cancer cells that evade EGFR inhibition. By linking past and present cellular states, TimeVault provides a powerful tool for decoding how cells respond to stress, make fate decisions, and resist therapy."
    }
  ]
}