{
  "generated": "2025-10-08T05:17:19.293089Z",
  "items": [
    {
      "pmid": "41037288",
      "doi": "10.1001/jamaoncol.2025.3768",
      "title": "Nationwide Response to Carboplatin and Cisplatin Shortages in Lung Cancer.",
      "journal": "JAMA oncology",
      "pubdate": "2025-10-02T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": "SJR",
      "metric_value": 8.377,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41037288/",
      "url_doi": "https://doi.org/10.1001/jamaoncol.2025.3768",
      "abstract": null
    },
    {
      "pmid": "40189749",
      "doi": "10.1080/2162402X.2025.2484880",
      "title": "Surrogate markers of intestinal dysfunction associated with survival in advanced cancers.",
      "journal": "Oncoimmunology",
      "pubdate": "2025-12-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://doi.org/10.1080/2162402x.2025.2484880",
      "metric_name": "SJR",
      "metric_value": 2.542,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40189749/",
      "url_doi": "https://doi.org/10.1080/2162402X.2025.2484880",
      "abstract": "Deviations in the diversity and composition of the gut microbiota are called \"gut dysbiosis\". They have been linked to various chronic diseases including cancers and resistance to immunotherapy. Stool shotgun based-metagenomics informs on the ecological composition of the gut microbiota and the prevalence of homeostatic bacteria such as"
    },
    {
      "pmid": "40650354",
      "doi": "10.1002/ijc.70045",
      "title": "Stage- and histology-specific sensitivity for the detection of lung cancer of the NELSON screening protocol-A modeling study.",
      "journal": "International journal of cancer",
      "pubdate": "2025-12-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://onlinelibrary.wiley.com/doi/pdfdirect/10.1002/ijc.70045",
      "metric_name": "SJR",
      "metric_value": 2.252,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40650354/",
      "url_doi": "https://doi.org/10.1002/ijc.70045",
      "abstract": "The Dutch-Belgian lung cancer (LC) screening trial (Nederlands-Leuvens Longkanker Screenings Onderzoek [NELSON]) demonstrated low-dose computed tomography (CT) reduces LC mortality by 24% among men. The NELSON protocol differed from previous trials in the eligibility criteria, the use of volume-based nodule management, and increasing screening intervals. The early-stage sensitivity of the protocol is pivotal in determining the optimal screening strategy, such as the interval and age range. The MIcrosimulation SCreening ANalysis-Lung natural history model was used to reproduce LC incidence and mortality by detection method (clinical or screen-detected), sex, histology, and stage in the NELSON trial based on individual-level data. We evaluated screening effectiveness by stage and histology, accounting for population characteristics, trial design, and LC epidemiology. We find stage IA non-small cell LC (NSCLC) sensitivity of 24.6% (other NSCLC) to 41.0% (adenocarcinoma) at baseline screening. At repeat screening rounds, we find this increased to 70.9% for stage IA adenocarcinoma. For stage IB, the sensitivity by histology ranges from 26.4% to 77.1%; for stage II, 39.6%-81.9%. Upon detection, the probability of LC mortality prevention is estimated at 83% for stage IA. The sensitivity for detecting early-stage LC is found to depend on the histology of cancer and is increased for adenocarcinoma at repeat screenings. Despite a low rate of referral to follow-up screening in the NELSON trial, early-stage CT sensitivity and the probability of mortality prevention were similar to previous estimates from the National Lung cancer Screening Trial. Previously demonstrated screening effectiveness may be maintained when implementing new programs, while reducing unnecessary follow-up when considering NELSON evidence."
    },
    {
      "pmid": "41046186",
      "doi": "10.1016/j.cllc.2025.09.002",
      "title": "Pembrolizumab in Combination With Platinum-Based Chemotherapy in Patients With Recurrent EGFR and ALK Gene Altered Non-Small-Cell Lung Cancer (NSCLC).",
      "journal": "Clinical lung cancer",
      "pubdate": "2025-10-03T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": "SJR",
      "metric_value": 1.515,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41046186/",
      "url_doi": "https://doi.org/10.1016/j.cllc.2025.09.002",
      "abstract": "INTRODUCTION: Immune checkpoint inhibitors have limited efficacy in patients with EGFR-mutant (EGFR+) and ALK-rearranged (ALK+) non-small cell lung cancer (NSCLC). We conducted a phase II study to evaluate the efficacy of pembrolizumab with carboplatin and pemetrexed in these patients.\n\nPATIENTS AND METHODS: EGFR+ or ALK+ NSCLC patients, previously treated with targeted therapy, were eligible. Carboplatin, pemetrexed and pembrolizumab were administered every 3 weeks for 4 cycles followed by maintenance pemetrexed and pembrolizumab. The primary endpoint was response rate (RR). Blood for circulating tumor cells (CTCs) was collected prior to the 1st and 3rd cycles. The plan was to enroll 28 evaluable patients in both EGFR+ and ALK+ cohorts.\n\nRESULTS: Of the 33 patients enrolled, 26 had EGFR+ and 7 had ALK+ NSCLC. RR (95% CI,) was 46% (27%, 67%) in EGFR+ and 29% (4%, 71%), in ALK+ patients, respectively. Median progression free survival (PFS) and overall survival (OS) in the EGFR+ cohort were 8.3 months (7.2-16.5) and 22.2 months (20.6-NE), respectively. In the ALK+ cohort, median PFS and OS were both 2.9 months. The median CTC count at baseline in 15 evaluable EGFR+ patients was 4 cells/mL (0-23). OS among EGFR+ patients with decreasing vs. increasing CTC count during treatment was not reached vs. 18.5 months, respectively (P = .52). The most common adverse events were fatigue, nausea, anemia and AST/ALT elevation.\n\nCONCLUSION: Pembrolizumab in combination with chemotherapy demonstrated encouraging RR of 42% and OS of 22 months among patients with recurrent EGFR+ NSCLC. The efficacy in ALK+ patients was not encouraging."
    },
    {
      "pmid": "41053615",
      "doi": "10.1186/s12890-025-03923-3",
      "title": "Is 'better' enough? Prevalence and multidimensional portrait of persistent dyspnea upon discharge from a respiratory medicine ward: a prospective, single-center observational study.",
      "journal": "BMC pulmonary medicine",
      "pubdate": "2025-10-06T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Other",
      "trial_type": "Prospective (non-RCT)",
      "study_class": "Prospective",
      "is_oa": true,
      "oa_url": "https://bmcpulmmed.biomedcentral.com/counter/pdf/10.1186/s12890-025-03923-3",
      "metric_name": "SJR",
      "metric_value": 0.889,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41053615/",
      "url_doi": "https://doi.org/10.1186/s12890-025-03923-3",
      "abstract": "BACKGROUND: During unplanned respiratory-related hospitalizations, gradual improvement in physiological variables and reduced dependence on treatment are crucial for discharge decisions, possibly supported by discharge care bundles designed to reduce post-hospitalization readmission and mortality. However, patients prioritize symptom relief. This study tested the hypothesis that a significant proportion of patients admitted to a pulmonology ward for an acute respiratory episode experience dyspnea on the day of discharge. It further aimed to describe this dyspnea in a multidimensional manner.\n\nMETHODS: This 10-week prospective study was conducted at a single center and included patients admitted for acute respiratory conditions such as COPD or asthma exacerbation, pneumonia, pulmonary embolism, or pleural disease, who, on admission, reported a rating of 3 or higher on the \"immediate breathing discomfort\" item of the Multidimensional Dyspnea Profile (MDP-A1). Dyspnea was assessed both at admission and at discharge using a multidimensional recall-based tool (MDP) and an instant unidimensional tool, the 10-cm visual analog scale (D-VAS).\n\nRESULTS: Seventy consecutive patients were included in the study. Although dyspnea ratings showed a statistically significant decrease during the hospital stay, dyspnea remained both frequent and intense at discharge. At discharge, 84% of patients provided MDP-A1 recall ratings above 0, with 70% rating their MDP-A1 at 3 or more. In contrast, only 22% provided D-VAS instant ratings of 3 or higher. The median MDP-A1 score was 4.0 [2.0-6.0]. \"Air hunger\" was the most frequently selected sensory descriptor.\n\nCONCLUSIONS: Persistent dyspnea remains frequent and intense among patients being discharged after an acute respiratory episode."
    },
    {
      "pmid": "41039322",
      "doi": "10.1186/s12871-025-03282-w",
      "title": "The impact of spontaneous ventilation anesthesia on thrombosis risk for thoracic surgery: a beagle dog model study.",
      "journal": "BMC anesthesiology",
      "pubdate": "2025-10-02T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://bmcanesthesiol.biomedcentral.com/counter/pdf/10.1186/s12871-025-03282-w",
      "metric_name": "SJR",
      "metric_value": 0.753,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41039322/",
      "url_doi": "https://doi.org/10.1186/s12871-025-03282-w",
      "abstract": "BACKGROUND: Patients with NSCLC after surgery are at high risk of producing venous thromboembolism (VTE). The purpose of this study was to evaluate the effects of spontaneous ventilation (SV) anesthesia and one-lung ventilation (OLV) anesthesia methods on thrombosis risk for thoracic surgery.\n\nMETHODS: A thoracic surgery model of beagle dogs was established. Eight beagle dogs were randomly divided into two groups: four in the OLV and four in the SV groups. Levels of D-dimer during and after surgery were compared between the two groups. In addition, PAI-1, t-PA, TM, and PPBP levels in the plasma using enzyme-linked immunosorbent assay were determined.\n\nRESULTS: The D-dimer significantly increased one day after surgery in the OLV group (625.0 ± 153.5 vs. 2300.0 ± 922.1 μg/L,\n\nCONCLUSIONS: Compared with the OLV anesthesia, there was no significant difference in thrombosis risk during the operation and the second day after the operation for SV anesthesia. However, the changes of D-dimer in SV anesthesia were significantly lower on the first postoperative day. Further investigation is warranted."
    },
    {
      "pmid": "40579378",
      "doi": "10.1093/jjco/hyaf099",
      "title": "Safety and effectiveness of tepotinib in patients with unresectable, advanced or recurrent non-small cell lung cancer with METex14 skipping alterations: post-marketing surveillance in Japan.",
      "journal": "Japanese journal of clinical oncology",
      "pubdate": "2025-10-07T00:00:00+00:00",
      "pubtypes": [
        "Journal Article",
        "Multicenter Study"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Preclinical",
      "is_oa": true,
      "oa_url": "https://doi.org/10.1093/jjco/hyaf099",
      "metric_name": "SJR",
      "metric_value": 0.613,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40579378/",
      "url_doi": "https://doi.org/10.1093/jjco/hyaf099",
      "abstract": "OBJECTIVE: Tepotinib has shown clinical benefits in patients with non-small cell lung cancer (NSCLC) harboring MET exon 14 (METex14) skipping alterations. The objective of this post-marketing surveillance (PMS) was to assess the safety and effectiveness of tepotinib in general clinical practice in Japan.\n\nMETHODS: This multicenter, non-interventional PMS included patients with unresectable, advanced, or recurrent NSCLC with METex14 skipping alterations who received at least one dose of tepotinib. The primary endpoint was the incidence of adverse drug reactions (ADRs) identified as safety specifications (SS) for tepotinib according to the Japanese Risk Management Plan (ADRs of SS); i.e. interstitial lung disease (ILD), fluid retention, hepatic function disorder, renal impairment, and QT interval prolongation (classified by preferred term). The secondary endpoints were ADRs of SS in patient subgroups and the effectiveness of tepotinib in clinical practice. In total, 147 patients were included (median age 72.0 years).\n\nRESULTS: The incidence of ILD, fluid retention, hepatic function disorder, and renal impairment was 7.5%, 47.6%, 13.6%, and 36.1%, respectively; incidence of grade ≥3 ADRs of SS were 3.4%, 9.5%, 4.8%, and 2.7%, respectively. No instances of QT interval prolongation occurred. Four patients (2.7%) died due to ILD. The objective response rate was 51.0% [95% confidence interval (CI) 42.7, 59.3] and disease control rate was 77.6% (95% CI 69.9, 84.0).\n\nCONCLUSIONS: Tepotinib was generally well tolerated and effective in patients with NSCLC and METex14 skipping alterations in general clinical practice in Japan; no new safety issues or concerns were identified."
    },
    {
      "pmid": "40168159",
      "doi": "10.1080/17581966.2025.2477411",
      "title": "The association between blood-based HYAL2 methylation and early-stage lung cancer: a case-control study.",
      "journal": "Lung cancer management",
      "pubdate": "2025-12-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://doi.org/10.1080/17581966.2025.2477411",
      "metric_name": "SJR",
      "metric_value": 0.506,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40168159/",
      "url_doi": "https://doi.org/10.1080/17581966.2025.2477411",
      "abstract": "BACKGROUND: Blood-based DNA methylation biomarkers have great potential for the early detection of lung cancer (LC). Here, we investigated the association between\n\nMETHODS: Matrix-assisted laser desorption ionization time-of-flight (MALDI-TOF) mass spectrometry was performed to measure the methylation levels of 4 CpG sites in\n\nRESULTS: Hypomethylation of all 4 CpG sites in\n\nCONCLUSIONS: Our results suggested blood-based"
    },
    {
      "pmid": "40961811",
      "doi": "10.1016/j.ejca.2025.115779",
      "title": "Atezolizumab with carboplatin plus nab-paclitaxel combination therapy for TTF-1 negative advanced nonsquamous non-small cell lung cancer: A multicenter, single-arm phase 2 trial (F1NE TUNE, LOGiK 2102).",
      "journal": "European journal of cancer (Oxford, England : 1990)",
      "pubdate": "2025-10-16T00:00:00+00:00",
      "pubtypes": [
        "Journal Article",
        "Multicenter Study"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://doi.org/10.1016/j.ejca.2025.115779",
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40961811/",
      "url_doi": "https://doi.org/10.1016/j.ejca.2025.115779",
      "abstract": "BACKGROUND: Individuals with thyroid transcription factor-1 (TTF-1)-negative nonsquamous non-small cell lung cancer (NSCLC) have a poor prognosis. There have been no prospective studies targeting TTF-1-negative nonsquamous NSCLC.\n\nMETHODS: This multicenter, single-arm phase 2 study enrolled chemotherapy-naïve individuals with TTF-1-negative advanced nonsquamous NSCLC to receive four cycles of atezolizumab in combination with carboplatin plus nab-paclitaxel, followed by atezolizumab alone. The primary endpoint was progression-free survival (PFS).\n\nRESULTS: Between June 2022 and March 2024, 52 patients (41 male and 11 female) with a median age of 68.0 years were enrolled. Thirty-three patients had adenocarcinoma and 19 had nonadenocarcinoma. Nineteen, 30, and 3 patients were current, former, and never-smokers, respectively. The PD-L1 tumor proportion score was < 1 % in 22 cases, 1-49 % in 18 cases, ≥ 50 % in 11 cases, and unknown in 1 case. The median PFS was 4.9 months (80 % confidence interval [CI], 4.3-5.9 months). The lower limit of the 80 % CI did not exceed the prespecified threshold of 4.5 months; therefore, the study did not meet its primary endpoint. The median overall survival was 13.2 months (95 % CI, 10.3-27.2 months). The response rate was 56.9 % (95 % CI, 43.3-69.5 %). There were no new safety signals.\n\nCONCLUSIONS: This first prospective study of individuals with TTF-1-negative advanced nonsquamous NSCLC has provided evidence for the efficacy and safety of the combination of carboplatin plus nab-paclitaxel with atezolizumab in such patients. The prognosis of TTF-1-negative advanced nonsquamous NSCLC remains poor, however, warranting further treatment development."
    },
    {
      "pmid": "40957291",
      "doi": "10.1016/j.ejca.2025.115693",
      "title": "A phase II study of afatinib in combination with pemetrexed and carboplatin in patients with EGFR mutation-positive non-squamous, advanced non-small cell lung cancer (NSCLC) refractory to first-line osimertinib treatment: NEJ025B study.",
      "journal": "European journal of cancer (Oxford, England : 1990)",
      "pubdate": "2025-10-16T00:00:00+00:00",
      "pubtypes": [
        "Journal Article",
        "Multicenter Study"
      ],
      "entity": "NSCLC",
      "trial_type": "Phase II",
      "study_class": "Prospective",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40957291/",
      "url_doi": "https://doi.org/10.1016/j.ejca.2025.115693",
      "abstract": "BACKGROUND: Osimertinib is commonly used as a first-line treatment for EGFR-mutated advanced non-small cell lung cancer (NSCLC). However, the optimal treatment strategy following osimertinib failure remains unclear.\n\nMETHODS: Patients with EGFR-mutated NSCLC and exon 19 deletion or L858R mutation after failure of osimertinib treatment were assigned to a regimen of afatinib (20 mg daily) combined with carboplatin (AUC 5 mg/mL/min) and pemetrexed (500 mg/m\n\nRESULTS: Thirty-six patients were enrolled. One patient met the exclusion criteria, and the efficacy was evaluated in the remaining 35 patients. The 6M-PFSR, the primary endpoint, was 57.1 %. The confidence interval of 39.3-71.5 % exceeded the predefined threshold of 35 %, thereby meeting its primary endpoint. Notably, 28.6 % of patients achieved a long-term PFS of 1 year or longer. The objective response rate (ORR) was 51.4 %, the disease control rate (DCR) was 88.6 %, the median PFS was 8.2 months, the median duration of response (DOR) was 5.6 months, and the median overall survival (OS) was 22.5 months. The most common adverse events were diarrhea (52.8 %) and anorexia (47.2 %), both of which were predictable and manageable. Interstitial pneumonia developed in three patients (8.3 %), one of whom died. Another patient died from sepsis, bringing the total number of deaths in the study to two.\n\nCONCLUSIONS: The combination of afatinib and the platinum doublet demonstrated satisfactory efficacy with manageable adverse events in tumors refractory to osimertinib, meeting its primary endpoint.\n\nTRIAL REGISTRATION NUMBER: jRCTs021200005."
    },
    {
      "pmid": "40923280",
      "doi": "10.1200/JCO-25-00788",
      "title": "Phase II Dose-Randomized Study of Sunvozertinib in Platinum-Pretreated Non-Small Cell Lung Cancer With Epidermal Growth Factor Receptor Exon 20 Insertion Mutations (WU-KONG1B).",
      "journal": "Journal of clinical oncology : official journal of the American Society of Clinical Oncology",
      "pubdate": "2025-10-10T00:00:00+00:00",
      "pubtypes": [
        "Journal Article",
        "Randomized Controlled Trial",
        "Multicenter Study"
      ],
      "entity": "NSCLC",
      "trial_type": "RCT",
      "study_class": "Prospective",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40923280/",
      "url_doi": "https://doi.org/10.1200/JCO-25-00788",
      "abstract": "PURPOSE: WU-KONG1B (ClinicalTrials.gov identifier: NCT03974022) is a multinational phase II, dose-randomized study to assess the antitumor efficacy of sunvozertinib in pretreated patients with advanced non-small cell lung cancer (NSCLC) with epidermal growth factor receptor (\n\nMETHODS: Eligible patients with advanced-stage\n\nRESULTS: Among 85, 89, and 107 efficacy-evaluable patients in 200 mg-rand, 300 mg-rand, and 300 mg-all (including randomly assigned and nonrandomized patients) cohorts, the cORRs were 45.9% (97.5% CI, 33.6% to 58.5%), 47.2% (97.5% CI, 35.1% to 59.5%), and 45.8% (97.5% CI, 34.8% to 57.0%), respectively, per IRC assessment. The predefined null hypothesis was rejected with statistical significance (\n\nCONCLUSION: Sunvozertinib is efficacious at both 200 and 300 mg once daily in treating platinum-pretreated patients with advanced"
    },
    {
      "pmid": "40839841",
      "doi": "10.1200/JCO-25-01448",
      "title": "Reply to: \"Baseline Brain Metastasis Imbalance in TRUST: Implications for Interpreting Intracranial Efficacy of Taletrectinib\" and \"Taletrectinib in ROS1 Fusion-Positive Non-Small Cell Lung Cancer: Promising Yet Premature?\".",
      "journal": "Journal of clinical oncology : official journal of the American Society of Clinical Oncology",
      "pubdate": "2025-10-10T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40839841/",
      "url_doi": "https://doi.org/10.1200/JCO-25-01448",
      "abstract": null
    },
    {
      "pmid": "41055143",
      "doi": "10.1080/14796694.2025.2565995",
      "title": "IDeate-Lung02: a Phase 3 study of second-line ifinatamab deruxtecan in patients with relapsed small cell lung cancer.",
      "journal": "Future oncology (London, England)",
      "pubdate": "2025-10-07T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "SCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41055143/",
      "url_doi": "https://doi.org/10.1080/14796694.2025.2565995",
      "abstract": "Patients with small cell lung cancer (SCLC) have poor prognosis and limited treatment options beyond first-line therapy. B7 homolog 3 (B7-H3) is minimally expressed in normal tissues but highly expressed in SCLC. Ifinatamab deruxtecan (I-DXd), a B7-H3-directed antibody-drug conjugate, has demonstrated promising efficacy and a manageable safety profile in various tumours, including SCLC. IDeate-Lung02 is a global, randomized, open-label Phase 3 study of ~540 patients with relapsed SCLC. Adults with one prior line of platinum-based systemic therapy, ECOG performance status 0-1, and ≥1 measurable lesion (per RECIST 1.1) are eligible for study participation. Patients with asymptomatic untreated or previously treated brain metastases may participate. Patients are randomized 1:1 to receive I-DXd 12 mg/kg intravenously every 3 weeks or treatment of physician's choice (topotecan, amrubicin, or lurbinectedin). Dual primary endpoints are objective response rate (ORR) by blinded independent central review (BICR) and overall survival. Secondary endpoints include ORR by investigator; progression-free survival, duration of response, disease control rate, and time to response, all by BICR and investigator; patient-reported outcomes; and safety. IDeate-Lung02 will ascertain whether I-DXd treatment after only one prior line of systemic treatment improves outcomes for patients with relapsed SCLC compared with topotecan, amrubicin, or lurbinectedin."
    },
    {
      "pmid": "41052301",
      "doi": "10.1093/oncolo/oyaf331",
      "title": "Antibody Drugs Conjugates in Non-Small Cell Lung Cancer: Current Status and Challenges.",
      "journal": "The oncologist",
      "pubdate": "2025-10-06T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://academic.oup.com/oncolo/advance-article-pdf/doi/10.1093/oncolo/oyaf331/64521956/oyaf331.pdf",
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41052301/",
      "url_doi": "https://doi.org/10.1093/oncolo/oyaf331",
      "abstract": "BACKGROUND: Antibody-drug conjugates (ADCs) are an emerging class of therapeutics that combine the specificity of monoclonal antibodies with cytotoxic or immune-stimulatory payloads. In non-small cell lung cancer (NSCLC), they offer a novel strategy with potential in both first line therapy and in cases to overcome resistance to existing targeted and immune-based therapies.\n\nOBJECTIVE: To review the clinical development, efficacy, safety, biomarker strategies, and emerging targets of ADCs in NSCLC, with a focus on implications for practice and ongoing challenges.\n\nMETHODS: We conducted a comprehensive literature review of published trials, conference abstracts, and press releases evaluating ADCs in NSCLC, with attention to target antigens, clinical trial outcomes, and biomarker approaches.\n\nRESULTS: ADCs targeting HER2, TROP2, and c-MET have received regulatory approval in NSCLC, with demonstrated efficacy-particularly in biomarker-selected populations. Bispecific HER3/EGFR-directed ADCs have shown encouraging activity in early-phase studies, with ongoing trials expected to clarify durability and optimal patient selection. Other targets such as ITGB6, B7-H3, and AXL have shown early signals of efficacy. Predictive biomarkers vary in reliability, and mutation, amplification, or protein expression do not uniformly predict response. Toxicity and acquired resistance remain key challenges; improved diagnostics may enhance patient selection.\n\nCONCLUSION: ADCs are poised to reshape the therapeutic landscape of NSCLC. Their success will hinge on refining biomarker strategies, managing toxicity, and integrating resistance-mitigating approaches such as bispecific constructs or rational combinations. As research advances, ADCs may become essential components of personalized therapy across a range of molecular and histologic NSCLC subtypes."
    },
    {
      "pmid": "41052285",
      "doi": "10.1093/oncolo/oyaf332",
      "title": "Antibody Drugs Conjugates in Small-Cell Lung Cancer: Present-Day Status and Promises.",
      "journal": "The oncologist",
      "pubdate": "2025-10-06T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://academic.oup.com/oncolo/advance-article-pdf/doi/10.1093/oncolo/oyaf332/64521973/oyaf332.pdf",
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41052285/",
      "url_doi": "https://doi.org/10.1093/oncolo/oyaf332",
      "abstract": "INTRODUCTION: Small cell lung cancer (SCLC) accounts for 15% of lung cancers and is characterized by an aggressive disease course and historically poor prognosis. Although tumors in most patients respond to initial chemotherapy, relapse is nearly universal and treatment options remain limited. Antibody-drug conjugates (ADCs) have emerged as a novel therapeutic class with potential to address this unmet need.\n\nMETHODS: ClinicalTrials.gov, PubMed, and their associated references and press releases were queried for the search terms \"Antibody-drug conjugates\" and \"SCLC.\" Only English-language sources were included.\n\nRESULTS: Multiple ADCs targeting diverse antigens have been evaluated in relapsed or refractory SCLC. Topoisomerase I inhibitor payloads have generated the most consistent activity across DLL3, TROP2, B7-H3, and SEZ6 targets, while microtubule and pyrrolobenzodiazepine (PBD)- based constructs have not demonstrated durable benefit. Despite encouraging response rates, progression-free survival has remained short, reflecting intrinsic resistance, antigen heterogeneity, and toxicity-related dose limitations.\n\nCONCLUSION: While ADCs have generated encouraging response rates in SCLC, durability has remained limited. Future development will require optimization of payloads, linkers, and trial design to determine whether ADCs can achieve a sustained role in this disease."
    },
    {
      "pmid": "40930114",
      "doi": "10.1016/S0140-6736(25)01719-2",
      "title": "The IASLC-Lancet Commission: a transformative global approach to lung cancer.",
      "journal": "Lancet (London, England)",
      "pubdate": "2025-10-04T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40930114/",
      "url_doi": "https://doi.org/10.1016/S0140-6736(25)01719-2",
      "abstract": null
    },
    {
      "pmid": "41046319",
      "doi": "10.1007/s11547-025-02109-5",
      "title": "CCM-ITALUNG2 pilot on lung cancer screening in Italy: recruitment, integration with smoking cessation and baseline results.",
      "journal": "La Radiologia medica",
      "pubdate": "2025-10-04T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Preclinical",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41046319/",
      "url_doi": "https://doi.org/10.1007/s11547-025-02109-5",
      "abstract": "BACKGROUND: The CCM-ITALUNG2 pilot was implemented to evaluate the feasibility of an organized lung cancer (LC) screening programme in five Italian centres.\n\nMETHODS: The screening pathway included invitation, recruitment, referral to Smoking Cessation Services (SCSs), and use of the Lung-RADS score for low-dose CT reading. Dedicated screening operators followed up participants from recruitment through the clinical follow-up established by multidisciplinary teams. Eligibility criteria included age 55-75 years, ever-smokers with ≥ 25 pack-years; quit within the past 10 years. Baseline round results are presented.\n\nRESULTS: From November 2022 to May 2024, 1,144 of the 1,971 invited individuals (58.0%) were recruited following different strategies including in-person invitation by general practitioners (GPs; 356 subjects, 31.9%) or other healthcare personnel (18.1%), self-presentation (36.3%), and phone invitation using GPs' patient lists (13.7%). Among current smokers, 38.5% accepted referral to SCSs. Eighteen subjects (77.8% in stage I-II) were diagnosed with LC (prevalent LC rate 1.57%). The mean time to surgery was 147 days (standard deviation 73); the false-positive rate was 1.38% (15/1,085).\n\nCONCLUSIONS: By utilizing different organizational models, the pilot was tailored to the specific characteristics of each centre. Phone invitations from GPs' patient lists, in-person invitations by GPs and other healthcare personnel, and self-presentation might enhance equity of access in comparison with self-referral only. Dedicated screening operators, the use of the Lung-RADS scoring system, and a structured clinical follow-up supported participants throughout the screening pathway. Delivering brief advice for smoking cessation during recruitment and offering SCS referral were feasible within the screening pathway."
    },
    {
      "pmid": "41045933",
      "doi": "10.1016/j.xcrm.2025.102396",
      "title": "Updated efficacy and predictive biomarkers of QL1706, a bifunctional PD-1/CTLA-4 dual blocker in advanced solid tumors-A phase 1/1b study.",
      "journal": "Cell reports. Medicine",
      "pubdate": "2025-10-03T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://doi.org/10.1016/j.xcrm.2025.102396",
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41045933/",
      "url_doi": "https://doi.org/10.1016/j.xcrm.2025.102396",
      "abstract": "QL1706 has shown promising efficacy in solid tumors in a phase 1/1b study. Here, we report updated long-term survival outcomes and biomarker analyses. Among 468 patients treated with QL1706 (5 mg/kg), median progression-free survival (mPFS) and overall survival (mOS) are 1.5 and 14.2 months for non-small cell lung cancer (NSCLC), 1.9 and 20.2 months for nasopharyngeal carcinoma (NPC), and 4.2 and 18.6 months for cervical cancer (CC), respectively. Liver metastasis is correlated with poor progression-free survival (PFS) and overall survival (OS) in NSCLC and poor OS in CC, while elevated lactate dehydrogenase is linked to shorter PFS and OS in NPC. CDK4/11q13 diploid or the expression of GZMK"
    },
    {
      "pmid": "41032719",
      "doi": "10.1056/NEJMc2511884",
      "title": "Tarlatamab in Small-Cell Lung Cancer. Reply.",
      "journal": "The New England journal of medicine",
      "pubdate": "2025-10-02T00:00:00+00:00",
      "pubtypes": [
        "Letter",
        "Comment"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41032719/",
      "url_doi": "https://doi.org/10.1056/NEJMc2511884",
      "abstract": null
    }
  ]
}