{
  "generated": "2025-09-10T05:34:00.121870Z",
  "items": [
    {
      "pmid": "40906489",
      "doi": "10.1001/jamaoncol.2025.2891",
      "title": "Current Controversies and Challenges in Non-Oncogene-Addicted Synchronous Oligometastatic Non-Small Cell Lung Cancer: A Review.",
      "journal": "JAMA oncology",
      "pubdate": "2025-09-04T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": "SJR",
      "metric_value": 8.377,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40906489/",
      "url_doi": "https://doi.org/10.1001/jamaoncol.2025.2891",
      "abstract": "IMPORTANCE: It has been stated that especially with the advancements in imaging, systemic therapy, and local radical treatment (LRT) that patients with synchronous oligometastatic disease (sOMD) can potentially benefit from curative-intent treatment. This statement is challenged by the results of the NRG-LU002 randomized phase 2/3 trial, showing no significant progression-free survival and overall survival improvements with the addition of LRT to maintenance systemic therapy in patients with oligometastatic non-small cell lung cancer (NSCLC) who achieved at least stable disease after induction systemic therapy (approximately 90% received an immunotherapy-based regimen). This Review discusses the current challenges and controversies in the treatment of non-oncogene-addicted sOMD.\n\nOBSERVATIONS: Whether LRT indeed can improve survival in a contemporary immunotherapy-based systemic treatment regimen is discussed as well as the optimal treatment sequence. Moreover, the NRG-LU002 trial also sparks debate of whether a true sOMD state exists. Genomic alterations, the tumor microenvironment of the primary tumor and metastasis, organotropism, and tumor heterogeneity can all influence metastatic potential, giving a biological explanation that there could be existence of a true sOMD state. However, as true sOMD cannot be distinguished from early-detected widespread metastatic disease with the current imaging modalities, it becomes difficult to select patients for a radical strategy and protect patients from futile treatment.\n\nCONCLUSIONS AND RELEVANCE: It remains under debate whether synchronous oligometastatic NSCLC represents a distinct biological entity or merely a probabilistic imaging finding. Biomarkers such as circulating tumor DNA, microRNA, and radiomics may improve patient selection but require further validation. Clinical trials should prioritize translational research to address these challenges."
    },
    {
      "pmid": "40906462",
      "doi": "10.1001/jamaoncol.2025.3007",
      "title": "Proton Craniospinal Irradiation for Patients With Leptomeningeal Metastasis: A Randomized Clinical Trial.",
      "journal": "JAMA oncology",
      "pubdate": "2025-09-04T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": "SJR",
      "metric_value": 8.377,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40906462/",
      "url_doi": "https://doi.org/10.1001/jamaoncol.2025.3007",
      "abstract": "IMPORTANCE: Leptomeningeal metastasis (LM) is associated with limited survival and few treatment options. Photon involved-field radiotherapy (IFRT) is the most common radiotherapy treatment for patients with LM from solid tumors.\n\nOBJECTIVE: To assess whether proton craniospinal irradiation (pCSI) would result in superior central nervous system progression-free survival (CNS-PFS) compared with IFRT.\n\nDESIGN, SETTING, AND PARTICIPANTS: A randomized, phase 2 trial of pCSI vs IFRT was conducted between April 16, 2020, and October 11, 2021, and included patients with non-small cell lung cancer and breast cancer with LM. Patients with other solid tumors were also enrolled in an exploratory pCSI cohort.\n\nINTERVENTION: For the randomized groups, after stratifying by histology and systemic disease status, patients were assigned (2:1) to pCSI or IFRT.\n\nMAIN OUTCOMES AND MEASURES: The primary end point was CNS-PFS. Secondary end points included overall survival (OS).\n\nRESULTS: Of 98 total patients, 72 individuals (73.5%) were female, and the median (IQR) age was 59 (50-65) years. A total of 42 and 21 patients were randomly assigned to pCSI and IFRT, respectively. At planned interim analysis, a significant benefit in CNS-PFS was observed with pCSI compared with IFRT, leading to the early discontinuation of the trial. In this final analysis, a significant benefit was continually observed in CNS-PFS with pCSI (median, 8.2 months; 95% CI, 6.6-15.3) vs IFRT (median, 2.3 months; 95% CI, 1.2-4.0; P < .001). A statistically significant and clinically meaningful OS benefit with pCSI (median, 11.3 months; 95% CI, 7.5-18.3) vs IFRT (median, 4.9 months; 95% CI, 3.9-15.0; P = .04) was also observed. For the exploratory pCSI cohort (n = 35), the median CNS-PFS was 5.8 months (95% CI, 4.4-9.1) and OS was 7.0 months (95% CI, 5.4-10.6).\n\nCONCLUSIONS AND RELEVANCE: This randomized clinical trial that assessed the optimal radiotherapy treatment for LM found improved CNS-PFS and OS with pCSI compared with IFRT. The results suggest that pCSI should be considered when available.\n\nTRIAL REGISTRATION: ClinicalTrials.gov Identifier: NCT04343573."
    },
    {
      "pmid": "40920097",
      "doi": "10.1158/2159-8290.CD-25-0526",
      "title": "An Autochthonous Model of Lung Cancer Identifies Requirements for Cellular Transformation in the Naked Mole-Rat.",
      "journal": "Cancer discovery",
      "pubdate": "2025-09-08T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Preclinical",
      "is_oa": false,
      "oa_url": null,
      "metric_name": "SJR",
      "metric_value": 7.283,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40920097/",
      "url_doi": "https://doi.org/10.1158/2159-8290.CD-25-0526",
      "abstract": "There is growing interest in understanding the mechanisms underlying differences in cancer incidence among species (comparative oncology). The naked mole-rat (NMR) is often referenced as \"cancer-resistant\" and prior studies focused on identifying mechanisms explaining this. However, efforts to assess this in vivo have been limited. Herein, we provide evidence that the NMR presents as a novel autochthonous model of lung tumor initiation, driven by an introduction of the oncogenic Eml4-Alk fusion protein using CRISPR-mediated genome editing. Whereas in mice the inversion alone is sufficient to drive tumorigenesis, the inversion alone was insufficient to drive tumorigenesis in the NMR lung and tumor development required additional losses of the tumor suppressors p53 and pRb. Our findings suggest that the proposed \"resistance\" of the NMR to the development of cancer may reflect that the genetic events leading to tumor initiation are likely to be comparable to those present in human cells."
    },
    {
      "pmid": "40904097",
      "doi": "10.1158/2159-8290.CD-24-1866",
      "title": "Histologic Transformation in Cancer: The Path for Clinical Translation.",
      "journal": "Cancer discovery",
      "pubdate": "2025-09-04T00:00:00+00:00",
      "pubtypes": [
        "Journal Article",
        "Review"
      ],
      "entity": "Other",
      "trial_type": "Review/Meta",
      "study_class": "Review",
      "is_oa": false,
      "oa_url": null,
      "metric_name": "SJR",
      "metric_value": 7.283,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40904097/",
      "url_doi": "https://doi.org/10.1158/2159-8290.CD-24-1866",
      "abstract": "UNLABELLED: Lineage plasticity, a critical hallmark of cancer progression, enables tumor cells to evade inhibition of primary oncogenic pathways through histologic transformation. This adaptive process, driven by stemness-associated features and epigenetic reprogramming, poses significant challenges in treatment. Using non-small cell lung cancer and prostate cancer as models, we examine the utility of tissue and liquid biopsies in detecting histologic transformations and tailoring treatments to specific subtypes, which has profound clinical implications, potentially improving outcomes in patients with advanced, therapy-resistant disease. We also discuss emerging therapeutic strategies, including novel molecular targets, and address ongoing clinical challenges in managing treatment-emergent histologic transformation.\n\nSIGNIFICANCE: The advent of highly effective molecularly targeted therapies results in increased recognition of treatment-emergent histologic transformation. This review not only summarizes current evidence on diagnosis and management of lineage plasticity but also explores therapeutic strategies under study, outlining a framework for clinical translation and successful drug development."
    },
    {
      "pmid": "40923935",
      "doi": "10.1002/cncr.70081",
      "title": "Real-world outcomes of neoadjuvant chemoimmunotherapy in patients with nonsmall cell lung cancer: Predictors of surgery, pathologic complete response, and event-free survival.",
      "journal": "Cancer",
      "pubdate": "2025-09-15T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "SCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": "SJR",
      "metric_value": 2.947,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40923935/",
      "url_doi": "https://doi.org/10.1002/cncr.70081",
      "abstract": "BACKGROUND: Trials of neoadjuvant chemoimmunotherapy (chemoIO) have changed the standard of care for resectable nonsmall cell lung cancer (NSCLC). This study characterizes the outcomes of off-trial patients who received treatment with neoadjuvant chemoIO.\n\nMETHODS: The authors analyzed records of patients with stage IB-III NSCLC who received neoadjuvant chemoIO with an intent to proceed to surgical resection at three US academic institutions. Clinical, demographic, and pathologic factors were incorporated in univariable and multivariable regression models to identify associations with outcomes (resection status, pathologic complete response [pCR], and subsequent event-free survival [EFS]) after standard-of-care neoadjuvant chemoIO.\n\nRESULTS: Analyses included 115 patients, of whom 63% had stage III disease, 77% completed three cycles of chemoIO, and 78% underwent surgical resection. Ages older than 72 years versus 64 years and younger were associated with not proceeding to surgery in univariable (p = .006) and multivariable (p = .014) regression analyses. Nineteen patients (17%) had tumors with a pCR, and 34 (30%) had a major pathologic response. Positive programmed death-ligand 1 (PD-L1) expression (≥50%; vs. negative PD-L1 expression: odds ratio, 12.1; 95% confidence interval, 2.0-73.7; p = .007) and KRAS mutations (vs. wild-type KRAS: odds ratio, 3.9; 95% confidence interval, 1.07-14.4; p = .039) were associated with a higher probability of pCR in univariable analysis. The median event-free survival was not reached and did not differ among subgroups stratified by key clinical variables.\n\nCONCLUSIONS: The results from this study confirm the trial experience of high pCR rates after neoadjuvant chemoIO. This supports the use of chemoIO irrespective of KRAS mutation status, PD-L1 expression, and histology, but suggests that this approach may be less suitable for older patients."
    },
    {
      "pmid": "40189749",
      "doi": "10.1080/2162402X.2025.2484880",
      "title": "Surrogate markers of intestinal dysfunction associated with survival in advanced cancers.",
      "journal": "Oncoimmunology",
      "pubdate": "2025-12-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://doi.org/10.1080/2162402x.2025.2484880",
      "metric_name": "SJR",
      "metric_value": 2.542,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40189749/",
      "url_doi": "https://doi.org/10.1080/2162402X.2025.2484880",
      "abstract": "Deviations in the diversity and composition of the gut microbiota are called \"gut dysbiosis\". They have been linked to various chronic diseases including cancers and resistance to immunotherapy. Stool shotgun based-metagenomics informs on the ecological composition of the gut microbiota and the prevalence of homeostatic bacteria such as"
    },
    {
      "pmid": "40924150",
      "doi": "10.1007/s00259-025-07549-9",
      "title": "Synthesis, preclinical evaluation and clinical application of a novel heterodimeric tracer (68)Ga-pentixafor-c(RGDfK) for PET-CT imaging.",
      "journal": "European journal of nuclear medicine and molecular imaging",
      "pubdate": "2025-09-09T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Other",
      "trial_type": null,
      "study_class": "Preclinical",
      "is_oa": false,
      "oa_url": null,
      "metric_name": "SJR",
      "metric_value": 2.392,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40924150/",
      "url_doi": "https://doi.org/10.1007/s00259-025-07549-9",
      "abstract": "OBJECTIVE: CXCR4 and integrin α\n\nMETHODS: The effects of\n\nRESULTS: In vitro,"
    },
    {
      "pmid": "40908346",
      "doi": "10.1007/s40487-025-00372-0",
      "title": "Asian Subgroup Analysis of Patients in the Phase 2 DeLLphi-301 Study of Tarlatamab for Previously Treated Small Cell Lung Cancer.",
      "journal": "Oncology and therapy",
      "pubdate": "2025-09-04T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "SCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://link.springer.com/content/pdf/10.1007/s40487-025-00372-0.pdf",
      "metric_name": "SJR",
      "metric_value": 1.33,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40908346/",
      "url_doi": "https://doi.org/10.1007/s40487-025-00372-0",
      "abstract": "INTRODUCTION: Tarlatamab is a bispecific T-cell engager (BiTE\n\nMETHODS: Patients with previously treated, advanced SCLC received 10 mg tarlatamab every 2 weeks. The primary endpoint was objective response rate (ORR) by blinded independent central review (RECIST version 1.1). Key secondary endpoints included duration of response (DOR), progression-free survival (PFS), overall survival (OS) and safety. The present analysis includes patients enrolled at sites in Asia.\n\nRESULTS: A total of 43 patients were enrolled at sites in Asia. ORR was 46.3% (95% confidence interval [CI], 30.7-62.6) and median DOR was 7.2 months (95% CI 3.9 to not estimable). The median follow-up was 16.6 months for PFS and 21.2 months for OS. Median PFS was 5.4 months (95% CI 3.0-8.1) and median OS was 19.0 months (95% CI 11.4 to not estimable). The most common treatment-emergent adverse event (AE) was cytokine release syndrome (48.8%), and all such events were grade 1 or 2. There were no discontinuations due to treatment-related AEs.\n\nCONCLUSIONS: Tarlatamab demonstrated durable responses and promising survival outcomes with a manageable safety profile in this post hoc analysis of patients from Asia with previously treated SCLC.\n\nTRIAL REGISTRATION: ClinicalTrials.gov, NCT05060016."
    },
    {
      "pmid": "40916834",
      "doi": "10.1093/cei/uxaf050",
      "title": "Expanded senescent CD8 T-cells in IMID patients are associated with distinct inflammatory cytokines.",
      "journal": "Clinical and experimental immunology",
      "pubdate": "2025-09-06T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": "SJR",
      "metric_value": 1.308,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40916834/",
      "url_doi": "https://doi.org/10.1093/cei/uxaf050",
      "abstract": "INTRODUCTION: Immunosenescence remodels immune functions and was first described with aging. It is present in 25% of cancer patients but has also been described in patients with Immune-mediated inflammatory diseases (IMIDs). This study aims at quantifying cells exhibiting a phenotype of senescence in CD4+ (T4sen) and CD8+ (T8sen) T cells, analyzing its potential drivers and the effect of anti-TNF treatment in a prospective cohort of patients with rheumatoid arthritis (RA), spondyloarthritis (SpA) and Sjögren disease (SjD).\n\nMETHODS: Using flow cytometry, we assessed circulating T4sen and T8sen proportions at baseline and three months after initiating anti-TNF treatment in RA and SpA patients using flow cytometry. Circulating levels of cytokines were measured at baseline. These parameters were associated with demographic variables and disease activity. T4sen and T8sen were compared between RA, SpA, SjD, healthy donors and cancer patients.\n\nRESULTS: T8sen but not T4sen accumulated more in patients with IMIDs than in patients with lung cancer and healthy donors. CMV-seropositivity was associated with the accumulation of T8sen. T8sen were associated with high IL-6 in SpA patients and high IP10 in SjD patients. Anti-TNF did not impact the T8sen proportion of RA and SpA patients. There was a trend toward an increase of T8sen in anti-TNF non-responders after three months of treatment.\n\nCONCLUSION: Senescent CD8 T cells are enriched in IMID patients, suggesting that immune aging is a shared feature of chronic inflammatory diseases. The association between T8sen and distinct inflammatory cytokines underscores the potential role of senescence in shaping immune responses in IMIDs."
    },
    {
      "pmid": "40684711",
      "doi": "10.1016/j.ejrad.2025.112290",
      "title": "Comparison of nodule volumetric classification by using two different nodule segmentation algorithms in an LDCT lung cancer baseline screening dataset.",
      "journal": "European journal of radiology",
      "pubdate": "2025-10-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": "SJR",
      "metric_value": 1.003,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40684711/",
      "url_doi": "https://doi.org/10.1016/j.ejrad.2025.112290",
      "abstract": "OBJECTIVES: To investigate the performance of two segmentation algorithms for nodule volumetric classification at participant/scan level in the NELCIN-B3 cohort (Netherlands and China Big-3), a lung cancer screening program (LCS) using low-dose CT (LDCT).\n\nMETHODS: Baseline scans with qualified LDCT images from consecutive NELCIN-B3 participants were included from June 2017 to July 2018. Performance of two software algorithms were independently evaluated by two radiologists: software A (Syngo.via VB30A) by reader 1 and software B (AVIEW v1.1.39.14) by reader 2. According to the NELSON2.0 protocol, nodules with a solid component ≥ 100 mm\n\nRESULTS: In total, 300 participants were evaluated comprising 159 women (53.0 %) and 193 (64.3 %) never smokers, with a mean ± standard deviation age of 61.2 ± 7.1 years. There were disagreements in 17 cases: in 11 (11/300, 3.7 %), this was due to differences in nodule selection and nodule type classification between readers; and in 6 (6/300, 2.0 %), this was due to variations in nodule volume metrics between algorithms. Inter-software agreement was almost perfect (κ = 0.88 [95 %CI: 0.83-0.93]). In the consensus read, reader 1/software A generated 12 misclassifications (11 PM, 1 NM), giving a negative predictive value of 99.6 % (95 % CI: 98.9 %-100.0 %). Reader 2/software B generated 5 misclassifications (2 PM, 3 NM), giving a negative predictive value of 98.9 % (95 % CI: 97.7 %-100.0 %).\n\nCONCLUSION: Two software algorithms (Syngo.via VB30A and AVIEW v1.1.39.14) showed comparable performance for lung nodule volumetric classification at participant/scan level. Further research is needed to confirm the results in other LDCT LCS programs."
    },
    {
      "pmid": "40924208",
      "doi": "10.1007/s00432-025-06275-x",
      "title": "DigiNet: Optimizing personalized care for patients with stage IV non-small cell lung cancer (NSCLC) through a digitally connected provider network-analysis plan of a prospective multicenter cohort trial.",
      "journal": "Journal of cancer research and clinical oncology",
      "pubdate": "2025-09-09T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": "Prospective (non-RCT)",
      "study_class": "Prospective",
      "is_oa": false,
      "oa_url": null,
      "metric_name": "SJR",
      "metric_value": 0.91,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40924208/",
      "url_doi": "https://doi.org/10.1007/s00432-025-06275-x",
      "abstract": "PURPOSE: The German sector-based healthcare system poses a major challenge to continuous patient monitoring and long-term follow-up, both essential for generating high-quality, longitudinal real-world data. The national Network for Genomic Medicine (nNGM) bridges the inpatient and outpatient care sectors to provide comprehensive molecular diagnostics and personalized treatment for non-small cell lung cancer (NSCLC) patients in Germany. Building on the established nNGM infrastructure, the DigiNet study aims to evaluate the impact of digitally integrated, personalized care on overall survival (OS) and the optimization of treatment pathways, compared to routine care.\n\nMETHODS: DigiNet is a prospective, controlled, non-randomized multicenter cohort study including patients with stage IV NSCLC in two study regions (East and West) in Germany. The results of molecular diagnostics and clinical information, along with the entire treatment data are documented in a shared database. A board of lung cancer specialists monitors critical events. Patients digitally complete quality of life questionnaires, with results visualized for physicians. To assess the impact of this personalized digital care, a population-based control group will be identified by matching cohorts within the involved cancer registries. The primary endpoint is OS, and secondary endpoints comprise time on first-line treatment and hospitalization rates. Furthermore, a health economic and business economic evaluation will be conducted. Qualitative interviews with patients and physicians will be performed to assess barriers and facilitating factors for implementing the DigiNet intervention.\n\nETHICS: The study protocol was reviewed and approved by the Ethics Committee of the University Hospital of Cologne (21-1521).\n\nTRIAL REGISTRATION: NCT05818449, registered retrospectively on December 12, 2022."
    },
    {
      "pmid": "40168159",
      "doi": "10.1080/17581966.2025.2477411",
      "title": "The association between blood-based HYAL2 methylation and early-stage lung cancer: a case-control study.",
      "journal": "Lung cancer management",
      "pubdate": "2025-12-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://doi.org/10.1080/17581966.2025.2477411",
      "metric_name": "SJR",
      "metric_value": 0.506,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40168159/",
      "url_doi": "https://doi.org/10.1080/17581966.2025.2477411",
      "abstract": "BACKGROUND: Blood-based DNA methylation biomarkers have great potential for the early detection of lung cancer (LC). Here, we investigated the association between\n\nMETHODS: Matrix-assisted laser desorption ionization time-of-flight (MALDI-TOF) mass spectrometry was performed to measure the methylation levels of 4 CpG sites in\n\nRESULTS: Hypomethylation of all 4 CpG sites in\n\nCONCLUSIONS: Our results suggested blood-based"
    },
    {
      "pmid": "40923969",
      "doi": "10.1016/j.jtho.2025.07.117",
      "title": "Enhanced Versus Standard Dermatologic Management With Amivantamab-Lazertinib in EGFR-Mutated Advanced NSCLC: The COCOON Global Randomized Controlled Trial.",
      "journal": "Journal of thoracic oncology : official publication of the International Association for the Study of Lung Cancer",
      "pubdate": "2025-09-09T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40923969/",
      "url_doi": "https://doi.org/10.1016/j.jtho.2025.07.117",
      "abstract": "INTRODUCTION: Amivantamab plus lazertinib significantly improved progression-free and overall survival versus osimertinib in patients with previously untreated, EGFR-mutant advanced NSCLC. EGFR-targeted therapies are associated with dermatologic adverse events (AEs), which can affect quality of life (QoL). COCOON was conducted to assess prophylactic management and improve treatment experience.\n\nMETHODS: In the phase 2 COCOON study (NCT06120140), participants with previously untreated, EGFR-mutant, locally advanced or metastatic NSCLC received intravenous amivantamab plus oral lazertinib and were randomized 1:1 to enhanced dermatologic management (COCOON DM) or standard of care (SoC DM) per local guidelines. COCOON DM included oral doxycycline or minocycline (100 mg twice daily; weeks 1-12), clindamycin 1% (on scalp daily; weeks 13-52), chlorhexidine 4% (on fingernails and toenails daily), and ceramide-based moisturizer (on body and face at least daily). Primary end point was incidence of grade 2 or higher dermatologic AEs of interest (DAEIs) by week 12.\n\nRESULTS: In total, 201 participants were randomized (99 to COCOON DM and 102 to SoC DM). At a median follow-up of 7.1 months, COCOON DM demonstrated significant reduction in the primary end point versus SoC DM (42% versus 75%; OR, 0.24; 95% confidence interval, 0.13-0.45; p < 0.0001). By week 12, the largest benefit with COCOON DM was observed in DAEIs involving the face and body (excludes paronychia; 26% versus 60%; p < 0.0001) and DAEIs involving the scalp (10% versus 26%; p = 0.0049). This benefit was maintained at 6 months, with significant reductions of DAEIs involving face, body, and scalp (excluding paronychia). Patient-reported outcomes favored COCOON DM, indicating reduced impact of dermatologic symptoms on QoL.\n\nCONCLUSION: An uncomplicated, widely available, prophylactic regimen (COCOON DM) reduced the incidence of DAEIs with amivantamab-lazertinib and the impact of symptoms on QoL."
    },
    {
      "pmid": "40923280",
      "doi": "10.1200/JCO-25-00788",
      "title": "Phase II Dose-Randomized Study of Sunvozertinib in Platinum-Pretreated Non-Small Cell Lung Cancer With Epidermal Growth Factor Receptor Exon 20 Insertion Mutations (WU-KONG1B).",
      "journal": "Journal of clinical oncology : official journal of the American Society of Clinical Oncology",
      "pubdate": "2025-09-09T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": "Phase II",
      "study_class": "Prospective",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40923280/",
      "url_doi": "https://doi.org/10.1200/JCO-25-00788",
      "abstract": "PURPOSE: WU-KONG1B (ClinicalTrials.gov identifier: NCT03974022) is a multinational phase II, dose-randomized study to assess the antitumor efficacy of sunvozertinib in pretreated patients with advanced non-small cell lung cancer (NSCLC) with epidermal growth factor receptor (\n\nMETHODS: Eligible patients with advanced-stage\n\nRESULTS: Among 85, 89, and 107 efficacy-evaluable patients in 200 mg-rand, 300 mg-rand, and 300 mg-all (including randomly assigned and nonrandomized patients) cohorts, the cORRs were 45.9% (97.5% CI, 33.6% to 58.5%), 47.2% (97.5% CI, 35.1% to 59.5%), and 45.8% (97.5% CI, 34.8% to 57.0%), respectively, per IRC assessment. The predefined null hypothesis was rejected with statistical significance (\n\nCONCLUSION: Sunvozertinib is efficacious at both 200 and 300 mg once daily in treating platinum-pretreated patients with advanced"
    },
    {
      "pmid": "40730077",
      "doi": "10.1016/j.ejca.2025.115624",
      "title": "Subcutaneous versus intravenous amivantamab, both in combination with lazertinib, in refractory EGFR-mutated non-small cell lung cancer: Patient satisfaction and resource utilization results from the PALOMA-3 study.",
      "journal": "European journal of cancer (Oxford, England : 1990)",
      "pubdate": "2025-09-09T00:00:00+00:00",
      "pubtypes": [
        "Journal Article",
        "Randomized Controlled Trial",
        "Multicenter Study"
      ],
      "entity": "NSCLC",
      "trial_type": "RCT",
      "study_class": "Prospective",
      "is_oa": true,
      "oa_url": "https://www.ejcancer.com/article/S0959-8049(25)00406-X/pdf",
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40730077/",
      "url_doi": "https://doi.org/10.1016/j.ejca.2025.115624",
      "abstract": "INTRODUCTION: Intravenous anticancer treatments present challenges for patients and healthcare professionals (HCPs), prompting the development of subcutaneous formulations. In the phase 3 PALOMA-3 study, subcutaneous amivantamab demonstrated noninferior pharmacokinetics and response rates versus intravenous amivantamab (both with lazertinib), with substantially faster administration, a 5-fold reduction in infusion-related reactions, reduced venous thromboembolism, and numerically prolonged survival.\n\nMETHODS: Participants with EGFR-mutated NSCLC and progression on osimertinib and chemotherapy were randomized to subcutaneous (n = 206) or intravenous amivantamab (n = 212), plus lazertinib. Resource utilization and participant-reported treatment satisfaction were evaluated at cycle (C) 1 day (D) 1 and C3D1.\n\nRESULTS: Time-in-chair was substantially lower for subcutaneous versus intravenous amivantamab (C1D1: median [range], 23 min or 0.4 h [0-12.0 h] vs 6.5 h [0-24.0 h]; C3D1: 35 min or 0.6 h [0-6.6 h] vs 3.4 h [0.5-9.0 h]), as were HCP time and participant time-in-room. More participants who received subcutaneous versus intravenous amivantamab reported feeling unrestricted (C1D1, 66 % vs 29 %; C3D1, 60 % vs 42 %) or unbothered (C1D1, 69 % vs 30 %; C3D1, 71 % vs 45 %) by administration, and reported gaining time for other activities (C1D1, 36 % vs 7 %; C3D1, 37 % vs 6 %). Few participants who received subcutaneous amivantamab reported moderate-to-very severe injection-site pain (C1D1, 14 %; C3D1, 16 %), swelling (C1D1, 5 %; C3D1, 6 %), or redness (C1D1, 5 %; C3D1, 6 %). Most subcutaneous amivantamab recipients preferred and were more satisfied with its administration versus historical experience with intravenous therapies and would recommend it.\n\nCONCLUSIONS: In PALOMA-3, subcutaneous amivantamab, which simplifies and shortens administration, reduces resource utilization, and enhances treatment experience, was a preferred option for patients who received amivantamab-lazertinib."
    },
    {
      "pmid": "40923797",
      "doi": "10.1056/NEJMoa2503001",
      "title": "Overall Survival with Amivantamab-Lazertinib in EGFR-Mutated Advanced NSCLC.",
      "journal": "The New England journal of medicine",
      "pubdate": "2025-09-07T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40923797/",
      "url_doi": "https://doi.org/10.1056/NEJMoa2503001",
      "abstract": "BACKGROUND: Previous results from this phase 3 trial showed that progression-free survival among participants with previously untreated\n\nMETHODS: We randomly assigned, in a 2:2:1 ratio, participants with previously untreated\n\nRESULTS: A total of 429 participants each were assigned to receive amivantamab-lazertinib or osimertinib. Over a median follow-up of 37.8 months, amivantamab-lazertinib led to significantly longer overall survival than osimertinib (hazard ratio for death, 0.75; 95% confidence interval, 0.61 to 0.92; P = 0.005); 3-year overall survival was 60% and 51%, respectively. At the clinical cutoff date, 38% of participants in the amivantamab-lazertinib group and 28% in the osimertinib group were still receiving the assigned treatment. Adverse events of grade 3 or higher were more common with amivantamab-lazertinib (in 80% of participants) than with osimertinib (in 52%), particularly skin-related events, venous thromboembolism, and infusion-related events; these findings were consistent with the established safety profile of each treatment. No new safety signals were observed with additional follow-up.\n\nCONCLUSIONS: Amivantamab-lazertinib led to significantly longer overall survival among participants with previously untreated"
    },
    {
      "pmid": "40911432",
      "doi": "10.1158/1078-0432.CCR-25-2090",
      "title": "Seizure-Related Homolog Protein 6 (SEZ6): Biology and Therapeutic Target in Neuroendocrine Carcinomas.",
      "journal": "Clinical cancer research : an official journal of the American Association for Cancer Research",
      "pubdate": "2025-09-05T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40911432/",
      "url_doi": "https://doi.org/10.1158/1078-0432.CCR-25-2090",
      "abstract": "Seizure-related homolog protein 6 (SEZ6) is a cell surface type 1 transmembrane protein involved in neuronal development, expression of which in adult tissues is almost exclusively limited to the central nervous system. Aberrant expression of SEZ6 has been associated with neurodevelopmental and psychiatric disorders including epilepsy, schizophrenia, and Alzheimer's disease. More recently, SEZ6 overexpression has been detected in small cell lung cancer (SCLC) and other high-grade neuroendocrine malignancies, although our understanding of the function of SEZ6 as a driver of cancer is limited. A lineage-defining transcription factor of SCLC, ASCL1, has been implicated as a regulator of SEZ6 expression. SEZ6 has emerged as a novel target for antibody-drug conjugate (ADC) therapy, and early studies have shown promising antitumor activity, demonstrating the potential for SEZ6 to be targeted by drugs with alternate mechanisms of action. Here, we review the current knowledge of the biology of SEZ6 and its implications in malignancy, summarize the preclinical and clinical findings of SEZ6 targeted ADCs, and discuss future directions to further elucidate the role of SEZ6 in SCLC and other neuroendocrine neoplasms."
    },
    {
      "pmid": "40910999",
      "doi": "10.1080/14712598.2025.2555830",
      "title": "Neoadjuvant therapy of NSCLC: a review of the use and impact of monoclonal antibodies.",
      "journal": "Expert opinion on biological therapy",
      "pubdate": "2025-09-05T00:00:00+00:00",
      "pubtypes": [
        "Journal Article",
        "Review"
      ],
      "entity": "NSCLC",
      "trial_type": "Review/Meta",
      "study_class": "Review",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40910999/",
      "url_doi": "https://doi.org/10.1080/14712598.2025.2555830",
      "abstract": "INTRODUCTION: From the 1960s and up until 2021, neoadjuvant chemotherapy has represented the standard of care for potentially resectable stage III (N2) Non-Small Cell Lung Cancer (NSCLC). However, in recent years, immunotherapy in the form of Immune Checkpoint Inhibitors (ICIs) has revolutionized oncology treatment strategies and several ICIs have been investigated for the neoadjuvant treatment of NSCLC, both in monotherapy and in combination with other ICIs or chemotherapy.\n\nAREAS COVERED: Therefore, this paper aims to review the currently available data supporting the role of immunotherapy in the neoadjuvant setting, as well as to discuss the challenges associated with it. We undertook a comprehensive literature search of PubMed, Embase, Cochrane Library, of abstracts and posters from annual meetings of American Society of Clinical Oncology (ASCO), European Society for Medical Oncology (ESMO) and American Association for Cancer Research (AACR) up until November 2024.\n\nEXPERT OPINION: We believe that in a near future ICI plus chemotherapy combinations will represent the new recommended standard of care in the neoadjuvant/perioperative setting. We look forward to the full results coming from the ongoing randomized phase III trials, that will help us guide our choice in terms of patient selection, regimen of choice and response assessment."
    },
    {
      "pmid": "40925068",
      "doi": "10.1016/j.lungcan.2025.108732",
      "title": "Identification of poor prognostic factors using circulating extracellular vesicles in durvalumab consolidation therapy for locally advanced non-small cell lung cancer.",
      "journal": "Lung cancer (Amsterdam, Netherlands)",
      "pubdate": "2025-09-04T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40925068/",
      "url_doi": "https://doi.org/10.1016/j.lungcan.2025.108732",
      "abstract": "BACKGROUND: The risk factors associated with treatment resistance to consolidation durvalumab following chemoradiotherapy (CRT) for locally advanced non-small cell lung cancer (NSCLC) have not been well established.\n\nMETHODS: Extracellular vesicles (EVs) were isolated from the pretreatment serum of 73 patients treated with consolidation durvalumab. Isolation was performed using CD9/CD63 antibodies, and EV proteins were identified using liquid chromatography-tandem mass spectrometry (LC-MS). The relationship between the expression of these proteins and progression-free survival (PFS) after durvalumab initiation was analyzed.\n\nRESULTS: The median PFS was not reached(NR) (95 % confidence interval [CI], 17.2 months-NR), andthe 24-month PFS rate was 54.7 % (95 % CI, 44.4-67.4). Proteomic analysis of circulating EVs identified RPS27A, SAA1, and S100A7 as the primary candidate biomarkers. Notably, patients with high RPS27A expression exhibited a significantly shorter PFS compared with those with low expression; hazard ratio (HR) 2.93 (95 % CI: 1.48-5.79),P = 0.002. Similarly, high SAA1 expression was associated with a shorter PFS; HR 2.94 (95 % CI: 1.37-6.30), P = 0.006. High S100A7 expression also correlated with poorer outcomes; HR 2.94 (95 % CI: 1.43-6.04), P = 0.003. In multivariate analysis, a high expression level of RPS27A was identified as an independent predictor of poor PFS; HR 2.29 (95 % CI: 1.01-5.17), P = 0.047. Multivariate receiver operating characteristic (ROC) analysis incorporating these three proteins yielded an area under the curve (AUC) of 0.71 (95 % CI: 0.59-0.83).\n\nCONCLUSION: This study demonstratedfavorable PFS outcomes in patients receiving durvalumab consolidation therapy. Circulating EV proteomic analysis identified RPS27A, SAA1, and S100A7, particularly RPS27A, as potential biomarkers for predicting resistance to durvalumab."
    },
    {
      "pmid": "40914393",
      "doi": "10.1016/j.jtho.2025.08.024",
      "title": "Screening-Detected versus Interval Lung Cancer in the Biennial Korean National Lung Cancer Screening Program: Proportion, Characteristics, and Mortality.",
      "journal": "Journal of thoracic oncology : official publication of the International Association for the Study of Lung Cancer",
      "pubdate": "2025-09-04T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40914393/",
      "url_doi": "https://doi.org/10.1016/j.jtho.2025.08.024",
      "abstract": "INTRODUCTION: Interval lung cancers (ILCs) are key indicators of lung cancer screening (LCS) performance. However, data on the proportion, characteristics, and mortality of ILCs under biennial screening in Asian populations remain limited.\n\nMETHODS: We analyzed participants from the baseline biennial Korean national LCS program between 2019 and 2020. Screening-detected lung cancers (SLCs) were defined as those diagnosed within 1 year of a positive screening result. ILCs were defined as cancers diagnosed more than 1 year after a negative screening result but within 2 years or before the next screening. Risk factors for ILC were assessed using multivariable logistic regression among participants with a negative screening result. All-cause mortality was compared between SLCs and ILCs using multivariable Cox regression analysis.\n\nRESULTS: Among 124,595 participants, SLCs and ILCs occurred in 0.56% and 0.17%, respectively. ILCs accounted for 18.5% of all lung cancers within 2 years; 65.4% were in Lung-RADS category 1. Risk factors for ILC included older age (adjusted odds ratio [OR], 1.14; 95% CI: 1.11-1.17; P<0.001), greater smoking exposure (adjusted OR, 1.010; 95% CI: 1.004-1.016; P=0.002), a history of malignancy (adjusted OR, 2.22; 95% CI: 1.41-3.51; P<0.001), emphysema (adjusted OR, 2.88; 95% CI: 2.15-3.85; P<0.001), and interstitial lung abnormalities (adjusted OR, 4.16; 95% CI: 2.88-6.01; P<0.001). ILCs showed higher all-cause mortality than SLCs (adjusted hazard ratio, 1.43; 95% CI: 1.13-1.80; P=0.002).\n\nCONCLUSIONS: ILCs are common under biennial LCS, making it potentially suboptimal for Asian heavy smokers."
    }
  ]
}