{
  "generated": "2025-11-20T05:18:24.086850Z",
  "items": [
    {
      "pmid": "41259198",
      "doi": "10.1001/jama.2025.23244",
      "title": "Lung Cancer Screening Saves Lives, but Could Save So Many More.",
      "journal": "JAMA",
      "pubdate": "2025-11-19T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": "SJR",
      "metric_value": 5.352,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41259198/",
      "url_doi": "https://doi.org/10.1001/jama.2025.23244",
      "abstract": null
    },
    {
      "pmid": "40975161",
      "doi": "10.1016/j.canlet.2025.218046",
      "title": "Hinokitiol preferentially suppresses metastatic lung adenocarcinoma via TMDD1-mediated ferroptosis induction and iron-sulfur cluster inhibition.",
      "journal": "Cancer letters",
      "pubdate": "2025-12-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": "SJR",
      "metric_value": 2.756,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40975161/",
      "url_doi": "https://doi.org/10.1016/j.canlet.2025.218046",
      "abstract": "Dysregulated ISC metabolism has been implicated in cancer progression, but its role in LUAD pathogenesis and therapeutic targeting remains poorly understood. Here, we demonstrate that ISC biogenesis is significantly upregulated in LUAD, driven by transcription factors KLF15 and ZNF384, which activate GLRX5, LYRM4, NFS1 and BOLA3 promoters. IL-1β promotes PCAF mitochondrial translocation, releasing EP300 to amplify KLF15/ZNF384-mediated transcriptional activation. The natural monoterpenoid Hinokitiol inhibits LUAD growth by disrupting EP300-KLF15/ZNF384 interactions, suppressing ISC biogenesis gene expression and inducing ferroptosis. Mechanistically, the membrane protein TMDD1, particularly its cytoplasmic domain, promotes Hinokitiol's anti-tumor effects by facilitating EP300-KLF15/ZNF384 dissociation and inhibiting ISC biogenesis. Remarkably, Hinokitiol exhibits stage-dependent efficacy, with superior suppression of metastatic (stage IV) tumors linked to heightened ferroptosis sensitivity. This study not only elucidates the transcriptional machinery governing ISC biogenesis in LUAD but also highlights Hinokitiol's dual mechanism as a promising stage-specific therapeutic agent, offering novel strategies for advanced disease management."
    },
    {
      "pmid": "40189749",
      "doi": "10.1080/2162402X.2025.2484880",
      "title": "Surrogate markers of intestinal dysfunction associated with survival in advanced cancers.",
      "journal": "Oncoimmunology",
      "pubdate": "2025-12-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://doi.org/10.1080/2162402x.2025.2484880",
      "metric_name": "SJR",
      "metric_value": 2.542,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40189749/",
      "url_doi": "https://doi.org/10.1080/2162402X.2025.2484880",
      "abstract": "Deviations in the diversity and composition of the gut microbiota are called \"gut dysbiosis\". They have been linked to various chronic diseases including cancers and resistance to immunotherapy. Stool shotgun based-metagenomics informs on the ecological composition of the gut microbiota and the prevalence of homeostatic bacteria such as"
    },
    {
      "pmid": "41247515",
      "doi": "10.1007/s00259-025-07658-5",
      "title": "[18F]FDG-PET/CT-based evaluation of tumor response kinetics during induction chemotherapy and concurrent radiochemotherapy in stage II - III small-cell lung cancer.",
      "journal": "European journal of nuclear medicine and molecular imaging",
      "pubdate": "2025-11-17T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://link.springer.com/content/pdf/10.1007/s00259-025-07658-5.pdf",
      "metric_name": "SJR",
      "metric_value": 2.392,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41247515/",
      "url_doi": "https://doi.org/10.1007/s00259-025-07658-5",
      "abstract": "PURPOSE: Evaluation of interim-[\n\nMETHODS: We included 35 patients with limited disease SCLC from a prospective institutional registry in this retrospective study. Patients received induction chemotherapy (3-4 cycles) followed by concurrent radiochemotherapy. Baseline [\n\nRESULTS: All patients underwent twice-daily radiotherapy to a base dose of 45 Gy. SUV\n\nCONCLUSION: Our decay model enables the characterization of ["
    },
    {
      "pmid": "40650354",
      "doi": "10.1002/ijc.70045",
      "title": "Stage- and histology-specific sensitivity for the detection of lung cancer of the NELSON screening protocol-A modeling study.",
      "journal": "International journal of cancer",
      "pubdate": "2025-12-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://onlinelibrary.wiley.com/doi/pdfdirect/10.1002/ijc.70045",
      "metric_name": "SJR",
      "metric_value": 2.252,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40650354/",
      "url_doi": "https://doi.org/10.1002/ijc.70045",
      "abstract": "The Dutch-Belgian lung cancer (LC) screening trial (Nederlands-Leuvens Longkanker Screenings Onderzoek [NELSON]) demonstrated low-dose computed tomography (CT) reduces LC mortality by 24% among men. The NELSON protocol differed from previous trials in the eligibility criteria, the use of volume-based nodule management, and increasing screening intervals. The early-stage sensitivity of the protocol is pivotal in determining the optimal screening strategy, such as the interval and age range. The MIcrosimulation SCreening ANalysis-Lung natural history model was used to reproduce LC incidence and mortality by detection method (clinical or screen-detected), sex, histology, and stage in the NELSON trial based on individual-level data. We evaluated screening effectiveness by stage and histology, accounting for population characteristics, trial design, and LC epidemiology. We find stage IA non-small cell LC (NSCLC) sensitivity of 24.6% (other NSCLC) to 41.0% (adenocarcinoma) at baseline screening. At repeat screening rounds, we find this increased to 70.9% for stage IA adenocarcinoma. For stage IB, the sensitivity by histology ranges from 26.4% to 77.1%; for stage II, 39.6%-81.9%. Upon detection, the probability of LC mortality prevention is estimated at 83% for stage IA. The sensitivity for detecting early-stage LC is found to depend on the histology of cancer and is increased for adenocarcinoma at repeat screenings. Despite a low rate of referral to follow-up screening in the NELSON trial, early-stage CT sensitivity and the probability of mortality prevention were similar to previous estimates from the National Lung cancer Screening Trial. Previously demonstrated screening effectiveness may be maintained when implementing new programs, while reducing unnecessary follow-up when considering NELSON evidence."
    },
    {
      "pmid": "41259656",
      "doi": "10.1158/2767-9764.CRC-25-0564",
      "title": "Cancer Incidence and Mortality Estimates in Latin America and the Caribbean: A Systematic Analysis of the GLOBOCAN 2022.",
      "journal": "Cancer research communications",
      "pubdate": "2025-11-19T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://doi.org/10.1158/2767-9764.crc-25-0564",
      "metric_name": "SJR",
      "metric_value": 1.569,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41259656/",
      "url_doi": "https://doi.org/10.1158/2767-9764.CRC-25-0564",
      "abstract": "Cancer is a leading cause of death in Latin America and the Caribbean (LAC), and up-to-date estimates are essential to guide cancer policy. Using GLOBOCAN 2022 data, we analyzed cancer incidence and mortality across 32 LAC countries, calculated age-standardized rates, and assessed early-onset cancer (diagnosed at ages 15-50). Mortality-to-incidence ratios (MIRs) were used as a proxy for survival, Joinpoint regression estimated annual percent change (APC), and linear regression evaluated correlation between the Human Development Index (HDI) and cancer indicators. In 2022, LAC recorded 1,551,060 new cancer cases (ASIR 186.6 per 100,000) and 749,242 deaths (ASMR 85.2 per 100,000). Prostate and breast cancers were the most common malignancies, while lung and breast cancers caused the highest mortality. Mortality declined for prostate cancer (APC -1.52, 95% CI -1.80 to -1.24) and male lung cancer (-2.50, 95% CI -2.68 to -2.33) but increased for female lung (+1.88, 95% CI 1.71 to 2.05) and colorectal cancer (+2.48, 95% CI 2.30 to 2.67). HDI showed an inverse correlation with MIR (p < 0.001), suggesting improved survival with higher development. Early-onset cancers represented 17% of new cases and 11% of deaths. These findings reveal a growing cancer burden and that persistent disparities in cancer epidemiology persists across LAC, highlighting the urgent need for targeted cancer control strategies and regional cancer control plans."
    },
    {
      "pmid": "41259663",
      "doi": "10.1158/2767-9764.CRC-25-0186",
      "title": "Low OLFM1 and BMP6 Expression Predicts Recurrence in Early-Stage Non-Squamous NSCLC with Pure Solid Tumor Appearance.",
      "journal": "Cancer research communications",
      "pubdate": "2025-11-19T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://doi.org/10.1158/2767-9764.crc-25-0186",
      "metric_name": "SJR",
      "metric_value": 1.569,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41259663/",
      "url_doi": "https://doi.org/10.1158/2767-9764.CRC-25-0186",
      "abstract": "While pathological stage I (pStage I) non-small cell lung cancer (NSCLC) has a good prognosis, some patients experience disease recurrence. Identification of prognostic markers for pStage I NSCLC may facilitate personalized perioperative treatment by expanding the candidates for adjuvant treatment. NSCLC patients with ground-glass opacity have excellent survival outcomes. Therefore, in this study, we explored prognostic biomarkers in pure solid non-squamous NSCLC. We focused on non-squamous NSCLC because the gene expression status is distinct from that of squamous cell carcinomas. RNA sequencing was performed on frozen tumor specimens from 33 non-squamous NSCLC patients with disease recurrence (recurrence group) and 33 counterparts (control group) extracted from patients without disease recurrence using propensity score matching (Cohort 1). The candidate genes were further refined using an independent real-world Cohort 2a (N = 125) and validated in The Cancer Genome Atlas cohort. Through the analysis of Cohort 1 and Cohort 2a, we found that low expression of six genes (BMP6, KCNK3, NFASC, OLFM1, PEG3, and TNXB) was associated with disease recurrence. The prognostic impact of the six genes was confirmed using The Cancer Genome Atlas lung adenocarcinoma database. Multivariable proportional hazard analysis using the Cohort 2a dataset revealed that the combination of BMP6 and OLFM1 status predicted recurrence-free survival. In conclusion, we found that low BMP6/OLFM1 gene status is a potential biomarker to identify high-risk pStage I pure solid non-squamous NSCLC patients after pulmonary resection."
    },
    {
      "pmid": "41116141",
      "doi": "10.1007/s12325-025-03365-7",
      "title": "A Time and Motion Study Comparing Subcutaneous Pembrolizumab Versus Intravenous Pembrolizumab in Combination with Chemotherapy for the Treatment of Metastatic Non-small Cell Lung Cancer.",
      "journal": "Advances in therapy",
      "pubdate": "2025-12-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article",
        "Multicenter Study",
        "Randomized Controlled Trial"
      ],
      "entity": "NSCLC",
      "trial_type": "RCT",
      "study_class": "Prospective",
      "is_oa": true,
      "oa_url": "https://link.springer.com/content/pdf/10.1007/s12325-025-03365-7.pdf",
      "metric_name": "SJR",
      "metric_value": 1.236,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41116141/",
      "url_doi": "https://doi.org/10.1007/s12325-025-03365-7",
      "abstract": "INTRODUCTION: Subcutaneous (SC) formulations of oncology therapies could provide time-saving benefits for both patients and healthcare professionals (HCPs) compared with intravenous (IV) delivery. This prospective observational study, conducted alongside the MK-3475A-D77 phase 3, open-label randomized clinical trial, quantifies HCP and patient time with pembrolizumab SC versus pembrolizumab IV among patients with metastatic non-small cell lung cancer.\n\nMETHODS: Seventeen sites across eight countries in Europe (n = 4), South America (n = 3), and Asia (n = 1) were enrolled. Primary endpoints were active HCP time; patient time in the treatment chair, treatment room, and healthcare facility; and consumables usage. Descriptive statistics included weighted mean (WM), and a linear mixed model (LMM) was employed to explore differences in time measures between pembrolizumab SC and pembrolizumab IV per visit.\n\nRESULTS: Overall, 212 observations were analyzed (153 SC and 59 IV). Total active HCP time was reduced by 45.6% with SC versus IV (WM, 14.0 vs 25.8 min); HCPs spent 44.3% less time on the drug preparation process with SC versus IV (WM, 5.1 vs 9.1 min) and 46.3% less time on the drug administration process with SC versus IV (WM, 8.9 vs 16.7 min). Patient chair time was reduced by 49.6% with SC versus IV (WM, 59.0 vs 117.2 min). Patients receiving SC spent less time in the treatment room than those receiving IV (WM, 66.7 vs 126.9 min; difference - 47.4%). Exploratory LMM showed considerable between-group differences for active HCP time and patient time in the treatment chair and treatment room.\n\nCONCLUSION: Pembrolizumab SC substantially reduces active HCP time and patient chair time versus pembrolizumab IV. Time liberated for HCPs could be reallocated toward additional patient care activities, while optimized chair utilization could improve overall healthcare efficiency."
    },
    {
      "pmid": "41108995",
      "doi": "10.1016/j.suronc.2025.102309",
      "title": "Mediastinal staging with video-assisted mediastinoscopic lymphadenectomy after endobronchial ultrasound-guided transbronchial needle aspiration: real-world evidence in 228 patients.",
      "journal": "Surgical oncology",
      "pubdate": "2025-12-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Preclinical",
      "is_oa": false,
      "oa_url": null,
      "metric_name": "SJR",
      "metric_value": 0.792,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41108995/",
      "url_doi": "https://doi.org/10.1016/j.suronc.2025.102309",
      "abstract": "BACKGROUND: Accurate staging of mediastinal lymph nodes in patients with non-small-cell lung cancer (NSCLC) is essential to determine further management. Current guidelines recommend confirmatory mediastinoscopy for patients with suspicious mediastinal lymph node metastases in image-based staging but negative findings on endobronchial ultrasound-guided transbronchial needle aspiration (EBUS-TBNA). In clinical practice, adherence to these recommendations is low and many physicians omit invasive surgical staging. This study aimed to assess the results of subsequent video-assisted mediastinoscopic lymphadenectomy (VAMLA).\n\nMETHODS: Retrospective single-center cohort analysis of patients who underwent surgery between 2015 and 2019. All patients were diagnosed with potentially resectable lung cancer or FDG-avid pulmonary nodule suspicious for NSCLC and underwent VAMLA following N0-N2 EBUS-TBNA for mediastinal staging.\n\nRESULTS: VAMLA was performed in 228 patients. Nodal upstaging after EBUS-TBNA occurred in 17.5 % of the cases (n = 40). During EBUS-TBNA, 1.72 (±1.06) lymph node stations were sampled, compared to 5.59 (±1.1) resected stations in VAMLA (p < 0.001). Clinical nodal status staged by PET/CT was significantly correlated with the occurrence of nodal upstaging by VAMLA, with an odds ratio of 7.69 in cN2 and 5.88 in patients with cN3, compared to cN0. Complications occurred in 8 patients (3.59 %). VAMLA was false negative in 1 patient (0.4 %).\n\nCONCLUSION: Subsequent VAMLA enables the accurate staging of patients after negative EBUS-TBNA. Overall, 17.5 % of cases had nodal upstaging and would otherwise not have received guideline-compliant treatment for NSCLC. These results underline the role of surgical mediastinal staging after negative EBUS-TBNA in patients with suspicious radiologic findings."
    },
    {
      "pmid": "40912643",
      "doi": "10.1016/j.avsg.2025.08.029",
      "title": "Temporal Patterns and Risk Factors for Pulmonary Embolism Associated with Antitumor Therapies in Patients with Lung Cancer.",
      "journal": "Annals of vascular surgery",
      "pubdate": "2025-12-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": "SJR",
      "metric_value": 0.707,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40912643/",
      "url_doi": "https://doi.org/10.1016/j.avsg.2025.08.029",
      "abstract": "BACKGROUND: This study aimed to characterize the association between pulmonary embolism (PE) onset time and various antitumor therapeutic approaches in patients with lung cancer, with the goal of identifying potential high-risk populations.\n\nMETHODS: A retrospective analysis was conducted on clinical records from 2019 to 2025, among the 84,000 inpatients with lung cancer, 106 patients developed PE during hospitalization for antitumor treatment, who were confirmed using spiral computed tomography or pulmonary angiography per Chinese Thoracic Society (2018) and The New England Journal of Medicine (2010) criteria. Data were collected on patient demographics, cancer staging, treatment type, and time to PE onset.\n\nRESULTS: Among patients who developed PE during lung cancer treatment, the mean age was 66.82 ± 10.50 years. Females comprised 64.04% of cases, adenocarcinoma was identified in 60.38%, and stage IV lung cancer was present in 56.60%. First-line therapy was administered in 63.21% of cases, and 66.04% exhibited enlarged mediastinal lymph nodes. The mean D-dimer level among this cohort was 3.559 μg/mL, indicating a heightened thrombotic risk. Temporally, 50.95% of PE cases occurred within 6 months of lung cancer diagnosis. Onset within 3 months following therapy initiation was observed across multiple modalities: 46.15% for chemotherapy, 34.78% for targeted therapy, and 77.78% following surgical intervention. Notably, 16.98% of PE events occurred during the initial chemotherapy cycle. The mean time to PE onset was 1.81 ± 2.51 months for patients undergoing surgery alone, compared to 15.52 ± 12.88 months for those receiving surgery combined with other treatments (P < 0.05). Surgical intervention was identified as an independent risk factor for PE. In early-stage lung cancer, the mean time to PE onset was significantly shorter, with a mean time of 16.38 ± 21.07 months (P < 0.05).\n\nCONCLUSION: The timing and incidence of PE vary according to the type of antitumor therapy administered in lung cancer treatment. These findings underscore the importance of vigilant monitoring, personalized risk assessment, and targeted anticoagulation strategies throughout the therapeutic course."
    },
    {
      "pmid": "41217067",
      "doi": "10.1080/20565623.2025.2578145",
      "title": "Plain language summary of the ALINA study results: alectinib compared with chemotherapy after surgery in people with ALK-positive non-small cell lung cancer.",
      "journal": "Future science OA",
      "pubdate": "2025-12-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://doi.org/10.1080/20565623.2025.2578145",
      "metric_name": "SJR",
      "metric_value": 0.536,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41217067/",
      "url_doi": "https://doi.org/10.1080/20565623.2025.2578145",
      "abstract": null
    },
    {
      "pmid": "41259771",
      "doi": "10.1056/NEJMc2513316",
      "title": "Neoadjuvant Nivolumab plus Chemotherapy in Lung Cancer. Reply.",
      "journal": "The New England journal of medicine",
      "pubdate": "2025-11-20T00:00:00+00:00",
      "pubtypes": [
        "Letter",
        "Comment"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41259771/",
      "url_doi": "https://doi.org/10.1056/NEJMc2513316",
      "abstract": null
    },
    {
      "pmid": "41082707",
      "doi": "10.1200/JCO-25-00036",
      "title": "Simultaneous Durvalumab and Platinum-Based Chemoradiotherapy in Unresectable Stage III Non-Small Cell Lung Cancer: The Phase III PACIFIC-2 Study.",
      "journal": "Journal of clinical oncology : official journal of the American Society of Clinical Oncology",
      "pubdate": "2025-11-20T00:00:00+00:00",
      "pubtypes": [
        "Journal Article",
        "Randomized Controlled Trial",
        "Multicenter Study"
      ],
      "entity": "NSCLC",
      "trial_type": "RCT",
      "study_class": "Prospective",
      "is_oa": true,
      "oa_url": "https://doi.org/10.1200/jco-25-00036",
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41082707/",
      "url_doi": "https://doi.org/10.1200/JCO-25-00036",
      "abstract": "PURPOSE: Immunotherapy targeting PD-L1 improves outcomes in patients with unresectable stage III non-small cell lung cancer (NSCLC) and no progression after definitive, concurrent chemoradiotherapy (cCRT). Earlier administration of immunotherapy, simultaneously with cCRT, may improve outcomes further.\n\nMETHODS: Eligible patients were randomly assigned (2:1) to receive either durvalumab or placebo administered from the start of cCRT. Patients without progression after completing cCRT received consolidation durvalumab or placebo (per initial random assignment) until progression. The primary end point was progression-free survival (PFS) by blinded independent central review. Key secondary end points included objective response rate (ORR), overall survival (OS), the proportion of patients alive at 24 months (OS24), and safety.\n\nRESULTS: In total, 328 patients were randomly assigned to receive durvalumab (n = 219) or placebo (n = 109). There was no statistically significant difference with durvalumab versus placebo in PFS (hazard ratio [HR], 0.85 [95% CI, 0.65 to 1.12];\n\nCONCLUSION: Among patients with unresectable stage III NSCLC, durvalumab administered from the start of cCRT failed to demonstrate additional benefit compared with cCRT plus placebo. Consolidation durvalumab following definitive cCRT remains the standard of care in this setting."
    },
    {
      "pmid": "41254996",
      "doi": "10.2340/1651-226X.2025.44344",
      "title": "Prevalence, molecular characterization, and prognosis of c-Met protein overexpression in a real-world cohort of patients with non-squamous non-small cell lung cancer.",
      "journal": "Acta oncologica (Stockholm, Sweden)",
      "pubdate": "2025-11-18T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://doi.org/10.2340/1651-226x.2025.44344",
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41254996/",
      "url_doi": "https://doi.org/10.2340/1651-226X.2025.44344",
      "abstract": "BACKGROUND AND PURPOSE: c-Met (also known as MET) protein is encoded by the MET proto-oncogene. In non-small cell lung cancer (NSCLC), c-Met protein overexpression (OE) drives tumorigenesis and is a therapeutic target, given recent US Food and Drug Administration approval of telisotuzumab vedotin-tllv. This retrospective analysis of tumor samples and clinical data from real-world patients with non-squamous NSCLC characterized the prevalence of c-Met protein OE, its association with messenger ribonucleic acid (mRNA) expression, MET gene amplification, programmed-death ligand 1 (PD-L1) expression, and its impact on prognosis.\n\nPATIENTS AND METHODS: A patient cohort was selected for manual abstraction of clinical data from electronic health records. Patients were selected based on the availability of sufficient remnant tissue for biomarker analyses, including c-Met immunohistochemistry (IHC). Comparative assessments were conducted for c-Met protein expression by IHC, MET gene amplification, mRNA expression, and PD-L1 expression levels by IHC.\n\nRESULTS: In total, 305 and 84 patients were included in the biomarker prevalence and outcome analyses, respectively. Overall, c-Met protein OE was detected in 25% of tissue samples. Of the 212 samples with fluorescence in situ hybridization data, MET amplification was seen in 9%. Concordance of c-Met protein OE with MET mRNA levels was observed with area under the concentration-time curve values of 0.738 and 0.736 in MET OE or MET high OE, respectively, using Receiver Operating Characteristic analysis. c-Met protein OE was associated with poor prognosis (unadjusted hazard ratio for death of 2.04).\n\nINTERPRETATION: These data suggest that c-Met protein OE is associated with MET mRNA expression, shows limited overlap with other MET aberrations, and may be linked to poor prognosis in NSCLC."
    },
    {
      "pmid": "41197618",
      "doi": "10.1016/j.xcrm.2025.102434",
      "title": "Trilaciclib triggers a neutrophil-related immune response and sensitizes non-small cell lung cancer to anti-PD-1 therapy.",
      "journal": "Cell reports. Medicine",
      "pubdate": "2025-11-18T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://doi.org/10.1016/j.xcrm.2025.102434",
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41197618/",
      "url_doi": "https://doi.org/10.1016/j.xcrm.2025.102434",
      "abstract": "Immunotherapy-based combination approaches have improved treatment efficacy in advanced non-small cell lung cancer (NSCLC), but progressive disease remains a challenge. Trilaciclib is a cyclin-dependent kinase 4/6 inhibitor approved for myelopreservation in extensive-stage small cell lung cancer (ES-SCLC). Our results demonstrate that trilaciclib has antitumor potential in NSCLC without significant toxicity. It reprograms the tumor immune microenvironment by primarily increasing antitumor neutrophils and CD8"
    },
    {
      "pmid": "41248681",
      "doi": "10.1055/a-2748-2597",
      "title": "[Correction: White paper on identification, information, and eligibility assessment of potential participants in lung cancer screening in Germany].",
      "journal": "Pneumologie (Stuttgart, Germany)",
      "pubdate": "2025-11-17T00:00:00+00:00",
      "pubtypes": [
        "Published Erratum"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "http://www.thieme-connect.de/products/ejournals/pdf/10.1055/a-2748-2597.pdf",
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41248681/",
      "url_doi": "https://doi.org/10.1055/a-2748-2597",
      "abstract": null
    },
    {
      "pmid": "41061426",
      "doi": "10.1016/j.ejca.2025.116042",
      "title": "Survival outcomes with carboplatin versus cisplatin and the impact of COVID-19 on platinum choice: A nationwide Netherlands registry study in small cell lung cancer patients (CACIS).",
      "journal": "European journal of cancer (Oxford, England : 1990)",
      "pubdate": "2025-11-17T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "SCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://doi.org/10.1016/j.ejca.2025.116042",
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41061426/",
      "url_doi": "https://doi.org/10.1016/j.ejca.2025.116042",
      "abstract": "BACKGROUND: Guidelines recommend cisplatin as the preferred platinum agent in the first-line treatment for small cell lung cancer (SCLC), especially limited-stage disease (LS-SCLC). However, during the COVID-19 pandemic, carboplatin use likely increased due to logistical advantages. We evaluated the pandemic's impact on platinum agent utilization in the Netherlands and compared overall survival (OS) and safety between cisplatin and carboplatin.\n\nMETHODS: Using Netherlands Cancer Registry data, first-line platinum-based treatments for LS-SCLC and extensive-stage SCLC (ES-SCLC) between 2018 and 2023 were analyzed. OS was evaluated using univariable and multivariable analyses. Grades 3-5 treatment-related adverse events were studied in three hospitals.\n\nFINDINGS: Overall, 1683 LS-SCLC (carboplatin, N = 1011[60 %]; cisplatin, N = 672[40 %]) and 3668 ES-SCLC (carboplatin, N = 3002[82 %]; cisplatin, N = 666[18 %]) patients were included. During the pandemic, quarterly usage rates of carboplatin reached up to 81 % and 90 % in LS-SCLC and ES-SCLC, respectively. In LS-SCLC, univariable analysis showed significantly shorter median OS with carboplatin compared to cisplatin (17.9m vs. 26.3m; HR, 1.48; 95 %CI, 1.31-1.68; p < 0.001). Similar findings were observed in ES-SCLC (8.0m vs. 9.3m; HR, 1.19; 95 %CI, 1.09-1.30; p < 0.001). However, multivariable analyses, after adjusting for confounders, showed no significant OS differences in either LS-SCLC (HR, 1.06; 95 %CI, 0.90-1.25; p = 0.463) or ES-SCLC (HR, 1.01; 95 %CI, 0.92-1.12; p = 0.785). Confounders were performance status (PS), age, sex, and chemoradiotherapy type for LS-SCLC, and PS, age, sex, stage, and liver metastases for ES-SCLC. Hematologic toxicity was higher with carboplatin, while cisplatin led to more nonhematologic toxicity.\n\nINTERPRETATION: These findings challenge the long-standing belief of cisplatin's superiority and support the adoption of carboplatin in SCLC."
    },
    {
      "pmid": "41033152",
      "doi": "10.1016/j.ejca.2025.116011",
      "title": "Early years, advanced disease: The unmet need in young adults with non-small cell lung cancer.",
      "journal": "European journal of cancer (Oxford, England : 1990)",
      "pubdate": "2025-11-17T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://doi.org/10.1016/j.ejca.2025.116011",
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41033152/",
      "url_doi": "https://doi.org/10.1016/j.ejca.2025.116011",
      "abstract": "INTRODUCTION: Young adults are a minority of lung cancer (LC) patients, however, clinical presentation and cancer biology can differ. Here, we report the first German cohort study of young adults with LC.\n\nMETHODS: We included patients diagnosed with LC between 2019 and 2023 at the West German Cancer Centre (University Medicine Essen) in this retrospective cohort study. For analysis of clinicogenomic baseline characteristics and overall survival (OS), patients were stratified by age at diagnosis into a young cohort (YC; n = 56, ≤45 years), an older cohort (OC; n = 2.682, >45 years) and analysed across age decades.\n\nRESULTS: 71 of 2.738 patients with LC (2.59 %) were ≤ 45 years old. 56/71 were diagnosed with NSCLC or SCLC. YC frequently reported no history of smoking (21 % vs. 6 %; p < 0.001). Among YC, adenocarcinoma (59 % vs. 49 %) and NSCLC not-otherwise-specified (NSCLC NOS; 27 % vs. 8.2 %) were the dominant histological subtypes (p < 0.001). Stage IV disease was significantly more common in YC (stage IV: 66 % vs. 44 %; p = 0.005) with more frequent regional lymph node involvement (N1-N3 79 % vs. 56.9 %) and extrathoracic lymph node metastases (38 % vs. 14 %; p < 0.001). Frequent targetable genomic alterations in YC included ALK translocations (21 % vs. 2.2 %; p < 0.001). YC with metastatic NSCLC had similar median OS compared to OC, although OS was improved in those with targetable alterations.\n\nCONCLUSION: Early-onset LC is characterized by advanced disease stage, adenocarcinoma histopathology and frequent targetable genomic alterations, especially in patients without a history of smoking. Early diagnosis remains a critical unmet medical need in this subgroup of patients."
    },
    {
      "pmid": "41248848",
      "doi": "10.1016/j.jtho.2025.11.008",
      "title": "Andamertinib in Advanced Non-Small-Cell Lung Cancer with EGFR Exon 20 Insertions After Platinum-Based Chemotherapy or Immunotherapy: Results from the Phase 2 KANNON Study.",
      "journal": "Journal of thoracic oncology : official publication of the International Association for the Study of Lung Cancer",
      "pubdate": "2025-11-15T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41248848/",
      "url_doi": "https://doi.org/10.1016/j.jtho.2025.11.008",
      "abstract": "PURPOSE: This study aimed to evaluate andamertinib, a selective and irreversible tyrosine kinase inhibitor, in pretreated advanced epidermal growth factor receptor (EGFR) exon 20 insertion (ex20ins)-mutant non-small-cell lung cancer (NSCLC).\n\nPATIENTS AND METHODS: In the phase 2, multicenter, single-arm KANNON study (NCT06015503), patients with locally advanced or metastatic NSCLC harboring EGFR ex20ins mutations who had progressed after platinum-based chemotherapy or immunotherapy received oral andamertinib 240 mg once daily in 28-day cycles. The primary endpoint was the confirmed objective response rate (ORR) assessed by independent review.\n\nRESULTS: A total of 92 patients were enrolled and received daily 240 mg andamertinib, with nearly 30 different exon20ins subtypes included. The confirmed ORR was 42.7% (95% confidence interval [CI], 32.4-53.0), with a disease control rate of 86.5% and a median duration of response of 8.7 months (95% CI, 5.65-11.96). As of September 6, 2025 with a median follow-up of 15.4 months (range, 0.4-20.5), the median progression-free survival was 6.2 months (95% CI, 4.63-7.85), and median overall survival was not reached (95% CI, 13.93 months to not estimable), with a 12-month survival rate of 70.5%. Among 38 patients with brain metastasis, the systemic confirmed ORR was 47.4% (95% CI: 31.5-63.2). Grade ≥3 treatment-related adverse events occurred in 40.2% of patients and the most frequent events were diarrhea (12.0%) and rash (7.6%). No interstitial lung disease or grade ≥3 QT prolongation was reported.\n\nCONCLUSIONS: Andamertinib at 240 mg once daily demonstrated efficacy with a manageable safety profile in previously treated patients with EGFR ex20ins-mutant NSCLC."
    },
    {
      "pmid": "41242285",
      "doi": "10.1016/j.lungcan.2025.108843",
      "title": "Prevalence and molecular landscape of NRG1 fusions in Japanese solid tumors: a nationwide data analysis using the C-CAT database.",
      "journal": "Lung cancer (Amsterdam, Netherlands)",
      "pubdate": "2025-11-15T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41242285/",
      "url_doi": "https://doi.org/10.1016/j.lungcan.2025.108843",
      "abstract": "INTRODUCTION: Neuregulin 1 (NRG1) gene fusions are critical oncogenic drivers that activate the ERBB signaling pathway across various solid tumors. Although targeted therapies for NRG1 fusion-positive cancers are advancing rapidly in clinical settings, their epidemiological and clinicogenomic characteristics remain poorly understood, warranting large-scale investigations.\n\nMETHODS: We performed a retrospective analysis of patients with advanced solid tumors who were registered in the Center for Cancer Genomics and Advanced Therapeutics database of Japan between June 2019 and February 2025. Our evaluation focused on the prevalence of NRG1 fusions, identities of fusion partners, co-occurring genomic alterations, tumor mutational burden, microsatellite instability status, and relevant clinical characteristics.\n\nRESULTS: Our study included 95,149 patients with advanced solid tumors who underwent comprehensive genomic profiling. Among them, 29 (0.03 %) harbored NRG1 fusions, most frequently in lung cancer (17 of 5,670 cases, 0.30 %). CD74 emerged as the predominant fusion partner, constituting 82.4 % of lung cancers, whereas other solid tumors exhibited a more diverse range of partners. Co-occurring genomic alterations were detected in 20 of 29 patients (69.0 %), with the most frequent alterations found in CDKN2A, CDKN2B, and MTAP. Additionally, pathological examination revealed mucinous adenocarcinoma in 17.6 % of lung cancers associated with NRG1 fusions.\n\nCONCLUSION: This study confirms that NRG1 fusions are rare but significantly associated with lung cancer and the CD74 fusion partner. Our nationwide analysis represents the most comprehensive assessment of NRG1 fusions in Japanese patients with advanced solid tumors."
    },
    {
      "pmid": "40581332",
      "doi": "10.1016/j.ijrobp.2025.06.3854",
      "title": "Treatment Toxicity and Outcomes Following Definitive Radiation Therapy for Patients With Early-Stage Non-Small Cell Lung Cancers and Pre-Existing Interstitial Lung Disease-A Systematic Review and Dosimetric Analysis.",
      "journal": "International journal of radiation oncology, biology, physics",
      "pubdate": "2025-11-15T00:00:00+00:00",
      "pubtypes": [
        "Journal Article",
        "Review"
      ],
      "entity": "NSCLC",
      "trial_type": "Review/Meta",
      "study_class": "Review",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40581332/",
      "url_doi": "https://doi.org/10.1016/j.ijrobp.2025.06.3854",
      "abstract": "BACKGROUND: Patients with interstitial lung disease (ILD) who develop lung cancer represent a unique challenge, as they are at higher risk for serious toxicity from local and systemic therapies. The aim of this study is to provide an up-to-date analysis on toxicities and outcomes associated with definitive radiation therapy (RT) in patients with ILD and early-stage non-small cell lung cancer (ES-NSCLC).\n\nMETHODS AND MATERIALS: We performed a systematic review in accordance with Preferred Reporting Items for Systematic Reviews and Meta-Analyses (PRISMA) guidelines. The PubMed (MEDLINE), EMBASE, and Cochrane Library databases were searched from inception until June 2024, for studies including patients with ILD who underwent definitive RT alone for ES-NSCLC. Data including treatment-related mortality, toxicity, local control, and overall survival were collected and analyzed.\n\nRESULTS: Of 3545 records reviewed, 24 studies were identified for full data abstraction, contributing a total of 705 patients. A specific ILD subtype was not reported for 71% (n = 502) of patients. ILD severity was not reported for 62% (n = 440) of patients. Risk of treatment-related mortality was 7.9%, with severe treatment-related respiratory toxicity 15.7%. A higher volume of lung receiving ≥5 Gy (V5) was significantly correlated with mortality. The estimated local control at 3 year was 76% and median overall survival was 2.5 years.\n\nCONCLUSIONS: The relative merits of RT for the treatment of ES-NSCLC in patients with ILD should be considered in the context of the rates of treatment-related mortality and toxicity. Future studies would benefit from consistent reporting of ILD characteristics, which may help in risk stratification in this challenging clinical scenario."
    },
    {
      "pmid": "41248618",
      "doi": "10.1016/j.lungcan.2025.108842",
      "title": "Genetic composition and evolutionary trajectories of brain metastasis in non-small-cell lung cancer.",
      "journal": "Lung cancer (Amsterdam, Netherlands)",
      "pubdate": "2025-11-14T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41248618/",
      "url_doi": "https://doi.org/10.1016/j.lungcan.2025.108842",
      "abstract": "INTRODUCTION: Non-small cell lung cancer (NSCLC) is an aggressive solid malignancy that commonly disseminates to the central nervous system (CNS). Comparative analysis of primary NSCLC and brain metastases (BM) by next-generation sequencing may reveal somatic genetic alterations that drive or favor NSCLC-derived BM.\n\nMETHODS: We performed whole-exome sequencing (WES) in 62 archival samples from 31 paired-matched primary NSCLC sites and corresponding BM. The median age of patients was 66 years; 22 had adenocarcinoma, and 9 had squamous cell carcinoma, 6 patients presented synchronous BM at lung cancer diagnosis, and 22 developed BM after 1-78 months (median 13 months).\n\nRESULTS: Mutations in the RTK-RAS, WNT, NOTCH, and PIK pathways were enriched across all samples. The KMT2D and TP53 genes were the most frequently mutated in the primary tumor and corresponding BM. FAT1, NSD1, and NF1 mutations were among the most frequent alterations newly detected in BM. Non-druggable hotspot alterations in actionable genes, including EGFR, KRAS, ALK, and ROS1, showed various patterns between the two tumor sites.\n\nCONCLUSIONS: Our study provides a comprehensive overview of genetic alterations specific to primary NSCLC, unique to BM, and shared between both sites, which may contribute to BM formation affecting various evolutionary trajectories."
    },
    {
      "pmid": "41242499",
      "doi": "10.1016/j.jtho.2025.11.006",
      "title": "Radiotherapy for Unresectable Locally Advanced Non-Small Cell Lung Cancer: A Practical Multidisciplinary Approach to Challenging Scenarios from the International Association for the Study of Lung Cancer (IASLC) Advanced Radiation Technology (ART) Subcommittee.",
      "journal": "Journal of thoracic oncology : official publication of the International Association for the Study of Lung Cancer",
      "pubdate": "2025-11-14T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41242499/",
      "url_doi": "https://doi.org/10.1016/j.jtho.2025.11.006",
      "abstract": "Stage III non-small cell lung cancer (NSCLC) is a heterogeneous disease with multiple curative and palliative treatment options. Surgery and radiotherapy are the primary local treatment modalities, and their use guided by the principals of tumor resectability and patient operability. Neoadjuvant and adjuvant immunotherapy have changed the patterns of multidisciplinary management of stage III NSCLC. On behalf of the Multidisciplinary Clinical Science Committee and Advanced Radiotherapy Technology Subcommittee of the International Association for the Study of Lung Cancer (IASLC), we present five cases representing challenging scenarios for discussion. The first is strategies for optimizing staging prior to curative-intent, particularly the role of endobronchial ultrasound (EBUS). The second focuses on the role of targeted therapies in the curative-intent chemoradiotherapy paradigm. The third examines treatment approaches for elderly or comorbid patients, specifically the choice between radiotherapy or systemic therapy. The fourth considers the management of patients who do not undergo surgery after neoadjuvant systemic therapy. The fifth concerns the role of adjuvant radiotherapy following neoadjuvant therapy and surgery. Herein, we present a review of challenging clinical scenarios often encountered in thoracic multidisciplinary tumor boards."
    },
    {
      "pmid": "40864503",
      "doi": "10.1158/1078-0432.CCR-25-1735",
      "title": "First-Line MET Tyrosine Kinase Inhibitors versus Immunotherapy ± Chemotherapy for Patients with MET Exon 14 Skipping Mutant Metastatic NSCLC.",
      "journal": "Clinical cancer research : an official journal of the American Association for Cancer Research",
      "pubdate": "2025-11-14T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://aacrjournals.org/clincancerres/article-pdf/doi/10.1158/1078-0432.CCR-25-1735/3646790/ccr-25-1735.pdf",
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40864503/",
      "url_doi": "https://doi.org/10.1158/1078-0432.CCR-25-1735",
      "abstract": "PURPOSE: First-line treatment options for MET exon 14 skipping-mutant metastatic non-small cell lung cancer vary because of differences in drug approvals and clinical experience. This study investigates factors influencing outcomes with first-line MET tyrosine kinase inhibitors (TKI) versus immune checkpoint inhibitors (ICI) ± chemotherapy.\n\nEXPERIMENTAL DESIGN: Clinicopathologic data were collected from patients with metastatic MET exon 14 skipping-mutant non-small cell lung cancer treated with first-line MET TKI or ICI ± chemotherapy at five centers. Primary endpoints were real-world progression-free survival (rwPFS) and overall survival (OS) to first-line MET TKI versus ICI ± chemotherapy. Subgroup analyses by clinical and tumor characteristics were performed.\n\nRESULTS: Among 158 patients, 80 received MET TKI and 78 received ICI ± chemotherapy as first-line treatment. Baseline clinicopathologic features were balanced except for a higher proportion of patients with a history of smoking in the ICI ± chemotherapy group (P = 0.03). With a median follow-up of 37.9 months, no difference was observed in rwPFS (HR, 0.85; P = 0.4) or OS (HR, 0.97; P = 0.9) with first-line MET TKI versus ICI ± chemotherapy. In subgroup analyses, first-line ICI ± chemotherapy improved rwPFS in PD-L1 ≥80% (HR, 0.50; P = 0.03), whereas MET TKI improved rwPFS (HR, 0.40; P = 0.005) and OS (HR, 0.49; P = 0.03) in PD-L1 <50%, as well as rwPFS (HR, 0.39; P = 0.02) and OS (HR, 0.36; P = 0.03) in brain metastases and rwPFS (HR, 0.55; P = 0.01) in bone metastases. No significant differences were observed in the incidence of high-grade toxicity (P = 0.9) or rates of permanent treatment discontinuation (P = 0.2) between first-line MET TKI and ICI ± chemotherapy.\n\nCONCLUSIONS: First-line MET TKI improved outcomes in PD-L1 <50% and brain/bone metastases, whereas ICI ± chemotherapy prolonged PFS only in PD-L1 ≥80%, emphasizing the need for personalized treatment selection."
    }
  ]
}