{
  "generated": "2025-11-25T05:19:11.857604Z",
  "items": [
    {
      "pmid": "41266687",
      "doi": "10.1038/s41591-025-04116-5",
      "title": "Editorial Expression of Concern: Rationale for co-targeting IGF-1R and ALK in ALK fusion-positive lung cancer.",
      "journal": "Nature medicine",
      "pubdate": "2025-11-20T00:00:00+00:00",
      "pubtypes": [],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Preclinical",
      "is_oa": true,
      "oa_url": "https://www.nature.com/articles/s41591-025-04116-5.pdf",
      "metric_name": "SJR",
      "metric_value": 18.333,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41266687/",
      "url_doi": "https://doi.org/10.1038/s41591-025-04116-5",
      "abstract": null
    },
    {
      "pmid": "41259198",
      "doi": "10.1001/jama.2025.23244",
      "title": "Lung Cancer Screening Saves Lives, but Could Save So Many More.",
      "journal": "JAMA",
      "pubdate": "2025-11-19T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": "SJR",
      "metric_value": 5.352,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41259198/",
      "url_doi": "https://doi.org/10.1001/jama.2025.23244",
      "abstract": null
    },
    {
      "pmid": "41266553",
      "doi": "10.1038/s41698-025-01144-9",
      "title": "MET (c-Met) protein overexpression is an emerging protein biomarker in non-small cell lung cancer.",
      "journal": "NPJ precision oncology",
      "pubdate": "2025-11-20T00:00:00+00:00",
      "pubtypes": [
        "Journal Article",
        "Review"
      ],
      "entity": "NSCLC",
      "trial_type": "Review/Meta",
      "study_class": "Review",
      "is_oa": true,
      "oa_url": "https://www.nature.com/articles/s41698-025-01144-9.pdf",
      "metric_name": "SJR",
      "metric_value": 3.37,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41266553/",
      "url_doi": "https://doi.org/10.1038/s41698-025-01144-9",
      "abstract": "MET protein (also known as c-Met protein) overexpression (OE) is an emerging clinically relevant biomarker that is targetable with antibody-drug conjugates. c-Met protein's prevalence varies, depending on the different OE thresholds, antibodies, and detection methodologies used. Unlike MET genomic aberrations, MET protein OE is a protein biomarker requiring immunohistochemistry (IHC)-based testing. Herein, we summarize the current evidence on MET protein OE, including prognostic value, heterogeneity, and stability. We also provide key considerations for enabling optimal real-world testing of this IHC-based biomarker."
    },
    {
      "pmid": "40975161",
      "doi": "10.1016/j.canlet.2025.218046",
      "title": "Hinokitiol preferentially suppresses metastatic lung adenocarcinoma via TMDD1-mediated ferroptosis induction and iron-sulfur cluster inhibition.",
      "journal": "Cancer letters",
      "pubdate": "2025-12-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": "SJR",
      "metric_value": 2.756,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40975161/",
      "url_doi": "https://doi.org/10.1016/j.canlet.2025.218046",
      "abstract": "Dysregulated ISC metabolism has been implicated in cancer progression, but its role in LUAD pathogenesis and therapeutic targeting remains poorly understood. Here, we demonstrate that ISC biogenesis is significantly upregulated in LUAD, driven by transcription factors KLF15 and ZNF384, which activate GLRX5, LYRM4, NFS1 and BOLA3 promoters. IL-1β promotes PCAF mitochondrial translocation, releasing EP300 to amplify KLF15/ZNF384-mediated transcriptional activation. The natural monoterpenoid Hinokitiol inhibits LUAD growth by disrupting EP300-KLF15/ZNF384 interactions, suppressing ISC biogenesis gene expression and inducing ferroptosis. Mechanistically, the membrane protein TMDD1, particularly its cytoplasmic domain, promotes Hinokitiol's anti-tumor effects by facilitating EP300-KLF15/ZNF384 dissociation and inhibiting ISC biogenesis. Remarkably, Hinokitiol exhibits stage-dependent efficacy, with superior suppression of metastatic (stage IV) tumors linked to heightened ferroptosis sensitivity. This study not only elucidates the transcriptional machinery governing ISC biogenesis in LUAD but also highlights Hinokitiol's dual mechanism as a promising stage-specific therapeutic agent, offering novel strategies for advanced disease management."
    },
    {
      "pmid": "40189749",
      "doi": "10.1080/2162402X.2025.2484880",
      "title": "Surrogate markers of intestinal dysfunction associated with survival in advanced cancers.",
      "journal": "Oncoimmunology",
      "pubdate": "2025-12-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://doi.org/10.1080/2162402x.2025.2484880",
      "metric_name": "SJR",
      "metric_value": 2.542,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40189749/",
      "url_doi": "https://doi.org/10.1080/2162402X.2025.2484880",
      "abstract": "Deviations in the diversity and composition of the gut microbiota are called \"gut dysbiosis\". They have been linked to various chronic diseases including cancers and resistance to immunotherapy. Stool shotgun based-metagenomics informs on the ecological composition of the gut microbiota and the prevalence of homeostatic bacteria such as"
    },
    {
      "pmid": "40650354",
      "doi": "10.1002/ijc.70045",
      "title": "Stage- and histology-specific sensitivity for the detection of lung cancer of the NELSON screening protocol-A modeling study.",
      "journal": "International journal of cancer",
      "pubdate": "2025-12-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://onlinelibrary.wiley.com/doi/pdfdirect/10.1002/ijc.70045",
      "metric_name": "SJR",
      "metric_value": 2.252,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40650354/",
      "url_doi": "https://doi.org/10.1002/ijc.70045",
      "abstract": "The Dutch-Belgian lung cancer (LC) screening trial (Nederlands-Leuvens Longkanker Screenings Onderzoek [NELSON]) demonstrated low-dose computed tomography (CT) reduces LC mortality by 24% among men. The NELSON protocol differed from previous trials in the eligibility criteria, the use of volume-based nodule management, and increasing screening intervals. The early-stage sensitivity of the protocol is pivotal in determining the optimal screening strategy, such as the interval and age range. The MIcrosimulation SCreening ANalysis-Lung natural history model was used to reproduce LC incidence and mortality by detection method (clinical or screen-detected), sex, histology, and stage in the NELSON trial based on individual-level data. We evaluated screening effectiveness by stage and histology, accounting for population characteristics, trial design, and LC epidemiology. We find stage IA non-small cell LC (NSCLC) sensitivity of 24.6% (other NSCLC) to 41.0% (adenocarcinoma) at baseline screening. At repeat screening rounds, we find this increased to 70.9% for stage IA adenocarcinoma. For stage IB, the sensitivity by histology ranges from 26.4% to 77.1%; for stage II, 39.6%-81.9%. Upon detection, the probability of LC mortality prevention is estimated at 83% for stage IA. The sensitivity for detecting early-stage LC is found to depend on the histology of cancer and is increased for adenocarcinoma at repeat screenings. Despite a low rate of referral to follow-up screening in the NELSON trial, early-stage CT sensitivity and the probability of mortality prevention were similar to previous estimates from the National Lung cancer Screening Trial. Previously demonstrated screening effectiveness may be maintained when implementing new programs, while reducing unnecessary follow-up when considering NELSON evidence."
    },
    {
      "pmid": "41259656",
      "doi": "10.1158/2767-9764.CRC-25-0564",
      "title": "Cancer Incidence and Mortality Estimates in Latin America and the Caribbean: A Systematic Analysis of the GLOBOCAN 2022.",
      "journal": "Cancer research communications",
      "pubdate": "2025-11-19T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://aacrjournals.org/cancerrescommun/article-pdf/doi/10.1158/2767-9764.CRC-25-0564/3672629/crc-25-0564.pdf",
      "metric_name": "SJR",
      "metric_value": 1.569,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41259656/",
      "url_doi": "https://doi.org/10.1158/2767-9764.CRC-25-0564",
      "abstract": "Cancer is a leading cause of death in Latin America and the Caribbean (LAC), and up-to-date estimates are essential to guide cancer policy. Using GLOBOCAN 2022 data, we analyzed cancer incidence and mortality across 32 LAC countries, calculated age-standardized rates, and assessed early-onset cancer (diagnosed at ages 15-50). Mortality-to-incidence ratios (MIRs) were used as a proxy for survival, Joinpoint regression estimated annual percent change (APC), and linear regression evaluated correlation between the Human Development Index (HDI) and cancer indicators. In 2022, LAC recorded 1,551,060 new cancer cases (ASIR 186.6 per 100,000) and 749,242 deaths (ASMR 85.2 per 100,000). Prostate and breast cancers were the most common malignancies, while lung and breast cancers caused the highest mortality. Mortality declined for prostate cancer (APC -1.52, 95% CI -1.80 to -1.24) and male lung cancer (-2.50, 95% CI -2.68 to -2.33) but increased for female lung (+1.88, 95% CI 1.71 to 2.05) and colorectal cancer (+2.48, 95% CI 2.30 to 2.67). HDI showed an inverse correlation with MIR (p < 0.001), suggesting improved survival with higher development. Early-onset cancers represented 17% of new cases and 11% of deaths. These findings reveal a growing cancer burden and that persistent disparities in cancer epidemiology persists across LAC, highlighting the urgent need for targeted cancer control strategies and regional cancer control plans."
    },
    {
      "pmid": "41259663",
      "doi": "10.1158/2767-9764.CRC-25-0186",
      "title": "Low OLFM1 and BMP6 Expression Predicts Recurrence in Early-Stage Non-Squamous NSCLC with Pure Solid Tumor Appearance.",
      "journal": "Cancer research communications",
      "pubdate": "2025-11-19T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://aacrjournals.org/cancerrescommun/article-pdf/doi/10.1158/2767-9764.CRC-25-0186/3672612/crc-25-0186.pdf",
      "metric_name": "SJR",
      "metric_value": 1.569,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41259663/",
      "url_doi": "https://doi.org/10.1158/2767-9764.CRC-25-0186",
      "abstract": "While pathological stage I (pStage I) non-small cell lung cancer (NSCLC) has a good prognosis, some patients experience disease recurrence. Identification of prognostic markers for pStage I NSCLC may facilitate personalized perioperative treatment by expanding the candidates for adjuvant treatment. NSCLC patients with ground-glass opacity have excellent survival outcomes. Therefore, in this study, we explored prognostic biomarkers in pure solid non-squamous NSCLC. We focused on non-squamous NSCLC because the gene expression status is distinct from that of squamous cell carcinomas. RNA sequencing was performed on frozen tumor specimens from 33 non-squamous NSCLC patients with disease recurrence (recurrence group) and 33 counterparts (control group) extracted from patients without disease recurrence using propensity score matching (Cohort 1). The candidate genes were further refined using an independent real-world Cohort 2a (N = 125) and validated in The Cancer Genome Atlas cohort. Through the analysis of Cohort 1 and Cohort 2a, we found that low expression of six genes (BMP6, KCNK3, NFASC, OLFM1, PEG3, and TNXB) was associated with disease recurrence. The prognostic impact of the six genes was confirmed using The Cancer Genome Atlas lung adenocarcinoma database. Multivariable proportional hazard analysis using the Cohort 2a dataset revealed that the combination of BMP6 and OLFM1 status predicted recurrence-free survival. In conclusion, we found that low BMP6/OLFM1 gene status is a potential biomarker to identify high-risk pStage I pure solid non-squamous NSCLC patients after pulmonary resection."
    },
    {
      "pmid": "41130887",
      "doi": "10.1016/j.cllc.2025.09.013",
      "title": "Tumor-Agnostic Circulating Tumor DNA Analysis as a Comprehensive Predictive Biomarker of Recurrence after Ablative Radiotherapy for Early-Stage Non-Small Cell Lung Cancer.",
      "journal": "Clinical lung cancer",
      "pubdate": "2025-12-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": "SJR",
      "metric_value": 1.515,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41130887/",
      "url_doi": "https://doi.org/10.1016/j.cllc.2025.09.013",
      "abstract": "PURPOSE: This study aimed to evaluate whether pretreatment circulating tumor DNA (ctDNA) is a predictive biomarker for recurrence in patients with early-stage non-small cell lung cancer (ES-NSCLC), including those with pathologically unproven (PU) who received ablative radiotherapy.\n\nMATERIALS AND METHODS: Patients clinically diagnosed with cT1-2N0M0 NSCLC treated with radiotherapy alone at a single institute were included. Pretreatment plasma and matched white blood cell samples were subjected to targeted sequencing to detect ctDNA. The association between ctDNA detection and prognosis was evaluated. Integrated analysis including non-squamous cell carcinoma (SQ) cohort and enhancement of recurrence prediction with radiographic features were also evaluated.\n\nRESULTS: Of the 19 patients (10 SQ, and 9 PU) who met the sequence quality criteria, ctDNA was detected in 6. At the median follow-up of 60 months, detectable ctDNA was significantly associated with inferior progression-free survival (PFS) in both the SQ and PU cohorts (P = .01 and .02). In an analysis of 62 patients combined with the non-SQ cohort, ctDNA detection was the only significant factor for PFS. The combination of ctDNA and a high positron emission tomography maximum standardized uptake value provided a better recurrence risk model than ctDNA alone (the C-index improved from 0.63 to 0.72).\n\nCONCLUSION: These results suggest that pretreatment ctDNA detection can predict recurrence in patients with cT1-2N0M0 NSCLC, including those with PU tumors treated with ablative radiotherapy."
    },
    {
      "pmid": "41067998",
      "doi": "10.1016/j.cllc.2025.08.007",
      "title": "Central Nervous System Outcomes of Lazertinib Treatment in EGFR-Mutated Advanced NSCLC: Pooled Analysis From LASER201 and LASER301.",
      "journal": "Clinical lung cancer",
      "pubdate": "2025-12-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://doi.org/10.1016/j.cllc.2025.08.007",
      "metric_name": "SJR",
      "metric_value": 1.515,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41067998/",
      "url_doi": "https://doi.org/10.1016/j.cllc.2025.08.007",
      "abstract": "BACKGROUND: Lazertinib, a brain-penetrant, third-generation epidermal growth factor receptor (EGFR) tyrosine kinase inhibitor (TKI), significantly improved efficacy in patients with treatment-naïve, EGFR-mutated advanced non-small cell lung cancer (NSCLC) in the clinical trials, LASER201 and LASER301. This analysis evaluated the efficacy and safety of lazertinib in patients with EGFR-mutated NSCLC and CNS metastases using pooled data from LASER201 and LASER301.\n\nPATIENTS AND METHODS: Patients with treatment-naïve, EGFR-mutated advanced NSCLC and stable CNS metastases who were treated with lazertinib in a cohort of LASER201 and LASER301 were included. Intracranial progression-free survival (iPFS), intracranial objective response rate (iORR), intracranial disease control rate (iDCR), intracranial duration of response (iDoR), and treatment-emergent adverse events (TEAEs) were assessed.\n\nRESULTS: A total of 64 patients were included in the intracranial full analysis set (iFAS); 24 patients had at least 1 measurable CNS lesion at baseline. The median iPFS was 27.7 months (95% CI: 15.7-32.8) in the iFAS population. For patients with at least 1 measurable CNS lesion at baseline, iORR was 92% and iDCR was 96%. The median iDoR was 26.5 months (95% CI: 8.3-30.1). TEAEs were reported in 98% of patients in the iFAS population, with grade ≥3 TEAEs occurring in 55% of patients. The most common TEAEs were paresthesia (47%), rash (41%), and pruritus (36%).\n\nCONCLUSION: In this pooled analysis of LASER201 and LASER301, lazertinib demonstrated a clinically meaningful treatment benefit and consistent safety profile in patients with EGFR-mutated advanced NSCLC and CNS metastases."
    },
    {
      "pmid": "40973606",
      "doi": "10.1016/j.cllc.2025.08.012",
      "title": "A Phase 2 Study of Osimertinib in Combination With Platinum-Pemetrexed in Patients With Uncommon Epidermal Growth Factor Receptor-Mutated Advanced Non-Small Cell Lung Cancer (NEJ067/OPAL2).",
      "journal": "Clinical lung cancer",
      "pubdate": "2025-12-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": "SJR",
      "metric_value": 1.515,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40973606/",
      "url_doi": "https://doi.org/10.1016/j.cllc.2025.08.012",
      "abstract": "BACKGROUND: In treatment-naïve advanced non-small cell lung cancer (NSCLC) patients with epidermal growth factor receptor (EGFR) mutations, approximately 10% to 15% correspond to uncommon mutations. For patients with EGFR uncommon mutations, monotherapy with either a second-generation EGFR tyrosine kinase inhibitor (TKI), afatinib, or a third-generation EGFR-TKI, osimertinib, is recommended as the initial therapy. However, needs remain unmet for patients with central nervous system (CNS) metastases and those who do not respond adequately to single-agent TKI therapy for EGFR uncommon mutations. The recently published FLAURA2 trial showed that osimertinib in combination with platinum-pemetrexed significantly prolonged progression-free survival (PFS) and provided high disease control compared with osimertinib monotherapy for common mutations. Therefore, we planned this phase II study to evaluate the efficacy and safety of osimertinib in combination with platinum-pemetrexed in treatment-naïve NSCLC patients with EGFR uncommon mutations.\n\nPATIENTS AND METHODS: Forty patients will be enrolled in the study. The primary endpoint is the objective response rate, and the secondary endpoints include safety, PFS and overall survival in overall patients, patients with and without CNS lesions at baseline and according to mutation subtype.\n\nCONCLUSIONS: In this study, we will explore the efficacy and safety of osimertinib in combination with platinum-pemetrexed in treatment-naïve NSCLC patients with EGFR uncommon mutations. Our findings may provide treatment options for patients with EGFR uncommon mutations, especially those with CNS metastases or those requiring more intensive treatment."
    },
    {
      "pmid": "40887341",
      "doi": "10.1016/j.cllc.2025.08.001",
      "title": "Durvalumab Plus Platinum-Etoposide in Extensive-Stage Small-Cell Lung Cancer: Outcomes in Age, Sex, and Platinum Subgroups From the Phase 3 CASPIAN Study.",
      "journal": "Clinical lung cancer",
      "pubdate": "2025-12-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article",
        "Randomized Controlled Trial",
        "Multicenter Study"
      ],
      "entity": "Thoracic-other",
      "trial_type": "RCT",
      "study_class": "Prospective",
      "is_oa": true,
      "oa_url": "https://www.clinical-lung-cancer.com/article/S1525-7304(25)00164-0/pdf",
      "metric_name": "SJR",
      "metric_value": 1.515,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40887341/",
      "url_doi": "https://doi.org/10.1016/j.cllc.2025.08.001",
      "abstract": "INTRODUCTION: In the phase 3 CASPIAN study, first-line durvalumab plus etoposide combined with either carboplatin or cisplatin (EP) significantly improved overall survival (OS) versus EP alone in treatment-naïve extensive-stage small-cell lung cancer (ES-SCLC). We report exploratory subgroup analyses from CASPIAN.\n\nMETHODS: Patients with untreated ES-SCLC were randomized to durvalumab plus EP or EP alone. We analyzed OS and safety in subgroups defined by age, sex, and planned platinum agent, and patient-reported outcomes (PROs) by age.\n\nRESULTS: Of 537 patients (durvalumab plus EP: n = 268; EP alone: n = 269), 80.6% versus 19.4% were aged <70 versus ≥70 years; 69.6% versus 30.4% were male versus female; and planned platinum was cisplatin versus carboplatin in 25.1% versus 74.9%. The OS HRs for durvalumab plus EP versus EP were 0.71 (95% CI, 0.58-0.88) versus 0.74 (95% CI, 0.49-1.11) for patients aged <70 versus ≥70 years; 0.76 (95% CI, 0.62-0.95) versus 0.60 (95% CI, 0.42-0.84) for males versus females; and 0.65 (95% CI, 0.45-0.94) versus 0.74 (95% CI, 0.60-0.91) for planned cisplatin versus carboplatin. With durvalumab plus EP, rates of grade 3/4 adverse events (AEs) were similar across subgroups; serious AEs were more frequent in patients aged ≥70 versus <70 years; and immune-mediated AEs were more common in females versus males. Adding durvalumab to EP had no detrimental effect on PROs in either age subgroup.\n\nCONCLUSIONS: These findings support the use of durvalumab plus EP as first-line standard of care for ES-SCLC. Additional trials focused on elderly populations would be informative."
    },
    {
      "pmid": "41275660",
      "doi": "10.1016/j.oraloncology.2025.107791",
      "title": "Subcutaneous amivantamab in recurrent/metastatic head and neck squamous cell cancer after disease progression on checkpoint inhibitor and chemotherapy: Preliminary results from the phase 1b/2 OrigAMI-4 study.",
      "journal": "Oral oncology",
      "pubdate": "2025-11-22T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://doi.org/10.1016/j.oraloncology.2025.107791",
      "metric_name": "SJR",
      "metric_value": 1.326,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41275660/",
      "url_doi": "https://doi.org/10.1016/j.oraloncology.2025.107791",
      "abstract": "Overexpression of EGFR and MET occurs in a high proportion of recurrent and/or metastatic (R/M) head and neck squamous cell carcinoma (HNSCC). Amivantamab, an EGFR-MET bispecific antibody with immune-cell directing activity, is approved in EGFR-mutated advanced non-small cell lung cancer and is being evaluated in phase 3 trials for other solid tumors. Cohort 1 of OrigAMI-4 (NCT06385080) enrolled adult participants with human papillomavirus-unrelated R/M HNSCC with disease progression on/after prior checkpoint inhibitor and platinum-based chemotherapy. Subcutaneous amivantamab was administered at 1600 mg (2240 mg for ≥ 80 kg body weight) on Cycle 1 Day 1 and 2400 mg (3360 mg for ≥ 80 kg body weight) thereafter. Primary end point was investigator-assessed objective response rate (ORR). As of July 1, 2025 (median follow-up, 3.5 months [range, 0-13.4]), 86 participants (median age, 63.5 years; 45 % Asian; 43 % White) received ≥ 1 dose of subcutaneous amivantamab. Subcutaneous amivantamab was well tolerated. Administration-related reactions were reported in 7 % (n = 6/86) of participants; no new safety signals were observed. In the efficacy population (n = 38; median follow-up, 8.3 months [range, 1.1-13.4]), confirmed ORR was 45 % (95 % CI, 29 %-62 %), median time to first response was 6.4 weeks (range, 5.7-18.3), and median duration of response was 7.2 months (95 % CI, 5.3-NE). The clinical benefit rate (responder or durable stable disease) was 76 % (95 % CI, 60 %-89 %). Median progression-free survival was 6.8 months (95 % CI, 4.2-9.0). Subcutaneous amivantamab as second-/third-line treatment among participants with R/M HNSCC demonstrated rapid and durable antitumor activity. The safety profile of subcutaneous amivantamab was consistent with previous studies."
    },
    {
      "pmid": "41116141",
      "doi": "10.1007/s12325-025-03365-7",
      "title": "A Time and Motion Study Comparing Subcutaneous Pembrolizumab Versus Intravenous Pembrolizumab in Combination with Chemotherapy for the Treatment of Metastatic Non-small Cell Lung Cancer.",
      "journal": "Advances in therapy",
      "pubdate": "2025-12-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article",
        "Multicenter Study",
        "Randomized Controlled Trial"
      ],
      "entity": "NSCLC",
      "trial_type": "RCT",
      "study_class": "Prospective",
      "is_oa": true,
      "oa_url": "https://link.springer.com/content/pdf/10.1007/s12325-025-03365-7.pdf",
      "metric_name": "SJR",
      "metric_value": 1.236,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41116141/",
      "url_doi": "https://doi.org/10.1007/s12325-025-03365-7",
      "abstract": "INTRODUCTION: Subcutaneous (SC) formulations of oncology therapies could provide time-saving benefits for both patients and healthcare professionals (HCPs) compared with intravenous (IV) delivery. This prospective observational study, conducted alongside the MK-3475A-D77 phase 3, open-label randomized clinical trial, quantifies HCP and patient time with pembrolizumab SC versus pembrolizumab IV among patients with metastatic non-small cell lung cancer.\n\nMETHODS: Seventeen sites across eight countries in Europe (n = 4), South America (n = 3), and Asia (n = 1) were enrolled. Primary endpoints were active HCP time; patient time in the treatment chair, treatment room, and healthcare facility; and consumables usage. Descriptive statistics included weighted mean (WM), and a linear mixed model (LMM) was employed to explore differences in time measures between pembrolizumab SC and pembrolizumab IV per visit.\n\nRESULTS: Overall, 212 observations were analyzed (153 SC and 59 IV). Total active HCP time was reduced by 45.6% with SC versus IV (WM, 14.0 vs 25.8 min); HCPs spent 44.3% less time on the drug preparation process with SC versus IV (WM, 5.1 vs 9.1 min) and 46.3% less time on the drug administration process with SC versus IV (WM, 8.9 vs 16.7 min). Patient chair time was reduced by 49.6% with SC versus IV (WM, 59.0 vs 117.2 min). Patients receiving SC spent less time in the treatment room than those receiving IV (WM, 66.7 vs 126.9 min; difference - 47.4%). Exploratory LMM showed considerable between-group differences for active HCP time and patient time in the treatment chair and treatment room.\n\nCONCLUSION: Pembrolizumab SC substantially reduces active HCP time and patient chair time versus pembrolizumab IV. Time liberated for HCPs could be reallocated toward additional patient care activities, while optimized chair utilization could improve overall healthcare efficiency."
    },
    {
      "pmid": "41237754",
      "doi": "10.1016/j.thromres.2025.109525",
      "title": "Venous thrombosis in lung cancer compared with other tumors: results from the TESEO-SEOM registry.",
      "journal": "Thrombosis research",
      "pubdate": "2025-12-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article",
        "Multicenter Study"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": "SJR",
      "metric_value": 0.972,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41237754/",
      "url_doi": "https://doi.org/10.1016/j.thromres.2025.109525",
      "abstract": "BACKGROUND: Cancer-associated venous thromboembolism (VTE) is a major adverse prognostic factor with heterogeneous outcomes across tumor types. We aimed to describe the characteristics of lung cancer patients with VTE, compare outcomes across malignancies, and assess their association with complications, progression, and survival.\n\nMETHODS: We analyzed TESEO-SEOM, a prospective multicenter registry including patients with active cancer and VTE. Patients were stratified by tumor site, with lung as reference. Outcomes included recurrent VTE, bleeding, and survival. Analyses were stratified by tumor type and VTE presentation (clinically suspected, symptomatic/asymptomatic incidental). Complications were estimated using competing-risk methods.\n\nRESULTS: Among 3855 patients, the most frequent cancers were gastrointestinal (39.4 %), lung (22.2 %), and breast (10.4 %). Pulmonary embolism predominated (55 %), especially in lung cancer (69.8 %). Overall, 48.9 % of events were clinically suspected and 50.9 % incidental; suspected were more common in lung cancer (53.9 %), whereas incidental diagnoses predominated in gastrointestinal tumors (58.8 %). Complications occurred in 17.6 % (10.2 % bleeding, 7.4 % recurrent VTE). Recurrence was highest in gastrointestinal cancers (11.4 %, Gray's p = 0.022), while bleeding did not differ (p = 0.213). VTE-related mortality was low (1 %), while mixed-cause mortality was highest in lung cancer (17.2 %). Median PFS and OS were shortest in lung cancer (4.5 and 7.7 months, p < 0.0001). Incidental asymptomatic events conferred longer survival, particularly in lung cancer (OS 11.5 vs. 7.3 months for symptomatic incidental and 5.6 for suspected, p < 0.001).\n\nCONCLUSION: VTE in lung cancer is associated with more severe presentation, higher mixed-cause mortality, and worse survival than in other tumors. Incidental asymptomatic VTE predicts better outcomes, supporting risk stratification by tumor type and presentation."
    },
    {
      "pmid": "41108995",
      "doi": "10.1016/j.suronc.2025.102309",
      "title": "Mediastinal staging with video-assisted mediastinoscopic lymphadenectomy after endobronchial ultrasound-guided transbronchial needle aspiration: real-world evidence in 228 patients.",
      "journal": "Surgical oncology",
      "pubdate": "2025-12-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Preclinical",
      "is_oa": false,
      "oa_url": null,
      "metric_name": "SJR",
      "metric_value": 0.792,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41108995/",
      "url_doi": "https://doi.org/10.1016/j.suronc.2025.102309",
      "abstract": "BACKGROUND: Accurate staging of mediastinal lymph nodes in patients with non-small-cell lung cancer (NSCLC) is essential to determine further management. Current guidelines recommend confirmatory mediastinoscopy for patients with suspicious mediastinal lymph node metastases in image-based staging but negative findings on endobronchial ultrasound-guided transbronchial needle aspiration (EBUS-TBNA). In clinical practice, adherence to these recommendations is low and many physicians omit invasive surgical staging. This study aimed to assess the results of subsequent video-assisted mediastinoscopic lymphadenectomy (VAMLA).\n\nMETHODS: Retrospective single-center cohort analysis of patients who underwent surgery between 2015 and 2019. All patients were diagnosed with potentially resectable lung cancer or FDG-avid pulmonary nodule suspicious for NSCLC and underwent VAMLA following N0-N2 EBUS-TBNA for mediastinal staging.\n\nRESULTS: VAMLA was performed in 228 patients. Nodal upstaging after EBUS-TBNA occurred in 17.5 % of the cases (n = 40). During EBUS-TBNA, 1.72 (±1.06) lymph node stations were sampled, compared to 5.59 (±1.1) resected stations in VAMLA (p < 0.001). Clinical nodal status staged by PET/CT was significantly correlated with the occurrence of nodal upstaging by VAMLA, with an odds ratio of 7.69 in cN2 and 5.88 in patients with cN3, compared to cN0. Complications occurred in 8 patients (3.59 %). VAMLA was false negative in 1 patient (0.4 %).\n\nCONCLUSION: Subsequent VAMLA enables the accurate staging of patients after negative EBUS-TBNA. Overall, 17.5 % of cases had nodal upstaging and would otherwise not have received guideline-compliant treatment for NSCLC. These results underline the role of surgical mediastinal staging after negative EBUS-TBNA in patients with suspicious radiologic findings."
    },
    {
      "pmid": "41275531",
      "doi": "10.1016/j.resinv.2025.11.011",
      "title": "Incidence and clinical features of venous thromboembolism in patients with lung cancer in Japan: results from the CS-Lung-003 prospective observational registry study.",
      "journal": "Respiratory investigation",
      "pubdate": "2025-11-22T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": "Prospective (non-RCT)",
      "study_class": "Prospective",
      "is_oa": true,
      "oa_url": "https://doi.org/10.1016/j.resinv.2025.11.011",
      "metric_name": "SJR",
      "metric_value": 0.584,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41275531/",
      "url_doi": "https://doi.org/10.1016/j.resinv.2025.11.011",
      "abstract": "BACKGROUND: Venous thromboembolism (VTE) is a frequent complication of cancer-associated thrombosis, and its management is critical when considering cancer treatment selection and prognosis. The aim of this study was to investigate the incidence and risk factors for VTE in patients with lung cancer using the CS-Lung003 platform, a multicenter prospective observational study of advanced lung cancer.\n\nMETHODS: Patients with a pathologic diagnosis of lung cancer at any stage were included. The incidence of VTE was calculated using the CS-Lung003 database, and risk factors were examined using logistic regression analysis.\n\nRESULTS: The analysis included 1744 patients (80 % male). Sixty patients (3.4 %) had VTE at/after enrollment in the CS-Lung003 trial. The median age was 69 years (range 63-76) in the group without VTE and 72 years (range 67-77) in the group with VTE. Adenocarcinoma was diagnosed in 58.7 % of patients in the group without VTE and 46.7 % in the group with VTE. Univariate analysis revealed male sex, body weight, and hypertension as risk factors for VTE. Overall survival was 29.1 months in the group without VTE and 30.6 months in the group with VTE. Among patients with stage IIIB-IV, the VTE group showed significantly longer overall survival compared with the non-VTE group (p = 0.041).\n\nCONCLUSIONS: The incidence of VTE in this study was low, suggesting that there may have been patients with VTE complications that were not reported in the registry. In addition, most patients with VTE received therapeutic intervention; appropriate diagnosis and treatment may have allowed cancer treatment to continue. Appropriate diagnosis and treatment of VTE might allow lung cancer therapy continuation without compromising survival.\n\nCLINICAL TRIAL REGISTRY/REGISTRATION NUMBER: UMIN-CTR/UMIN000026696."
    },
    {
      "pmid": "41217067",
      "doi": "10.1080/20565623.2025.2578145",
      "title": "Plain language summary of the ALINA study results: alectinib compared with chemotherapy after surgery in people with ALK-positive non-small cell lung cancer.",
      "journal": "Future science OA",
      "pubdate": "2025-12-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://doi.org/10.1080/20565623.2025.2578145",
      "metric_name": "SJR",
      "metric_value": 0.536,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41217067/",
      "url_doi": "https://doi.org/10.1080/20565623.2025.2578145",
      "abstract": null
    },
    {
      "pmid": "41268710",
      "doi": "10.1080/14796694.2025.2586004",
      "title": "Datopotamab deruxtecan versus docetaxel for non-small cell lung cancer: a plain language summary of the TROPION-Lung01 study.",
      "journal": "Future oncology (London, England)",
      "pubdate": "2025-11-21T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41268710/",
      "url_doi": "https://doi.org/10.1080/14796694.2025.2586004",
      "abstract": null
    },
    {
      "pmid": "41274414",
      "doi": "10.1016/j.jtho.2025.11.012",
      "title": "Brief Report: Alectinib with salvage platinum-taxane chemotherapy in a pregnant woman with ALK-rearranged NSCLC and rapid disease progression followed by a successful pregnancy.",
      "journal": "Journal of thoracic oncology : official publication of the International Association for the Study of Lung Cancer",
      "pubdate": "2025-11-20T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41274414/",
      "url_doi": "https://doi.org/10.1016/j.jtho.2025.11.012",
      "abstract": "INTRODUCTION: Anaplastic lymphoma kinase (ALK)-rearranged non-small cell lung cancer (NSCLC) is a distinct molecular subtype that disproportionally affects younger never-smoking females, which overlaps with the reproductive age group. Alectinib is a second-generation ALK inhibitor, and is generally considered a safer option during pregnancy compared to lorlatinib. Here, we describe a case of a patient who became pregnant whilst on alectinib complicated by rapid disease progression, with a focus on maternal-fetal outcomes and placental health.\n\nMETHODS: A brief report was conducted detailing clinical management by a multidisciplinary team, pharmacokinetic analysis of alectinib levels, and post-delivery placental examination, including histopathology and mitochondrial respirometry function assessment as an indicator of placental health.\n\nRESULTS: A 29 year-old woman with metastatic ALK-rearranged NSCLC, became pregnant whilst on alectinib therapy. At 24 weeks of gestation, she experienced rapid systemic disease progression manifesting as marantic endocarditis with multi-territory small cerebral infarcts, thrombocytopaenia, an elevated D-dimer and developed two large middle cerebral ischaemic strokes requiring endovascular clot retrieval. Carboplatin and paclitaxel chemotherapy was added to alectinib. The patient responded well to treatment and successfully delivered an infant via elective caesarean section at 34+5 weeks. The patient was switched to lorlatinib plus pemetrexed postpartum. Although she achieved a complete metabolic response with lorlatinib plus pemetrexed, disease progression occurred several months later, and she died 28 months after initial diagnosis. Placental analysis showed features indicative of fetal growth restriction (FGR). Mitochondrial function appeared within normal limits, despite changes in placental morphology. The infant has shown normal development at 9 months of age.\n\nCONCLUSIONS: This is the first reported case of concurrent alectinib and cytotoxic chemotherapy during pregnancy, successfully used in the setting of progressive ALK-rearranged NSCLC. The placental findings align with observations in pregnancies complicated by FGR. This case highlights the potential feasibility and safety of intensification of systemic therapy during pregnancy, and underscores the importance of individualised multi-disciplinary care."
    },
    {
      "pmid": "41259771",
      "doi": "10.1056/NEJMc2513316",
      "title": "Neoadjuvant Nivolumab plus Chemotherapy in Lung Cancer. Reply.",
      "journal": "The New England journal of medicine",
      "pubdate": "2025-11-20T00:00:00+00:00",
      "pubtypes": [
        "Letter",
        "Comment"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41259771/",
      "url_doi": "https://doi.org/10.1056/NEJMc2513316",
      "abstract": null
    },
    {
      "pmid": "41082707",
      "doi": "10.1200/JCO-25-00036",
      "title": "Simultaneous Durvalumab and Platinum-Based Chemoradiotherapy in Unresectable Stage III Non-Small Cell Lung Cancer: The Phase III PACIFIC-2 Study.",
      "journal": "Journal of clinical oncology : official journal of the American Society of Clinical Oncology",
      "pubdate": "2025-11-20T00:00:00+00:00",
      "pubtypes": [
        "Journal Article",
        "Randomized Controlled Trial",
        "Multicenter Study"
      ],
      "entity": "NSCLC",
      "trial_type": "RCT",
      "study_class": "Prospective",
      "is_oa": true,
      "oa_url": "https://doi.org/10.1200/jco-25-00036",
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41082707/",
      "url_doi": "https://doi.org/10.1200/JCO-25-00036",
      "abstract": "PURPOSE: Immunotherapy targeting PD-L1 improves outcomes in patients with unresectable stage III non-small cell lung cancer (NSCLC) and no progression after definitive, concurrent chemoradiotherapy (cCRT). Earlier administration of immunotherapy, simultaneously with cCRT, may improve outcomes further.\n\nMETHODS: Eligible patients were randomly assigned (2:1) to receive either durvalumab or placebo administered from the start of cCRT. Patients without progression after completing cCRT received consolidation durvalumab or placebo (per initial random assignment) until progression. The primary end point was progression-free survival (PFS) by blinded independent central review. Key secondary end points included objective response rate (ORR), overall survival (OS), the proportion of patients alive at 24 months (OS24), and safety.\n\nRESULTS: In total, 328 patients were randomly assigned to receive durvalumab (n = 219) or placebo (n = 109). There was no statistically significant difference with durvalumab versus placebo in PFS (hazard ratio [HR], 0.85 [95% CI, 0.65 to 1.12];\n\nCONCLUSION: Among patients with unresectable stage III NSCLC, durvalumab administered from the start of cCRT failed to demonstrate additional benefit compared with cCRT plus placebo. Consolidation durvalumab following definitive cCRT remains the standard of care in this setting."
    },
    {
      "pmid": "41270901",
      "doi": "10.1016/j.modpat.2025.100938",
      "title": "A Comprehensive Mutational and Histopathological Analysis of STK11-Mutant Non-Small Cell Lung Carcinomas.",
      "journal": "Modern pathology : an official journal of the United States and Canadian Academy of Pathology, Inc",
      "pubdate": "2025-11-19T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://doi.org/10.1016/j.modpat.2025.100938",
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41270901/",
      "url_doi": "https://doi.org/10.1016/j.modpat.2025.100938",
      "abstract": "Despite recent advances in the understanding of genomic and immunopathologic mechanisms of lung cancer, this disease remains the leading cause of cancer-related deaths in the United States. STK11 (LKB1) mutations are present in approximately 20% of non-small cell lung cancers (NSCLCs) and drive tumor progression through disruption of cellular metabolism, polarity, and stress responses ultimately leading to immune evasion and resistance to cancer therapy. Although these tumors are associated with poor prognoses, the clinicopathologic significance of different STK11 mutation subtypes and their associations with tumor histology, cellular behaviors, metastatic potential, and clinical outcomes remain incompletely understood. In this study, we retrospectively analyze a large cohort of STK11-mutant and STK11 wild-type NSCLCs using a combination of next generation sequencing, immunologic biomarkers, histopathologic characterization, and radiographic imaging. Overall, we demonstrate that STK11-mutant tumors display diverse molecular and morphologic features and are associated with high rates of aggressive histopathologic growth patterns, lymphovascular invasion, and spread through the airspaces (STAS). Among Stage 4 cases, STK11 mutations have notable differences in organotropism, with the STK11-loss cohort in particular demonstrating the highest rates of brain metastases at the time of initial diagnosis. Furthermore, among Stage 4 cases, while all STK11 mutation types result in decreased overall survival probability compared to the STK11 wild-type cohort, the effect appears most pronounced among the STK11-loss/KRAS-mutant group. These findings underscore the heterogeneity of STK11-mutant NSCLCs and highlight the opportunity for further investigation into specific STK11 mutation subtypes in guiding prognosis and therapeutic decision making for individuals with lung cancer."
    },
    {
      "pmid": "41270639",
      "doi": "10.1016/j.lungcan.2025.108845",
      "title": "First-line treatment in EGFR-mutated non-small cell lung cancer: brief report of an individual patient data comparison of phase 3 clinical trials.",
      "journal": "Lung cancer (Amsterdam, Netherlands)",
      "pubdate": "2025-11-19T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://doi.org/10.1016/j.lungcan.2025.108845",
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41270639/",
      "url_doi": "https://doi.org/10.1016/j.lungcan.2025.108845",
      "abstract": "INTRODUCTION: Clinical trials evaluated the efficacy and safety of novel first-line treatment strategies for advanced epidermal growth factor receptor (EGFR)-mutated non-small cell lung cancer (NSCLC), relative to osimertinib monotherapy.\n\nMETHODS: After review of the literature, we performed an individual patient data comparison of efficacy and safety of investigational regimens from phase 3 randomized controlled trials in untreated EGFR-mutated NSCLC.\n\nRESULTS: Two studies were included in the analysis: FLAURA2 and MARIPOSA, evaluating the osimertinib-chemotherapy and amivantamab-lazertinib combinations, respectively. In progression free survival (PFS), there was a statistically significant difference favoring the FLAURA2 in the intent-to-treat (ITT) population [Hazard ratio (HR) 0.79], not confirmed in the overall survival (OS) analysis where we did not find any significant difference. FLAURA2 PFS was longer in patients with central nervous system (CNS) metastases (HR 0.63), without liver metastases (HR 0.73), and with EGFR L858R (HR 0.68). In intracranial PFS (icPFS), there was a statistically significant difference favoring the FLAURA2 (HR 0.52). We found no differences in PFS in patients without CNS metastases, and with exon 19 deletions. No new safety signals resulted from the safety analysis. In FLAURA2, anemia, diarrhea, and neutropenia were more frequent, while in MARIPOSA rash and paronychia.\n\nCONCLUSION: In the ITT population, we found no differences in OS between amivantamab-lazertinib and osimertinib-chemotherapy, despite a slightly higher PFS of the latter. Osimertinib-chemotherapy could be more effective in patients with CNS metastases, without liver metastases, and EGFR L858R mutation, however we could not compare OS in these subgroups. Due to the indirect nature of the comparison and the limitation of the methods our results are not definitive, but rather hypothesis-generating. Other factors must be considered in the choice of the treatment, including patient's characteristics, the safety profile of the combinations, and center's facilities and expertise."
    },
    {
      "pmid": "41265379",
      "doi": "10.1016/j.lungcan.2025.108847",
      "title": "Long-term outcomes of Extensive-Stage small cell lung cancer treated with chemotherapy or Chemo-immunotherapy: A propensity score adjusted cohort study.",
      "journal": "Lung cancer (Amsterdam, Netherlands)",
      "pubdate": "2025-11-19T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "SCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41265379/",
      "url_doi": "https://doi.org/10.1016/j.lungcan.2025.108847",
      "abstract": "BACKGROUND: Combining atezolizumab with carboplatin plus etoposide (Carbo-E) improved overall survival (OS) in patients with extensive-stage small cell lung cancer (ES-SCLC). However, there is a paucity of real-world outcomes. We present the largest and longest follow-up retrospective study evaluating treatment outcomes in ES-SCLC.\n\nMETHODS: We conducted a retrospective cohort study to compare response rate, OS, and progression-free survival (PFS) in patients with ES-SCLC who received Carbo-E, Carbo-E and atezolizumab (Carbo-E-Atezo), and cisplatin and etoposide (Cis-E). We included all adult patients (≥ 18 years) treated at Cleveland Clinic between 1/2010-12/2022. Propensity score (PS) weighting and multivariable Cox proportional hazards regression adjusted for confounders.\n\nRESULTS: Among 602 ES-SCLC patients, 375 (62 %) received Carbo-E, 160 (27 %) received Carbo-E-Atezo, and 67 (11 %) received Cis-E. The median age was 67, 65, and 59 years, respectively. The median follow-up among survivors was 23.9 months (IQR: 13.3---57.3). Five-year unadjusted OS was 4.5 % (Carbo-E), 7 % (Carbo-E-Atezo), and 5.2 % (Cis-E). Carbo-E-Atezo was associated with a longer PS-adjusted median OS than Carbo-E (9.1 vs. 8.2 months, P = 0.039), but no difference was seen in PFS (5.5 vs. 5.5, P = 0.09) or response rate (P > 0.9). Compared to Carbo-E, Cis-E showed higher response rates (OR: 1.67, P = 0.03) but no improvement in OS (11 vs 8.3 months, P = 0.067) or PFS (7.7 vs. 5.5 months, P = 0.058). Cis-E did not differ significantly from Carbo-E-Atezo in response rate, OS, or PFS.\n\nCONCLUSION: Long-term outcomes in ES-SCLC remain poor. Atezolizumab added to Carbo-E modestly improved OS but not PFS. Cisplatin-based regimens increased response rates but did not improve survival."
    }
  ]
}