{
  "generated": "2025-09-09T07:39:51.002580Z",
  "items": [
    {
      "pmid": "40906489",
      "doi": "10.1001/jamaoncol.2025.2891",
      "title": "Current Controversies and Challenges in Non-Oncogene-Addicted Synchronous Oligometastatic Non-Small Cell Lung Cancer: A Review.",
      "journal": "JAMA oncology",
      "pubdate": "2025-09-04T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Other",
      "category_key": "lc",
      "category_label": "Lungenkrebs – Studien",
      "is_oa": false,
      "oa_url": null,
      "metric_name": "SJR",
      "metric_value": 6.1,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40906489/",
      "url_doi": "https://doi.org/10.1001/jamaoncol.2025.2891",
      "abstract": "IMPORTANCE: It has been stated that especially with the advancements in imaging, systemic therapy, and local radical treatment (LRT) that patients with synchronous oligometastatic disease (sOMD) can potentially benefit from curative-intent treatment. This statement is challenged by the results of the NRG-LU002 randomized phase 2/3 trial, showing no significant progression-free survival and overall survival improvements with the addition of LRT to maintenance systemic therapy in patients with oligometastatic non-small cell lung cancer (NSCLC) who achieved at least stable disease after induction systemic therapy (approximately 90% received an immunotherapy-based regimen). This Review discusses the current challenges and controversies in the treatment of non-oncogene-addicted sOMD.\n\nOBSERVATIONS: Whether LRT indeed can improve survival in a contemporary immunotherapy-based systemic treatment regimen is discussed as well as the optimal treatment sequence. Moreover, the NRG-LU002 trial also sparks debate of whether a true sOMD state exists. Genomic alterations, the tumor microenvironment of the primary tumor and metastasis, organotropism, and tumor heterogeneity can all influence metastatic potential, giving a biological explanation that there could be existence of a true sOMD state. However, as true sOMD cannot be distinguished from early-detected widespread metastatic disease with the current imaging modalities, it becomes difficult to select patients for a radical strategy and protect patients from futile treatment.\n\nCONCLUSIONS AND RELEVANCE: It remains under debate whether synchronous oligometastatic NSCLC represents a distinct biological entity or merely a probabilistic imaging finding. Biomarkers such as circulating tumor DNA, microRNA, and radiomics may improve patient selection but require further validation. Clinical trials should prioritize translational research to address these challenges."
    },
    {
      "pmid": "40906462",
      "doi": "10.1001/jamaoncol.2025.3007",
      "title": "Proton Craniospinal Irradiation for Patients With Leptomeningeal Metastasis: A Randomized Clinical Trial.",
      "journal": "JAMA oncology",
      "pubdate": "2025-09-04T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Other",
      "trial_type": null,
      "study_class": "Other",
      "category_key": "lc",
      "category_label": "Lungenkrebs – Studien",
      "is_oa": false,
      "oa_url": null,
      "metric_name": "SJR",
      "metric_value": 6.1,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40906462/",
      "url_doi": "https://doi.org/10.1001/jamaoncol.2025.3007",
      "abstract": "IMPORTANCE: Leptomeningeal metastasis (LM) is associated with limited survival and few treatment options. Photon involved-field radiotherapy (IFRT) is the most common radiotherapy treatment for patients with LM from solid tumors.\n\nOBJECTIVE: To assess whether proton craniospinal irradiation (pCSI) would result in superior central nervous system progression-free survival (CNS-PFS) compared with IFRT.\n\nDESIGN, SETTING, AND PARTICIPANTS: A randomized, phase 2 trial of pCSI vs IFRT was conducted between April 16, 2020, and October 11, 2021, and included patients with non-small cell lung cancer and breast cancer with LM. Patients with other solid tumors were also enrolled in an exploratory pCSI cohort.\n\nINTERVENTION: For the randomized groups, after stratifying by histology and systemic disease status, patients were assigned (2:1) to pCSI or IFRT.\n\nMAIN OUTCOMES AND MEASURES: The primary end point was CNS-PFS. Secondary end points included overall survival (OS).\n\nRESULTS: Of 98 total patients, 72 individuals (73.5%) were female, and the median (IQR) age was 59 (50-65) years. A total of 42 and 21 patients were randomly assigned to pCSI and IFRT, respectively. At planned interim analysis, a significant benefit in CNS-PFS was observed with pCSI compared with IFRT, leading to the early discontinuation of the trial. In this final analysis, a significant benefit was continually observed in CNS-PFS with pCSI (median, 8.2 months; 95% CI, 6.6-15.3) vs IFRT (median, 2.3 months; 95% CI, 1.2-4.0; P < .001). A statistically significant and clinically meaningful OS benefit with pCSI (median, 11.3 months; 95% CI, 7.5-18.3) vs IFRT (median, 4.9 months; 95% CI, 3.9-15.0; P = .04) was also observed. For the exploratory pCSI cohort (n = 35), the median CNS-PFS was 5.8 months (95% CI, 4.4-9.1) and OS was 7.0 months (95% CI, 5.4-10.6).\n\nCONCLUSIONS AND RELEVANCE: This randomized clinical trial that assessed the optimal radiotherapy treatment for LM found improved CNS-PFS and OS with pCSI compared with IFRT. The results suggest that pCSI should be considered when available.\n\nTRIAL REGISTRATION: ClinicalTrials.gov Identifier: NCT04343573."
    },
    {
      "pmid": "40189749",
      "doi": "10.1080/2162402X.2025.2484880",
      "title": "Surrogate markers of intestinal dysfunction associated with survival in advanced cancers.",
      "journal": "Oncoimmunology",
      "pubdate": "2025-12-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Other",
      "trial_type": null,
      "study_class": "Other",
      "category_key": "lc",
      "category_label": "Lungenkrebs – Studien",
      "is_oa": true,
      "oa_url": "https://doi.org/10.1080/2162402x.2025.2484880",
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40189749/",
      "url_doi": "https://doi.org/10.1080/2162402X.2025.2484880",
      "abstract": "Deviations in the diversity and composition of the gut microbiota are called \"gut dysbiosis\". They have been linked to various chronic diseases including cancers and resistance to immunotherapy. Stool shotgun based-metagenomics informs on the ecological composition of the gut microbiota and the prevalence of homeostatic bacteria such as Akkermansia muciniphila (Akk), while determination of the serum addressin MAdCAM-1 instructs on endothelial gut barrier dysfunction. Here we examined patient survival during chemo-immuno-therapy in 955 cancer patients across four independent cohorts of non-small cell lung (NSCLC), genitourinary (GU) and colorectal (CRC) cancers, according to hallmarks of gut dysbiosis. We show that Akk prevalence represents a stable and favorable phenotype in NSCLC and CRC cancer patients. Over-dominance of Akk above the healthy threshold was observed in dismal prognosis in NSCLC and GU and mirrored an immunosuppressive gut ecosystem and excessive intestinal epithelial exfoliation in NSCLC. In CRC, the combination of a lack of Akk and low sMAdCAM-1 levels identified a subset comprising 28% of patients with reduced survival, independent of the immunoscore. We conclude that gut dysbiosis hallmarks deserve integration within the diagnosis toolbox in oncological practice."
    },
    {
      "pmid": "40168159",
      "doi": "10.1080/17581966.2025.2477411",
      "title": "The association between blood-based HYAL2 methylation and early-stage lung cancer: a case-control study.",
      "journal": "Lung cancer management",
      "pubdate": "2025-12-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "category_key": "lc",
      "category_label": "Lungenkrebs – Studien",
      "is_oa": true,
      "oa_url": "https://doi.org/10.1080/17581966.2025.2477411",
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40168159/",
      "url_doi": "https://doi.org/10.1080/17581966.2025.2477411",
      "abstract": "BACKGROUND: Blood-based DNA methylation biomarkers have great potential for the early detection of lung cancer (LC). Here, we investigated the association between HYAL2 methylation in peripheral blood and LC.\n\nMETHODS: Matrix-assisted laser desorption ionization time-of-flight (MALDI-TOF) mass spectrometry was performed to measure the methylation levels of 4 CpG sites in HYAL2 gene in two independent case-control studies (168 LC cases and 167 controls in Study I, 677 LC cases and 833 controls in Study II). Logistic regression adjusted for covariates was conducted for odds ratios (ORs) and 95% confidence intervals (CIs). Non-parametric tests were applied for the comparisons of stratified groups.\n\nRESULTS: Hypomethylation of all 4 CpG sites in HYAL2 was associated with early-stage LC in the two studies (ORs range from 1.91 to 3.07 in Study I, ORs range from 1.39 to 1.86 in Study II, p < 0.05 for all). The associations were still significant for the very early-stage LC patients (stage I). Subgroup analysis indicated that the associations could be enhanced by male gender and older age. Moreover, decreased HYAL2 methylation was correlated with increased tumor size, tumor length and stage.\n\nCONCLUSIONS: Our results suggested blood-based HYAL2 hypomethylation as a potential biomarker for LC early detection."
    },
    {
      "pmid": "40684711",
      "doi": "10.1016/j.ejrad.2025.112290",
      "title": "Comparison of nodule volumetric classification by using two different nodule segmentation algorithms in an LDCT lung cancer baseline screening dataset.",
      "journal": "European journal of radiology",
      "pubdate": "2025-10-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "category_key": "lc",
      "category_label": "Lungenkrebs – Studien",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40684711/",
      "url_doi": "https://doi.org/10.1016/j.ejrad.2025.112290",
      "abstract": "OBJECTIVES: To investigate the performance of two segmentation algorithms for nodule volumetric classification at participant/scan level in the NELCIN-B3 cohort (Netherlands and China Big-3), a lung cancer screening program (LCS) using low-dose CT (LDCT).\n\nMETHODS: Baseline scans with qualified LDCT images from consecutive NELCIN-B3 participants were included from June 2017 to July 2018. Performance of two software algorithms were independently evaluated by two radiologists: software A (Syngo.via VB30A) by reader 1 and software B (AVIEW v1.1.39.14) by reader 2. According to the NELSON2.0 protocol, nodules with a solid component ≥ 100 mm3 were classified as indeterminate-positive, while all other nodules were classified as negative. Disagreements in classification were resolved by consensus with three senior radiologists. These results served as a reference standard for identifying positive misclassifications (PM) and negative misclassifications (NM).\n\nRESULTS: In total, 300 participants were evaluated comprising 159 women (53.0 %) and 193 (64.3 %) never smokers, with a mean ± standard deviation age of 61.2 ± 7.1 years. There were disagreements in 17 cases: in 11 (11/300, 3.7 %), this was due to differences in nodule selection and nodule type classification between readers; and in 6 (6/300, 2.0 %), this was due to variations in nodule volume metrics between algorithms. Inter-software agreement was almost perfect (κ = 0.88 [95 %CI: 0.83-0.93]). In the consensus read, reader 1/software A generated 12 misclassifications (11 PM, 1 NM), giving a negative predictive value of 99.6 % (95 % CI: 98.9 %-100.0 %). Reader 2/software B generated 5 misclassifications (2 PM, 3 NM), giving a negative predictive value of 98.9 % (95 % CI: 97.7 %-100.0 %).\n\nCONCLUSION: Two software algorithms (Syngo.via VB30A and AVIEW v1.1.39.14) showed comparable performance for lung nodule volumetric classification at participant/scan level. Further research is needed to confirm the results in other LDCT LCS programs."
    },
    {
      "pmid": "40730077",
      "doi": "10.1016/j.ejca.2025.115624",
      "title": "Subcutaneous versus intravenous amivantamab, both in combination with lazertinib, in refractory EGFR-mutated non-small cell lung cancer: Patient satisfaction and resource utilization results from the PALOMA-3 study.",
      "journal": "European journal of cancer (Oxford, England : 1990)",
      "pubdate": "2025-09-09T00:00:00+00:00",
      "pubtypes": [
        "Journal Article",
        "Randomized Controlled Trial",
        "Multicenter Study"
      ],
      "entity": "NSCLC",
      "trial_type": "RCT",
      "study_class": "Prospective",
      "category_key": "lc",
      "category_label": "Lungenkrebs – Studien",
      "is_oa": true,
      "oa_url": "https://www.ejcancer.com/article/S0959-8049(25)00406-X/pdf",
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40730077/",
      "url_doi": "https://doi.org/10.1016/j.ejca.2025.115624",
      "abstract": "INTRODUCTION: Intravenous anticancer treatments present challenges for patients and healthcare professionals (HCPs), prompting the development of subcutaneous formulations. In the phase 3 PALOMA-3 study, subcutaneous amivantamab demonstrated noninferior pharmacokinetics and response rates versus intravenous amivantamab (both with lazertinib), with substantially faster administration, a 5-fold reduction in infusion-related reactions, reduced venous thromboembolism, and numerically prolonged survival.\n\nMETHODS: Participants with EGFR-mutated NSCLC and progression on osimertinib and chemotherapy were randomized to subcutaneous (n = 206) or intravenous amivantamab (n = 212), plus lazertinib. Resource utilization and participant-reported treatment satisfaction were evaluated at cycle (C) 1 day (D) 1 and C3D1.\n\nRESULTS: Time-in-chair was substantially lower for subcutaneous versus intravenous amivantamab (C1D1: median [range], 23 min or 0.4 h [0-12.0 h] vs 6.5 h [0-24.0 h]; C3D1: 35 min or 0.6 h [0-6.6 h] vs 3.4 h [0.5-9.0 h]), as were HCP time and participant time-in-room. More participants who received subcutaneous versus intravenous amivantamab reported feeling unrestricted (C1D1, 66 % vs 29 %; C3D1, 60 % vs 42 %) or unbothered (C1D1, 69 % vs 30 %; C3D1, 71 % vs 45 %) by administration, and reported gaining time for other activities (C1D1, 36 % vs 7 %; C3D1, 37 % vs 6 %). Few participants who received subcutaneous amivantamab reported moderate-to-very severe injection-site pain (C1D1, 14 %; C3D1, 16 %), swelling (C1D1, 5 %; C3D1, 6 %), or redness (C1D1, 5 %; C3D1, 6 %). Most subcutaneous amivantamab recipients preferred and were more satisfied with its administration versus historical experience with intravenous therapies and would recommend it.\n\nCONCLUSIONS: In PALOMA-3, subcutaneous amivantamab, which simplifies and shortens administration, reduces resource utilization, and enhances treatment experience, was a preferred option for patients who received amivantamab-lazertinib."
    },
    {
      "pmid": "40920097",
      "doi": "10.1158/2159-8290.CD-25-0526",
      "title": "An Autochthonous Model of Lung Cancer Identifies Requirements for Cellular Transformation in the Naked Mole-Rat.",
      "journal": "Cancer discovery",
      "pubdate": "2025-09-08T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Preclinical",
      "category_key": "lc",
      "category_label": "Lungenkrebs – Studien",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40920097/",
      "url_doi": "https://doi.org/10.1158/2159-8290.CD-25-0526",
      "abstract": "There is growing interest in understanding the mechanisms underlying differences in cancer incidence among species (comparative oncology). The naked mole-rat (NMR) is often referenced as \"cancer-resistant\" and prior studies focused on identifying mechanisms explaining this. However, efforts to assess this in vivo have been limited. Herein, we provide evidence that the NMR presents as a novel autochthonous model of lung tumor initiation, driven by an introduction of the oncogenic Eml4-Alk fusion protein using CRISPR-mediated genome editing. Whereas in mice the inversion alone is sufficient to drive tumorigenesis, the inversion alone was insufficient to drive tumorigenesis in the NMR lung and tumor development required additional losses of the tumor suppressors p53 and pRb. Our findings suggest that the proposed \"resistance\" of the NMR to the development of cancer may reflect that the genetic events leading to tumor initiation are likely to be comparable to those present in human cells."
    },
    {
      "pmid": "40916834",
      "doi": "10.1093/cei/uxaf050",
      "title": "Expanded senescent CD8 T-cells in IMID patients are associated with distinct inflammatory cytokines.",
      "journal": "Clinical and experimental immunology",
      "pubdate": "2025-09-06T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Other",
      "trial_type": null,
      "study_class": "Other",
      "category_key": "lc",
      "category_label": "Lungenkrebs – Studien",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40916834/",
      "url_doi": "https://doi.org/10.1093/cei/uxaf050",
      "abstract": "INTRODUCTION: Immunosenescence remodels immune functions and was first described with aging. It is present in 25% of cancer patients but has also been described in patients with Immune-mediated inflammatory diseases (IMIDs). This study aims at quantifying cells exhibiting a phenotype of senescence in CD4+ (T4sen) and CD8+ (T8sen) T cells, analyzing its potential drivers and the effect of anti-TNF treatment in a prospective cohort of patients with rheumatoid arthritis (RA), spondyloarthritis (SpA) and Sjögren disease (SjD).\n\nMETHODS: Using flow cytometry, we assessed circulating T4sen and T8sen proportions at baseline and three months after initiating anti-TNF treatment in RA and SpA patients using flow cytometry. Circulating levels of cytokines were measured at baseline. These parameters were associated with demographic variables and disease activity. T4sen and T8sen were compared between RA, SpA, SjD, healthy donors and cancer patients.\n\nRESULTS: T8sen but not T4sen accumulated more in patients with IMIDs than in patients with lung cancer and healthy donors. CMV-seropositivity was associated with the accumulation of T8sen. T8sen were associated with high IL-6 in SpA patients and high IP10 in SjD patients. Anti-TNF did not impact the T8sen proportion of RA and SpA patients. There was a trend toward an increase of T8sen in anti-TNF non-responders after three months of treatment.\n\nCONCLUSION: Senescent CD8 T cells are enriched in IMID patients, suggesting that immune aging is a shared feature of chronic inflammatory diseases. The association between T8sen and distinct inflammatory cytokines underscores the potential role of senescence in shaping immune responses in IMIDs."
    },
    {
      "pmid": "40911432",
      "doi": "10.1158/1078-0432.CCR-25-2090",
      "title": "Seizure-Related Homolog Protein 6 (SEZ6): Biology and Therapeutic Target in Neuroendocrine Carcinomas.",
      "journal": "Clinical cancer research : an official journal of the American Association for Cancer Research",
      "pubdate": "2025-09-05T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Other",
      "trial_type": null,
      "study_class": "Other",
      "category_key": "lc",
      "category_label": "Lungenkrebs – Studien",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40911432/",
      "url_doi": "https://doi.org/10.1158/1078-0432.CCR-25-2090",
      "abstract": "Seizure-related homolog protein 6 (SEZ6) is a cell surface type 1 transmembrane protein involved in neuronal development, expression of which in adult tissues is almost exclusively limited to the central nervous system. Aberrant expression of SEZ6 has been associated with neurodevelopmental and psychiatric disorders including epilepsy, schizophrenia, and Alzheimer's disease. More recently, SEZ6 overexpression has been detected in small cell lung cancer (SCLC) and other high-grade neuroendocrine malignancies, although our understanding of the function of SEZ6 as a driver of cancer is limited. A lineage-defining transcription factor of SCLC, ASCL1, has been implicated as a regulator of SEZ6 expression. SEZ6 has emerged as a novel target for antibody-drug conjugate (ADC) therapy, and early studies have shown promising antitumor activity, demonstrating the potential for SEZ6 to be targeted by drugs with alternate mechanisms of action. Here, we review the current knowledge of the biology of SEZ6 and its implications in malignancy, summarize the preclinical and clinical findings of SEZ6 targeted ADCs, and discuss future directions to further elucidate the role of SEZ6 in SCLC and other neuroendocrine neoplasms."
    },
    {
      "pmid": "40910999",
      "doi": "10.1080/14712598.2025.2555830",
      "title": "Neoadjuvant therapy of NSCLC: a review of the use and impact of monoclonal antibodies.",
      "journal": "Expert opinion on biological therapy",
      "pubdate": "2025-09-05T00:00:00+00:00",
      "pubtypes": [
        "Journal Article",
        "Review"
      ],
      "entity": "NSCLC",
      "trial_type": "Review/Meta",
      "study_class": "Review",
      "category_key": "lc",
      "category_label": "Lungenkrebs – Studien",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40910999/",
      "url_doi": "https://doi.org/10.1080/14712598.2025.2555830",
      "abstract": "INTRODUCTION: From the 1960s and up until 2021, neoadjuvant chemotherapy has represented the standard of care for potentially resectable stage III (N2) Non-Small Cell Lung Cancer (NSCLC). However, in recent years, immunotherapy in the form of Immune Checkpoint Inhibitors (ICIs) has revolutionized oncology treatment strategies and several ICIs have been investigated for the neoadjuvant treatment of NSCLC, both in monotherapy and in combination with other ICIs or chemotherapy.\n\nAREAS COVERED: Therefore, this paper aims to review the currently available data supporting the role of immunotherapy in the neoadjuvant setting, as well as to discuss the challenges associated with it. We undertook a comprehensive literature search of PubMed, Embase, Cochrane Library, of abstracts and posters from annual meetings of American Society of Clinical Oncology (ASCO), European Society for Medical Oncology (ESMO) and American Association for Cancer Research (AACR) up until November 2024.\n\nEXPERT OPINION: We believe that in a near future ICI plus chemotherapy combinations will represent the new recommended standard of care in the neoadjuvant/perioperative setting. We look forward to the full results coming from the ongoing randomized phase III trials, that will help us guide our choice in terms of patient selection, regimen of choice and response assessment."
    },
    {
      "pmid": "40908346",
      "doi": "10.1007/s40487-025-00372-0",
      "title": "Asian Subgroup Analysis of Patients in the Phase 2 DeLLphi-301 Study of Tarlatamab for Previously Treated Small Cell Lung Cancer.",
      "journal": "Oncology and therapy",
      "pubdate": "2025-09-04T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "SCLC",
      "trial_type": null,
      "study_class": "Other",
      "category_key": "lc",
      "category_label": "Lungenkrebs – Studien",
      "is_oa": true,
      "oa_url": "https://link.springer.com/content/pdf/10.1007/s40487-025-00372-0.pdf",
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40908346/",
      "url_doi": "https://doi.org/10.1007/s40487-025-00372-0",
      "abstract": "INTRODUCTION: Tarlatamab is a bispecific T-cell engager (BiTE®) immunotherapy that binds delta-like ligand 3 on the surface of small cell lung cancer (SCLC) cells and CD3 on T cells, facilitating T cell-mediated cancer cell lysis. In the primary analysis of the phase 2 DeLLphi-301 study (NCT05060016), tarlatamab showed a favourable benefit-to-risk profile with durable objective responses and promising survival outcomes in patients with previously treated SCLC. Here, phase 2 data for the Asia region subgroup are presented.\n\nMETHODS: Patients with previously treated, advanced SCLC received 10 mg tarlatamab every 2 weeks. The primary endpoint was objective response rate (ORR) by blinded independent central review (RECIST version 1.1). Key secondary endpoints included duration of response (DOR), progression-free survival (PFS), overall survival (OS) and safety. The present analysis includes patients enrolled at sites in Asia.\n\nRESULTS: A total of 43 patients were enrolled at sites in Asia. ORR was 46.3% (95% confidence interval [CI], 30.7-62.6) and median DOR was 7.2 months (95% CI 3.9 to not estimable). The median follow-up was 16.6 months for PFS and 21.2 months for OS. Median PFS was 5.4 months (95% CI 3.0-8.1) and median OS was 19.0 months (95% CI 11.4 to not estimable). The most common treatment-emergent adverse event (AE) was cytokine release syndrome (48.8%), and all such events were grade 1 or 2. There were no discontinuations due to treatment-related AEs.\n\nCONCLUSIONS: Tarlatamab demonstrated durable responses and promising survival outcomes with a manageable safety profile in this post hoc analysis of patients from Asia with previously treated SCLC.\n\nTRIAL REGISTRATION: ClinicalTrials.gov, NCT05060016."
    },
    {
      "pmid": "40914393",
      "doi": "10.1016/j.jtho.2025.08.024",
      "title": "Screening-Detected versus Interval Lung Cancer in the Biennial Korean National Lung Cancer Screening Program: Proportion, Characteristics, and Mortality.",
      "journal": "Journal of thoracic oncology : official publication of the International Association for the Study of Lung Cancer",
      "pubdate": "2025-09-04T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "category_key": "lc",
      "category_label": "Lungenkrebs – Studien",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40914393/",
      "url_doi": "https://doi.org/10.1016/j.jtho.2025.08.024",
      "abstract": "INTRODUCTION: Interval lung cancers (ILCs) are key indicators of lung cancer screening (LCS) performance. However, data on the proportion, characteristics, and mortality of ILCs under biennial screening in Asian populations remain limited.\n\nMETHODS: We analyzed participants from the baseline biennial Korean national LCS program between 2019 and 2020. Screening-detected lung cancers (SLCs) were defined as those diagnosed within 1 year of a positive screening result. ILCs were defined as cancers diagnosed more than 1 year after a negative screening result but within 2 years or before the next screening. Risk factors for ILC were assessed using multivariable logistic regression among participants with a negative screening result. All-cause mortality was compared between SLCs and ILCs using multivariable Cox regression analysis.\n\nRESULTS: Among 124,595 participants, SLCs and ILCs occurred in 0.56% and 0.17%, respectively. ILCs accounted for 18.5% of all lung cancers within 2 years; 65.4% were in Lung-RADS category 1. Risk factors for ILC included older age (adjusted odds ratio [OR], 1.14; 95% CI: 1.11-1.17; P<0.001), greater smoking exposure (adjusted OR, 1.010; 95% CI: 1.004-1.016; P=0.002), a history of malignancy (adjusted OR, 2.22; 95% CI: 1.41-3.51; P<0.001), emphysema (adjusted OR, 2.88; 95% CI: 2.15-3.85; P<0.001), and interstitial lung abnormalities (adjusted OR, 4.16; 95% CI: 2.88-6.01; P<0.001). ILCs showed higher all-cause mortality than SLCs (adjusted hazard ratio, 1.43; 95% CI: 1.13-1.80; P=0.002).\n\nCONCLUSIONS: ILCs are common under biennial LCS, making it potentially suboptimal for Asian heavy smokers."
    },
    {
      "pmid": "40904097",
      "doi": "10.1158/2159-8290.CD-24-1866",
      "title": "Histologic Transformation in Cancer: The Path for Clinical Translation.",
      "journal": "Cancer discovery",
      "pubdate": "2025-09-04T00:00:00+00:00",
      "pubtypes": [
        "Journal Article",
        "Review"
      ],
      "entity": "Other",
      "trial_type": "Review/Meta",
      "study_class": "Review",
      "category_key": "lc",
      "category_label": "Lungenkrebs – Studien",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40904097/",
      "url_doi": "https://doi.org/10.1158/2159-8290.CD-24-1866",
      "abstract": "UNLABELLED: Lineage plasticity, a critical hallmark of cancer progression, enables tumor cells to evade inhibition of primary oncogenic pathways through histologic transformation. This adaptive process, driven by stemness-associated features and epigenetic reprogramming, poses significant challenges in treatment. Using non-small cell lung cancer and prostate cancer as models, we examine the utility of tissue and liquid biopsies in detecting histologic transformations and tailoring treatments to specific subtypes, which has profound clinical implications, potentially improving outcomes in patients with advanced, therapy-resistant disease. We also discuss emerging therapeutic strategies, including novel molecular targets, and address ongoing clinical challenges in managing treatment-emergent histologic transformation.\n\nSIGNIFICANCE: The advent of highly effective molecularly targeted therapies results in increased recognition of treatment-emergent histologic transformation. This review not only summarizes current evidence on diagnosis and management of lineage plasticity but also explores therapeutic strategies under study, outlining a framework for clinical translation and successful drug development."
    },
    {
      "pmid": "40912643",
      "doi": "10.1016/j.avsg.2025.08.029",
      "title": "Temporal Patterns and Risk Factors for Pulmonary Embolism Associated with Anti-Tumor Therapies in Patients with Lung Cancer.",
      "journal": "Annals of vascular surgery",
      "pubdate": "2025-09-03T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "category_key": "vte",
      "category_label": "VTE & Lungenkrebs – News",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40912643/",
      "url_doi": "https://doi.org/10.1016/j.avsg.2025.08.029",
      "abstract": "OBJECTIVE: This study aimed to characterize the association between pulmonary embolism (PE) onset and various anti-tumor therapeutic approaches in patients with lung cancer, with the goal of identifying potential high-risk populations.\n\nMETHODS: A retrospective analysis was conducted on clinical records from 2019 to 2025, among the 84,000 inpatients with lung cancer, 106 patients developed PE during hospitalization for anti-tumor treatment, who were confirmed using spiral computed tomography (CT) or pulmonary angiography per CTS (2018) and NEJM (2010) criteria. Data were collected on patient demographics, cancer staging, treatment type, and time to PE onset.\n\nRESULTS: Among patients who developed PE during lung cancer treatment, the mean age was 66.82 ± 10.50 years. Females comprised 64.04% of cases, adenocarcinoma was identified in 60.38%, and stage IV lung cancer was present in 56.60%. First-line therapy was administered in 63.21% of cases, and 66.04% exhibited enlarged mediastinal lymph nodes. The mean D-dimer level among this cohort was 3.559 μg/mL, indicating a heightened thrombotic risk. Temporally, 50.95% of PE cases occurred within six months of lung cancer diagnosis. Onset within three months following therapy initiation was observed across multiple modalities: 46.15% for chemotherapy, 34.78% for targeted therapy, and 77.78% following surgical intervention. Notably, 16.98% of PE events occurred during the initial chemotherapy cycle. The mean time to PE onset was 1.81 ± 2.51 months for patients undergoing surgery alone, compared to 15.52 ± 12.88 months for those receiving surgery combined with other treatments (p < 0.05). Surgical intervention was identified as an independent risk factor for PE. In early-stage lung cancer, the mean time to PE onset was significantly shorter, with a mean time of 16.38 ± 21.07 months (p < 0.05).\n\nCONCLUSION: The timing and incidence of PE vary according to the type of anti-tumor therapy administered in lung cancer treatment. These findings underscore the importance of vigilant monitoring, personalized risk assessment, and targeted anticoagulation strategies throughout the therapeutic course."
    },
    {
      "pmid": "40903476",
      "doi": "10.1038/s41598-025-13368-7",
      "title": "Mendelian randomization analysis of the association between vitamin B12 deficiency anaemia and the risk of developing lung disease.",
      "journal": "Scientific reports",
      "pubdate": "2025-09-03T00:00:00+00:00",
      "pubtypes": [
        "Journal Article",
        "Meta-Analysis"
      ],
      "entity": "Thoracic-other",
      "trial_type": "Review/Meta",
      "study_class": "Review",
      "category_key": "vte",
      "category_label": "VTE & Lungenkrebs – News",
      "is_oa": true,
      "oa_url": "https://www.nature.com/articles/s41598-025-13368-7.pdf",
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40903476/",
      "url_doi": "https://doi.org/10.1038/s41598-025-13368-7",
      "abstract": "The causal relationship between vitamin B12 deficiency anaemia and the risk of developing lung diseases remains unclear. This study aimed to clarify that relationship using Mendelian randomization (MR) with Bayesian weighting, focusing on pulmonary fibrosis (PF), idiopathic PF (IPF), eosinophilic asthma (EA), squamous cell lung cancer (LUSC), chronic obstructive pulmonary disease (COPD), and pulmonary embolism (PE). We analysed genome-wide association study (GWAS) data, applied five MR models with Bayesian methods to assess causality, and validated the results via sensitivity analysis. The MVMR method explores whether vitamin B12-deficient anaemia affects the pathogenesis of IPF independently of BMI. SMR was used to explore IPF-related pathogenesis, whereas a meta-analysis was used to consolidate LUSC MR findings across ethnicities. IVW analysis revealed a positive causal link between vitamin B12 deficiency anaemia status and the risk of developing PF [OR (95% CI) = 1.161 (1.021, 1.319), P = 0.023], IPF [OR (95% CI) = 1.176 (1.002, 1.380), P = 0.047 (Bayesian MR)] and EA [OR (95% CI) = 1.394 (1.084, 1.793), P = 0.010]. The results of the study demonstrate that the development of IPF is influenced by vitamin B12 deficiency independently of BMI. Conversely, vitamin B12 deficiency anaemia status was negatively associated with the development of LUSC [OR (95% CI) = 0.879 (0.760, 0.995), P = 0.001], and no causal association was detected between vitamin B12 deficiency anaemia status and the development of COPD or PE. The reverse MR analysis yielded nonsignificant results. The SMR analysis revealed a significant association between IPF onset and CUBN, a vitamin B12 target. Post-MR meta-analysis confirmed the credibility and homogeneity of these findings. Vitamin B12 deficiency anaemia is causally associated with the development of PF, IPF, and EA but is negatively associated with the development of LUSC. No causality was observed for COPD or PE. Notably, CUBN emerged as a key IPF-related gene, highlighting the intricate relationship between vitamin B12 status and pulmonary health."
    },
    {
      "pmid": "40907070",
      "doi": "10.1016/j.lungcan.2025.108745",
      "title": "Clinical risk factors for developing brain metastases during first-line (chemo-)immunotherapy in patients with non-small cell lung cancer without known baseline brain metastases.",
      "journal": "Lung cancer (Amsterdam, Netherlands)",
      "pubdate": "2025-09-02T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Other",
      "category_key": "lc",
      "category_label": "Lungenkrebs – Studien",
      "is_oa": true,
      "oa_url": "https://doi.org/10.1016/j.lungcan.2025.108745",
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40907070/",
      "url_doi": "https://doi.org/10.1016/j.lungcan.2025.108745",
      "abstract": "BACKGROUND: Brain metastases (BM) are common in non-small cell lung cancer (NSCLC). Although guidelines recommend baseline BM screening in asymptomatic patients, its benefit remains unproven. Routine imaging burdens healthcare systems and patients. Immune checkpoint inhibitors (ICI) show similar intra-and extracranial response percentages, supporting deferral of local BM treatment and possibly screening. However, dissociated responses occur. Therefore, patients newly diagnosed with BM during first-line ICI probably would have benefited most from baseline (and follow-up) screening. Identifying high-risk patients for BM progression or development during first-line ICI-based therapy is crucial to optimize screening.\n\nMETHODS: Retrospective multicenter cohort study of patients with stage IV NSCLC without known baseline BM, treated with first-line (chemo-)ICI between 2018-2021. Incidence, timing, and symptom burden of newly diagnosed BM were analyzed. Cox regression identified predictive factors, and a nomogram was developed.\n\nRESULTS: Among 589 patients, BM were diagnosed during therapy in 9.0 %, 88.7 % occurred within the first year. Most cases (90.6 %) were symptomatic. Four factors predicted higher BM risk: age < 65 years (HR 2.66; 95 % CI: 1.49-4.74), T4 stage (HR 2.08; 95 % CI: 1.18-3.65), M1c stage (HR 2.19; 95 % CI: 1.22-3.94) and PD-L1 < 50 % (HR 2.03; 95 % CI: 1.16-3.54). The nomogram showed good performance (C-index 0.70). Twelve-month cumulative incidence was 11.7 % (95 % CI: 8.5-14.9 %).\n\nCONCLUSION: BM detection during first-line (chemo-)ICI is relatively low in patients with stage IV NSCLC without known baseline BM, but the burden (symptoms) is high. Upon validation, the identified risk factors may support selective brain imaging in high-risk patients, avoiding routine screening in low-risk patients."
    },
    {
      "pmid": "40891208",
      "doi": "10.1158/0008-5472.CAN-25-1989",
      "title": "Another Slice of the Pie Uncovered: RIT1M90I Is an Actionable Driver in Non-Small Cell Lung Cancer.",
      "journal": "Cancer research",
      "pubdate": "2025-09-02T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Other",
      "category_key": "lc",
      "category_label": "Lungenkrebs – Studien",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40891208/",
      "url_doi": "https://doi.org/10.1158/0008-5472.CAN-25-1989",
      "abstract": "Lung adenocarcinoma has become a paradigm for precision oncology and success with targeted therapies. However, large chunks of the pie chart of molecular drivers remain unknown, preventing many patients from similarly benefiting from this strategy. Here, we highlight the side-by-side release of two impactful studies from Mozzarelli and colleagues and DiMarco and colleagues in this issue of Cancer Research. Here, each team generated unique mouse models characterizing a novel and potentially actionable driver and facilitator of acquired drug resistance in lung adenocarcinoma, RIT1M90I. Both study teams describe and characterize their new mouse models, reporting the tumor latency and importantly revealing the sensitivity of RIT1-mutant lung tumors to SHP2 or RAS tricomplex inhibitors. Collectively, these findings highlight the importance of RIT1M90I as an actionable driver of lung adenocarcinoma and a potent mediator of acquired drug resistance. These new RIT1-driven lung cancer models represent valuable tools for the preclinical testing and translation of different therapeutic strategies for this patient population. See related article by Mozzarelli et al., p. 3196 See related article by DiMarco et al., p. 3207."
    },
    {
      "pmid": "40902984",
      "doi": "10.1016/j.labinv.2025.104234",
      "title": "COMPREHENSIVE ANALYSIS OF NEUROD1, ASCL1, POU2F3 AND YAP1 EXPRESSION SIGNATURES REVEAL UNIQUE LCNEC SUBGROUPS WITH POTENTIAL THERAPEUTIC IMPLICATIONS.",
      "journal": "Laboratory investigation; a journal of technical methods and pathology",
      "pubdate": "2025-09-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Other",
      "trial_type": null,
      "study_class": "Other",
      "category_key": "lc",
      "category_label": "Lungenkrebs – Studien",
      "is_oa": true,
      "oa_url": "https://doi.org/10.1016/j.labinv.2025.104234",
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40902984/",
      "url_doi": "https://doi.org/10.1016/j.labinv.2025.104234",
      "abstract": "Large-cell neuroendocrine carcinoma (LCNEC) can be genomically subtyped into small cell lung cancer (SCLC)- and non-SCLC (NSCLC)-like. NEUROD1, ASCL1, POU2F3, and YAP1 (NAPY) subtypes have been reported for SCLC. We immunohistochemically evaluated NAPY in LCNEC alongside relevant protein expression data. Tissue microarrays from 133 stage I-III resected LCNEC were reviewed and immunostained for NAPY, pRb, DLL3, cMYC and TTF1. H-score >10 was considered positive (+), and >50 dominant. Unsupervised clustering and spatial immune RNA profiling using GeoMX Digital Spatial Profiling (DSP) were performed. Clinical data were obtained from the Netherlands Cancer Registry. ASCL1 was dominant in 26%, NEUROD1 in 18% of LCNEC. pRb loss was observed in 75%, and DLL3+, cMYC+ and TTF1+ in 66%, 26%, and 70%, respectively. Unsupervised clustering identified five expression-based subgroups: NEUROD1high-ASCL1high (10%), ASCL1high (22%), POU2F3high (5%), YAP1high (11%), NAPYlow (51%). Both ASCL1high subgroups correlated with DLL3high and high neuroendocrine (NE) marker expression. YAP1high was enriched for pRb+. POU2F3high and YAP1high subgroups were NE marker low and DLL3low. DSP identified four upregulated genes involved in immune system and/or tumor development in the NEUROD1high-ASCL1high-POU2F3high-group. In this comprehensive evaluation of NAPY markers in LCNEC, we observed five expression-based subgroups: NEUROD1high-ASCL1high, ASCL1high, POU2F3high, YAP1high, and NAPYlow. The NE subgroups (NEUROD1high-ASCL1high and ASCL1high) were recognized with DLL3high expression. Compared to the proportion known in SCLC, more NAPYlow and YAP1high and fewer POU2F3high cases were identified. Application of NAPY in LCNEC provides a more modest discrimination of subgroups compared to SCLC. Further research on potential drug targets is warranted, i.e. differences in DLL3 and YAP1 expression could guide personalized treatment strategies."
    },
    {
      "pmid": "40914604",
      "doi": "10.1016/j.jtho.2025.05.022",
      "title": "Cost-Efficiency of Risk-Based Lung Cancer Screening Across PLCOm2012 Risk Deciles.",
      "journal": "Journal of thoracic oncology : official publication of the International Association for the Study of Lung Cancer",
      "pubdate": "2025-09-01T00:00:00+00:00",
      "pubtypes": [
        "Letter"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "category_key": "lc",
      "category_label": "Lungenkrebs – Studien",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40914604/",
      "url_doi": "https://doi.org/10.1016/j.jtho.2025.05.022",
      "abstract": null
    },
    {
      "pmid": "40914601",
      "doi": "10.1016/j.jtho.2025.06.008",
      "title": "A Response to the Letter to the Editor: Cost-Efficiency of Risk-Based Lung Cancer Screening Across PLCOm2012 Risk Deciles.",
      "journal": "Journal of thoracic oncology : official publication of the International Association for the Study of Lung Cancer",
      "pubdate": "2025-09-01T00:00:00+00:00",
      "pubtypes": [
        "Letter"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "category_key": "lc",
      "category_label": "Lungenkrebs – Studien",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40914601/",
      "url_doi": "https://doi.org/10.1016/j.jtho.2025.06.008",
      "abstract": null
    },
    {
      "pmid": "40914599",
      "doi": "10.1016/j.jtho.2025.07.007",
      "title": "Broadening the Scope of Bronchoscopic Sampling in the Era of Minimally Invasive and Molecular Diagnosis of Lung Cancer.",
      "journal": "Journal of thoracic oncology : official publication of the International Association for the Study of Lung Cancer",
      "pubdate": "2025-09-01T00:00:00+00:00",
      "pubtypes": [
        "Editorial"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "category_key": "lc",
      "category_label": "Lungenkrebs – Studien",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40914599/",
      "url_doi": "https://doi.org/10.1016/j.jtho.2025.07.007",
      "abstract": null
    },
    {
      "pmid": "40914594",
      "doi": "10.1016/j.jtho.2025.06.019",
      "title": "Lung Cancer Screening: Future Opportunities.",
      "journal": "Journal of thoracic oncology : official publication of the International Association for the Study of Lung Cancer",
      "pubdate": "2025-09-01T00:00:00+00:00",
      "pubtypes": [
        "Editorial"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "category_key": "lc",
      "category_label": "Lungenkrebs – Studien",
      "is_oa": true,
      "oa_url": "https://www.jto.org/article/S1556-0864(25)00807-X/pdf",
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40914594/",
      "url_doi": "https://doi.org/10.1016/j.jtho.2025.06.019",
      "abstract": null
    },
    {
      "pmid": "40882294",
      "doi": "10.1016/j.lungcan.2025.108730",
      "title": "Early pseudo-progression of brain metastases following tarlatamab therapy in relapsed small cell lung cancer.",
      "journal": "Lung cancer (Amsterdam, Netherlands)",
      "pubdate": "2025-09-01T00:00:00+00:00",
      "pubtypes": [
        "Letter"
      ],
      "entity": "SCLC",
      "trial_type": null,
      "study_class": "Other",
      "category_key": "lc",
      "category_label": "Lungenkrebs – Studien",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40882294/",
      "url_doi": "https://doi.org/10.1016/j.lungcan.2025.108730",
      "abstract": null
    },
    {
      "pmid": "40882293",
      "doi": "10.1016/j.lungcan.2025.108712",
      "title": "Polygenic risk score to define risk of cancer-associated thrombosis among patients with lung cancer in a population-based study.",
      "journal": "Lung cancer (Amsterdam, Netherlands)",
      "pubdate": "2025-09-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "category_key": "lc",
      "category_label": "Lungenkrebs – Studien",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40882293/",
      "url_doi": "https://doi.org/10.1016/j.lungcan.2025.108712",
      "abstract": "BACKGROUND: Venous thromboembolism (VTE) is a major complication in lung cancer, and remains challenging to predict with current risk models. This study assesses the utility of a Polygenic Score (PGS) for VTE risk stratification in lung cancer patients.\n\nMETHODS: Analyzing UK Biobank data with 3,241 lung cancer patients, we explored the association between a high PGS, with and without positive monogenic mutations (factor V Leiden [FVL]/ prothrombin gene mutation [PGM]), and VTE incidence. Two definitions of VTE incidence were used: \"restricted location VTE\" (pulmonary embolism or lower extremity thrombosis) and \"any VTE\" (inclusive of all venous thromboses).\n\nRESULTS: A high PGS was strongly associated with an increased VTE, including in subgroup analysis with adjustment for comorbidities. A previous VTE (Hazard ratio [HR]: 5.5) and metastasis (HR: 2.52) predicted increased risk of VTE. In addition, the top PGS quartile predicted VTE in both the any VTE definition: HR 1.35 (with FVL/PGM) and 1.39 (without FVL/PGM); and in the restricted location VTE: HR 1.38 (without FVL/PGM); all p ≤ 0.05. The 12-month VTE incidence confirmed the predictive discrimination of the PGS regardless of FVL/PGM status.\n\nCONCLUSION: The PGS identified lung cancer patients at higher inherited risk for VTE, suggesting its potential for personalized prophylaxis and improved clinical outcomes."
    },
    {
      "pmid": "40876065",
      "doi": "10.1016/j.lungcan.2025.108718",
      "title": "Locally advanced NSCLC: overview of real-world pattern of recurrence in durvalumab era (LEOPARD trial).",
      "journal": "Lung cancer (Amsterdam, Netherlands)",
      "pubdate": "2025-09-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article",
        "Multicenter Study"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Other",
      "category_key": "lc",
      "category_label": "Lungenkrebs – Studien",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40876065/",
      "url_doi": "https://doi.org/10.1016/j.lungcan.2025.108718",
      "abstract": "BACKGROUND: Despite the advances introduced by the PACIFIC trial, recurrence after definitive chemoradiotherapy (CRT) followed by durvalumab consolidation remains a significant clinical challenge in unresectable stage III non-small cell lung cancer (NSCLC). This study aims to investigate relapse patterns and outcomes of salvage treatments in a real-world cohort, providing insights for post-progression management.\n\nMETHODS: We performed a retrospective analysis of 166 patients with unresectable stage III NSCLC treated with the PACIFIC regimen across eight Italian centers from January 2018 to December 2021. Recurrences were classified as oligorecurrent (≤3 lesions amenable to local therapy) or polyrecurrent. The impact of salvage strategies on overall survival (OS) was reported.\n\nRESULTS: After a median follow-up of 33 months, 56 % of patients experienced recurrence; among these, 72 % were oligorecurrent. Oligorecurrences predominantly involved the lungs (34 %) and brain (26 %), mostly outside the irradiated field. Median OS was significantly longer in oligorecurrent versus polyrecurrent patients (41 vs. 19 months). Salvage therapies in oligorecurrent patients included radiotherapy (RT) (45 %), chemotherapy (35 %), and CRT (13 %). Median OS was 25 months for those treated with RT alone and 30 months for those receiving CRT. Polyrecurrent patients primarily underwent chemotherapy (77 %) with a median OS of 12 months.\n\nCONCLUSIONS: Oligorecurrence represented the predominant pattern of relapse post-CRT and durvalumab, associated with improved survival when treated with metastasis-directed therapies. These findings underscore the importance of stratifying recurrence patterns and integrating local salvage treatments, especially RT, in personalized management. Prospective trials are needed to refine salvage strategies and evaluate novel therapeutic combinations."
    },
    {
      "pmid": "40876064",
      "doi": "10.1016/j.lungcan.2025.108727",
      "title": "Prediction recurrence in stage I epidermal growth factor receptor-mutated non-small cell lung cancer using multi-modal data.",
      "journal": "Lung cancer (Amsterdam, Netherlands)",
      "pubdate": "2025-09-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Other",
      "category_key": "lc",
      "category_label": "Lungenkrebs – Studien",
      "is_oa": true,
      "oa_url": "https://doi.org/10.1016/j.lungcan.2025.108727",
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40876064/",
      "url_doi": "https://doi.org/10.1016/j.lungcan.2025.108727",
      "abstract": "INTRODUCTION: Integrated recurrence prediction models that combine clinical, imaging, and genetic data are lacking for epidermal growth factor receptor (EGFR)-mutated stage I non-small cell lung cancer (NSCLC). We developed a recurrence prediction model for Stage I EGFR-mutated NSCLC by integrating clinical, radiological, and whole-exome sequencing (WES) data.\n\nMETHODS: A total of 306 patients with Stage I EGFR-mutated NSCLC were stratified into training (n = 206) and validation (n = 100) cohorts using stratified random sampling. Cox proportional hazards models combined binary labels of clinical and radiological factors from univariate analysis, machine-learning-derived MultiGenes labels (determined by multiple gene mutations) from WES data, and high-impact gene mutations. Predictive performance was assessed using the concordance index (C-index), time-dependent area under the curve (AUC), and receiver operating characteristic curves. The top three models by category were evaluated using a survival analysis.\n\nRESULTS: Three optimal models were identified; the clinicoradiological model (Model 17) achieved a C-index of 0.70, the model incorporating clinicoradiological factors and MultiGenes (Model 28) achieved 0.69, and the clinicoradiological model with TP53 mutations (Model 39) demonstrated the best performance, with 0.73. In Model 17, the 60-month recurrence-free survival (RFS) rates were 59.1 % for the high-risk group and 83.2 % for the low-risk group (hazard ratio [HR] = 3.47; 95 % confidence interval [CI]: 1.60-8.00). Model 39, which incorporated TP53 mutations, demonstrated superior performance, with 60-month RFS rates of 57.1 % for the high-risk and 87.1 % for the low-risk groups (HR = 4.79; 95 %CI: 1.96-11.69).\n\nCONCLUSIONS: Clinical and radiological factors are effective predictors of recurrence risk in Stage I EGFR-mutated NSCLC, and incorporating TP53 mutation data further improves the prognostic accuracy."
    },
    {
      "pmid": "40865374",
      "doi": "10.1016/j.lungcan.2025.108725",
      "title": "Comment on \"The effectiveness of pembrolizumab maintenance with or without pemetrexed after induction treatment for advanced non-squamous Non-Small-Cell lung cancer\".",
      "journal": "Lung cancer (Amsterdam, Netherlands)",
      "pubdate": "2025-09-01T00:00:00+00:00",
      "pubtypes": [
        "Letter"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "category_key": "lc",
      "category_label": "Lungenkrebs – Studien",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40865374/",
      "url_doi": "https://doi.org/10.1016/j.lungcan.2025.108725",
      "abstract": null
    },
    {
      "pmid": "40865373",
      "doi": "10.1016/j.lungcan.2025.108723",
      "title": "Impact of B7-H3 and DLL3 expression on the efficacy of PD-L1 blockade therapy in extensive-stage small cell lung cancer.",
      "journal": "Lung cancer (Amsterdam, Netherlands)",
      "pubdate": "2025-09-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "SCLC",
      "trial_type": null,
      "study_class": "Other",
      "category_key": "lc",
      "category_label": "Lungenkrebs – Studien",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40865373/",
      "url_doi": "https://doi.org/10.1016/j.lungcan.2025.108723",
      "abstract": "BACKGROUND: B7-H3 and delta-like ligand 3 (DLL3) are novel therapeutic targets in extensive-stage small cell lung cancer (ES-SCLC). We aimed to assess the impact of B7-H3 and DLL3 expression on the tumor immune microenvironment (TME) and on the therapeutic efficacy of programmed cell death-ligand 1 (PD-L1) blockade for ES-SCLC.\n\nPATIENTS AND METHODS: A total of 146 ES-SCLC patients who received platinum-based chemotherapy either with (Chemo + ICI cohort) or without (Chemo cohort) an immune checkpoint inhibitor was analyzed. Progression-free survival (PFS) and overall survival (OS) were evaluated in each cohort according to B7-H3 or DLL3 expression status as detected by immunohistochemistry. The relation of B7-H3 or DLL3 expression to characteristics of the TME was assessed by immune-related gene expression profiling (irGEP).\n\nRESULTS: In the Chemo + ICI cohort, patients with high B7-H3 expression showed a shorter PFS (median of 4.3 vs. 5.4 months; HR of 2.11 with a 95 % Cl of 1.08-4.10; P = 0.03) and OS (median of 8.4 vs. 14.2 months; HR of 1.83 with a 95 % CI of 0.91-3.69; P = 0.09) than those with low B7-H3 expression. In the Chemo cohort, there was no apparent difference in survival outcomes between the high and low B7-H3 expression groups. The irGEP analysis revealed that the effector function of CD8+ T cells was impaired in tumors with high B7-H3 expression. No clear association was apparent between therapeutic efficacy and DLL3 expression status.\n\nCONCLUSIONS: High B7-H3 expression may serve as a resistance mechanism for PD-L1 antibody therapy by promoting T cell dysfunction in ES-SCLC."
    },
    {
      "pmid": "40865371",
      "doi": "10.1016/j.lungcan.2025.108726",
      "title": "Integrating tumor macroenvironment, microenvironment and mechanobiology with organoid and organ-on-a-chip models for lung cancer immunotherapy.",
      "journal": "Lung cancer (Amsterdam, Netherlands)",
      "pubdate": "2025-09-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article",
        "Review"
      ],
      "entity": "Thoracic-other",
      "trial_type": "Review/Meta",
      "study_class": "Review",
      "category_key": "lc",
      "category_label": "Lungenkrebs – Studien",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40865371/",
      "url_doi": "https://doi.org/10.1016/j.lungcan.2025.108726",
      "abstract": "Lung cancer remains the leading cause of cancer-related mortality, and immune checkpoint inhibitors (ICIs) have revolutionized its treatment. However, immunotherapy responses vary significantly among patients, and adverse effects, such as immune-related pneumonitis, pose clinical challenges. Both the tumor macroenvironment (TMaE) and tumor microenvironment (TME) play pivotal roles in modulating immunotherapy outcomes; however, the complex crosstalk between them remains insufficiently characterized. This review discusses systemic (macroenvironmental) factors, including host metabolic status, coexisting pulmonary diseases, and baseline immune competence, alongside tumor-intrinsic (microenvironmental) determinants, such as programmed death-ligand 1 (PD-L1) expression, tumor mutation burden (TMB), and immune cell infiltration. Furthermore, we highlight the role of mechanotransduction pathways, including YAP/TAZ signaling, extracellular matrix (ECM) stiffness, and mechanical stress, in immune evasion, suggesting their potential as novel therapeutic targets. Finally, we explore emerging preclinical models simulating the TME and TMaE for immunotherapy response and safety assessment using lung cancer-derived organoids and organ-on-a-chip platforms. A deeper understanding of the interplay between TMaE and TME, combined with advanced modeling approaches, may ultimately lead to more precise and personalized immunotherapy strategies for patients with lung cancer."
    },
    {
      "pmid": "40857845",
      "doi": "10.1016/j.lungcan.2025.108722",
      "title": "Stratifying risk in oligoprogressive EGFR-mutated non-small cell lung cancer (NSCLC): The role of liquid biopsy.",
      "journal": "Lung cancer (Amsterdam, Netherlands)",
      "pubdate": "2025-09-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Preclinical",
      "category_key": "lc",
      "category_label": "Lungenkrebs – Studien",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40857845/",
      "url_doi": "https://doi.org/10.1016/j.lungcan.2025.108722",
      "abstract": "BACKGROUND: EGFR-TKIs have markedly enhanced outcomes for non-small cell lung cancer (NSCLC) patients, but resistance development is virtually inevitable. In the context of oligoprogressive disease (OPD), local treatments can target resistant clones while EGFR-TKIs maintain systemic control, potentially extending the duration of therapy. However, identifying patients who benefit from this combined approach remains unclear.\n\nMETHODS: We conducted a retrospective study on advanced EGFR-NSCLC patients with OPD during TKI therapy, treated with local therapy and continued TKI. Serum liquid biopsies for ctDNA EGFR mutations were performed at oligoprogression. We assessed the effect of liquid biopsy status and relevant clinical variables on progression-free survival-2 (PFS2; OPD to progression), overall survival-2 (OS2; OPD to death), overall survival-1 (OS1; diagnosis to death) and time to TKI discontinuation (TTD; TKI initiation to discontinuation).\n\nRESULTS: Among 84 patients, 70 had liquid biopsies, with 56 % testing positive for ctDNA. A positive liquid biopsy was associated with worse PFS2 (4.99 vs. 11.73 months, p < 0.001), OS2, OS1 and TTD. In stratified analysis, CNS oligoprogression showed no PFS2 difference by liquid biopsy status, whereas non-CNS oligoprogression revealed a significant difference (5.13 vs. 13.70 months, p < 0.001). Univariate analysis linked shorter PFS1, CNS progression, poor PS, high carcinoembryonic antigen, and non-SBRT radiotherapy to worse PFS2, while multivariate analysis identified liquid biopsy positivity as the only independent factor.\n\nCONCLUSIONS: Liquid biopsy status is a significant prognostic marker in extracranial EGFR-oligoprogressive NSCLC, suggesting its potential in identifying patients who may benefit from continued TKI and local therapies. Further prospective studies are warranted to confirm these findings and explore alternative treatment strategies for OPD."
    },
    {
      "pmid": "40850042",
      "doi": "10.1016/j.lungcan.2025.108720",
      "title": "Changes in use of radiotherapy for lung cancer - A Norwegian population-based study from 2000 until 2020.",
      "journal": "Lung cancer (Amsterdam, Netherlands)",
      "pubdate": "2025-09-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "category_key": "lc",
      "category_label": "Lungenkrebs – Studien",
      "is_oa": true,
      "oa_url": "https://www.lungcancerjournal.info/article/S0169-5002(25)00612-9/pdf",
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40850042/",
      "url_doi": "https://doi.org/10.1016/j.lungcan.2025.108720",
      "abstract": "BACKGROUND: Radiotherapy (RT) is an important treatment modality for cancer. It requires significant resources, building facilities takes time, and planning of the capacity is essential to offer RT to all patients in need. There have been considerable advances in lung cancer management, especially medical treatment, and survival the last decades, which might impact the need for RT. In this study, we investigated whether the RT use for lung cancer has changed in Norway since year 2000.\n\nMETHODS: Data on patients diagnosed with lung cancer between 2000 and 2020 were collected from the Cancer Registry of Norway, containing nearly complete RT and survival data.\n\nRESULTS: 55,048 patients were analyzed. Median age was 71 years, 44 % were women, 74 % had non-small-cell lung cancer, 16 % small-cell lung cancer, 10 % unknown histology, 46 % metastatic disease. Overall, 50 % received any RT. The proportion receiving curative RT increased (2000: 10 %, 2020: 22 %), mainly due to implementation of stereotactic body RT (<1% before 2008, 11 % in 2020). The proportion receiving palliative RT increased the first decade (2000: 30 %, 2010: 42 %) before decreasing to 30 % in 2020, mainly due to less use of palliative thoracic and whole-brain RT. Number of RT courses per year increased (from 1283 to 2328), courses per patient decreased the last decade (from 0.82 to 0.76). Median overall survival improved significantly (2000-2004: 6.2 months, 2016-2020: 14.0 months, p < 0.001).\n\nCONCLUSION: There was a shift towards more curative and less palliative RT from 2000 until 2020. Overall, the use of RT for lung cancer increased during this period."
    },
    {
      "pmid": "40819509",
      "doi": "10.1016/j.lungcan.2025.108697",
      "title": "An economic evaluation of lung cancer screening with low-dose computed tomography in a high-risk population of (ex-)smokers in Belgium.",
      "journal": "Lung cancer (Amsterdam, Netherlands)",
      "pubdate": "2025-09-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "category_key": "lc",
      "category_label": "Lungenkrebs – Studien",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40819509/",
      "url_doi": "https://doi.org/10.1016/j.lungcan.2025.108697",
      "abstract": "BACKGROUND: Before implementing a screening programme, it is important to balance the benefits against the harms and assess its cost-effectiveness. To date, no such evaluation of lung cancer screening has been conducted in Belgium. The objective of this study was to examine the cost-effectiveness of lung cancer screening using low-dose CT (LDCT) in a Belgian population of (ex-)smokers.\n\nMETHODS: This economic evaluation is based on the results of the NELSON trial and supplemented with Belgian stage- and histology-specific survival data, Belgian real-world diagnosis and treatment costs, and information from the literature (e.g. quality of life). Incremental costs and effects were modelled by combining a decision tree (invitation, screening and diagnosis) with a Markov model (cancers detected in the intervention and comparator group). The results are expressed as costs per quality-adjusted life years (QALYs). Benefits and harms are also presented on a 1000-person figure.\n\nFINDINGS: Based on the NELSON screening strategy, three rounds of LDCT screening for lung cancer (in years 0, 1 and 3) compared to no screening is associated with an incremental gain of 4.6 QALYs and an incremental cost of €78000 per 100 participants. This results in an incremental cost-effectiveness ratio of €18530 per QALY gained.\n\nINTERPRETATION: In the Belgian healthcare setting, LDCT screening of (ex-)smokers for lung cancer is likely to be cost-effective if policy makers are willing to pay more than €20000 per QALY gained. However, before implementing lung cancer screening, it is important to gain insight into the impact of incidental findings, available budgets, and capacity within the healthcare system. It is also important to evaluate the willingness to participate when individuals are fully informed about the benefits and harms of LDCT lung cancer screening."
    },
    {
      "pmid": "40818199",
      "doi": "10.1016/j.lungcan.2025.108711",
      "title": "CAR-T for Lung Cancers: Challenges and Innovations.",
      "journal": "Lung cancer (Amsterdam, Netherlands)",
      "pubdate": "2025-09-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article",
        "Review"
      ],
      "entity": "Thoracic-other",
      "trial_type": "Review/Meta",
      "study_class": "Review",
      "category_key": "lc",
      "category_label": "Lungenkrebs – Studien",
      "is_oa": true,
      "oa_url": "https://www.lungcancerjournal.info/article/S0169-5002(25)00603-8/pdf",
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40818199/",
      "url_doi": "https://doi.org/10.1016/j.lungcan.2025.108711",
      "abstract": "Lung cancer (LC) is the leading cause of cancer mortality worldwide. Despite current therapies, including surgery, radiotherapy, targeted therapies, and immunotherapy, most patients experience relapse. Immune checkpoint inhibitors (ICIs) have revolutionized LC treatment, but only a subset of patients benefit from them. Chimeric antigen receptor (CAR) T cell therapy emerges as an innovative and promising strategy in oncology. CAR T cells are genetically modified T lymphocytes that express a chimeric receptor specific for a tumor antigen. Very promising in hematology, CAR T has so far struggled to be transferred into the clinic for solid tumors, including LC. CAR T strategy against LC presents challenges in the selection of the optimal antigen to avoid off-target effects, for the known antigen heterogeneity and immunosuppressive environment of LC and the relatively short persistence of CAR T that may encounter disseminated diseases. Despite these limitations, here we describe growing preclinical and clinical studies that are exploring various LC antigens for CAR T within a variety of novel approaches and combinatorial strategies to overcome the barriers. Considering this emerging critical mass and despite the limits, we expect this endeavour to translate a fraction CAR T into clinical practice with efficacy against the still deadly LCs."
    },
    {
      "pmid": "40818198",
      "doi": "10.1016/j.lungcan.2025.108714",
      "title": "Clinical outcomes and neuroendocrine features of transformed versus primary small-cell lung cancer.",
      "journal": "Lung cancer (Amsterdam, Netherlands)",
      "pubdate": "2025-09-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "category_key": "lc",
      "category_label": "Lungenkrebs – Studien",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40818198/",
      "url_doi": "https://doi.org/10.1016/j.lungcan.2025.108714",
      "abstract": "INTRODUCTION: The clinical outcomes of transformed small-cell lung cancer (T-SCLC) was previously considered comparable with primary SCLC (P-SCLC). However, whether T-SCLCs and P-SCLCs differ in the era of immunotherapy remains unclear.\n\nMETHODS: Clinical outcomes were retrospectively analyzed. Overall survival (OS) was estimated using the Kaplan-Meier method and Cox regression. Linear correlation and regression analyses were used to assess prognostic value of baseline neuron-specific enolase (NSE). Hierarchical clustering was used to group neuroendocrine (NE) markers of T-SCLC by immunohistochemical results.\n\nRESULTS: Between March 2018 and March 2023, 206 patients with T-SCLC (n = 42) and P-SCLC (n = 164) were enrolled in the study. The median OS (mOS) of T-SCLC cohort was significantly shorter than that of the P-SCLC cohort (11.7 vs. 12.9 months, P = 0.033). In the T-SCLC cohort, the mOS of chemoimmunotherapy significantly outlasted that of chemotherapy (15.4 vs. 8.5 months, P = 0.001). The optimal baseline NSE cutoff values differed between T-SCLC (19.7 ng/ml) and P-SCLC (74.8 ng/ml), and a high NSE level was associated with poorer mOS in both T-SCLC (10.0 vs. 16.5 months, P = 0.003) and P-SCLC (10.8 vs. 16.5 months, P < 0.001). The cluster with stronger expression of NE markers in T-SCLC exhibited longer mOS (14.3 vs. 10.3 months, P = 0.030).\n\nCONCLUSION: T-SCLC had a statistically poorer prognosis than P-SCLC, but the difference was modest. Chemoimmunotherapy might improve the outcomes of T-SCLC. Patients with T-SCLC who show stronger neuroendocrine features may have a poorer prognosis."
    },
    {
      "pmid": "40818197",
      "doi": "10.1016/j.lungcan.2025.108715",
      "title": "Immunotherapy in EGFR-mutant NSCLC after TKI resistance: role of mutation subtypes and progression patterns.",
      "journal": "Lung cancer (Amsterdam, Netherlands)",
      "pubdate": "2025-09-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article",
        "Multicenter Study"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Other",
      "category_key": "lc",
      "category_label": "Lungenkrebs – Studien",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40818197/",
      "url_doi": "https://doi.org/10.1016/j.lungcan.2025.108715",
      "abstract": "BACKGROUND: Patients withEGFR-sensitizing mutations in non-small cell lung cancer (NSCLC) predominantly receive first-line tyrosine kinase inhibitors (TKIs). Subsequent TKI resistance manifests through heterogeneous clinicopathological features, including distinct resistance subtypes (primary vs. acquired),PD-L1expression levels, and molecular profiles from re-biopsies. While immunotherapy represents a potential subsequent option, the predictive biomarkers guiding optimal patient selection remain undefined.\n\nPATIENTS AND METHODS: This multicenter retrospective study analyzed 1,396 EGFR-mutant NSCLC patients from five Chinese institutions, with 312 meeting stringent inclusion criteria. Comprehensive treatment data encompassing EGFR-TKIs, platinum-based chemotherapy, anti-angiogenic agents, and immune checkpoint inhibitors (ICIs) were collected. Cox proportional hazards regression identified progression-free survival (PFS)-associated variables, enabling resistance subtyping. Comparative effectiveness analyses across therapeutic modalities were performed.\n\nRESULTS: Multivariable Cox regression identified two independent predictors of immunotherapy PFS:EGFRmutation subtypes (exon21 L858R vs. exon19del; HR 0.84, 95 % CI [0.70-0.99], P = 0.042) and TKI resistance classification (acquired vs. primary: HR 2.28, 95 % CI [1.52-3.43], P = 0.001). Patients with primary TKI resistance showed improved outcomes with ICIs (median PFS 8.5 vs. 4.0 months; HR 0.46,95 % CI [0.29-0.76], P = 0.002), particularly in L858R-mutant subgroups. In contrast, acquired resistance cohorts-especially those with exon19del mutations-derived limited clinical benefit (HR 1.09, 95 % CI [0.84-1.42];P = 0.510). These findings suggest that resistance subtype and mutation profile may aid immunotherapy selection in EGFR-mutant NSCLC, requiring validation through prospective studies.\n\nCONCLUSIONS: This multicenter analysis demonstrates that immunotherapy outcomes in EGFR-mutant NSCLC after TKI failure are influenced by both resistance subtypes (primary vs. acquired) and specific EGFR mutation profiles (L858R vs. exon19del). Patients with primary resistance and L858R mutations derive clinically meaningful benefit from ICIs, while those with acquired resistance, particularly exon19del variants, showed limited efficacy. These findings support further investigation of resistance-phenotype-guided therapeutic algorithms in prospective trials to optimize treatment sequencing strategies."
    },
    {
      "pmid": "40811940",
      "doi": "10.1016/j.lungcan.2025.108701",
      "title": "A treatment-impact model of alectinib for the prediction of recurrence and associated costs in treating resectable ALK+ non-small cell lung cancer.",
      "journal": "Lung cancer (Amsterdam, Netherlands)",
      "pubdate": "2025-09-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Other",
      "category_key": "lc",
      "category_label": "Lungenkrebs – Studien",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40811940/",
      "url_doi": "https://doi.org/10.1016/j.lungcan.2025.108701",
      "abstract": "OBJECTIVES: Based on the Phase III ALINA trial, alectinib gained US approval as the first anaplastic lymphoma kinase (ALK) tyrosine kinase inhibitor for adjuvant treatment of resectable ALK + non-small cell lung cancer (NSCLC). We used a treatment impact model to estimate associated population-level clinical benefits and cost savings of alectinib vs chemotherapy.\n\nMATERIALS AND METHODS: Treatment-associated costs for alectinib vs chemotherapy were estimated for five annual cohorts of US patients with stage IB-IIIA ALK+ NSCLC between 2024 and 2028; each cohort was followed for 10 years. Data sources included ALINA. Two treatment scenarios were modelled, with all patients receiving adjuvant treatment with (1) alectinib and (2) chemotherapy. For each scenario, the model simulated the number of patients who received adjuvant treatment and experienced metastatic or non-metastatic recurrence or death and treatment-associated and downstream recurrence costs. Key assumptions were varied in sensitivity analyses. The impact of joint parameter uncertainty was evaluated using probabilistic sensitivity analysis.\n\nRESULTS: In 2024-2028, an estimated 3,130 patients with resectable ALK+ NSCLC would be eligible for adjuvant alectinib treatment. Relative to chemotherapy, alectinib was estimated to prevent 1,531 recurrences and deaths, including 1,059 recurrences to metastatic NSCLC, thus avoiding of $1.31 billion (USD) in costs associated with recurrences and death. Considering upfront adjuvant treatment costs, alectinib was estimated to save $347 million vs chemotherapy.\n\nCONCLUSIONS: Adjuvant alectinib treatment improved population-level clinical outcomes and was predicted to generate cost savings in the US. Predicted alectinib benefits were maximized when all indicated patients were tested for the ALK biomarker."
    },
    {
      "pmid": "40811939",
      "doi": "10.1016/j.lungcan.2025.108710",
      "title": "Dacomitinib in the treatment of EGFR-mutated non-small cell lung cancer with brain metastases: an open-label, multicenter, phase II study.",
      "journal": "Lung cancer (Amsterdam, Netherlands)",
      "pubdate": "2025-09-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article",
        "Multicenter Study"
      ],
      "entity": "NSCLC",
      "trial_type": "Phase II",
      "study_class": "Prospective",
      "category_key": "lc",
      "category_label": "Lungenkrebs – Studien",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40811939/",
      "url_doi": "https://doi.org/10.1016/j.lungcan.2025.108710",
      "abstract": "OBJECTIVES: Dacomitinib's efficacy in patients with severe brain metastases remains understudied. This study aimed to evaluate dacomitinib in treatment-naïve non-small-cell lung cancer (NSCLC) patients with EGFR mutations and multiple brain metastases.\n\nMETHODS: This open-label, multicenter, Phase II study enrolled 15 treatment-naïve NSCLC patients with ≥3 brain metastases, including at least one lesion >1 cm. Patients received dacomitinib 45 mg/day orally. Primary endpoints included progression-free survival (PFS), while secondary endpoints encompassed objective response rate (ORR), disease control rate (DCR), intracranial ORR (iORR), intracranial PFS (iPFS), and the incidence of treatment-emergent adverse events (TEAEs). Exploratory analyses were conducted to evaluate the influence of different types of EGFR mutations on the clinical outcomes. This study was registered in ClinicalTrials.gov (NCT04339829) and is closed to accrual.\n\nRESULTS: The median PFS was 16.8 months (95 % CI: 15.376, NE), with an overall ORR of 93.3 % (95 % CI: 68.052 %, 99.831 %) and DCR of 100 %. Intracranial efficacy was notable, with an iORR of 66.7 % (95 % CI: 38.380 %, 88.176 %) and median iPFS of 16.6 months (95 % CI: 3.614, NE). Among patients evaluated for intracranial response, the iORR reached as high as 90.9 %. Exploratory analyses revealed no significant differences in PFS, iPFS, or disease progression based on exon 19 deletions or L858R mutations. Six patients (40 %) experienced ≥grade 3 TEAEs which were manageable.\n\nCONCLUSION: Dacomitinib demonstrated robust systemic and intracranial efficacy in patients with NSCLC harboring EGFR mutations and severe brain metastases, with acceptable adverse events, thereby supporting its use as a first-line treatment."
    },
    {
      "pmid": "40779888",
      "doi": "10.1016/j.lungcan.2025.108686",
      "title": "Impact of recruitment method on informed decision-making in lung cancer screening in the 4-IN-THE-LUNG-RUN trial.",
      "journal": "Lung cancer (Amsterdam, Netherlands)",
      "pubdate": "2025-09-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article",
        "Randomized Controlled Trial"
      ],
      "entity": "Thoracic-other",
      "trial_type": "RCT",
      "study_class": "Prospective",
      "category_key": "lc",
      "category_label": "Lungenkrebs – Studien",
      "is_oa": true,
      "oa_url": "https://www.lungcancerjournal.info/article/S0169-5002(25)00578-1/pdf",
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40779888/",
      "url_doi": "https://doi.org/10.1016/j.lungcan.2025.108686",
      "abstract": "OBJECTIVES: It is relatively unknown how to inform individuals about lung cancer screening to enable informed decision-making (IDM). This study aims to determine the level of IDM across different recruitment methods among participants invited for the 4-IN-THE-LUNG-RUN trial, the European implementation trial for lung cancer screening.\n\nMETHODS: A 23-item online questionnaire related to decision-relevant knowledge was sent to 848 Dutch men and women, aged 60-79 years, who were randomised in 4-IN-THE-LUNG-RUN. Respondents were considered to have sufficient knowledge when answering at least 12 items correctly. Informed choice was determined as 1) having sufficient knowledge and 2) consistency between intention to be screened and actual participation.\n\nRESULTS: Participants were recruited between July 2024 and August 2024. Of 386 respondents (45.5 %) with fully completed questionnaires, 327 (84.7 %) had sufficient knowledge and made an informed decision, 283 (85.2 %) of the screened participants (n = 332) did so. Knowledge scores increased with the level of tailoring as compared to standard paper information (p = 0.015). While 78.1 % from the standard paper group made an informed choice, 89.0 % from the tailored group did so (p = 0.088). IDM was comparable among the socioeconomic status (SES) groups: 79.8 % (95/119) of the participants in the lower, 84.5 % (93/110) in the middle, and 88.5 % (139/157) in the high SES group made an informed decision (p = 0.138). No sex-related differences were found in informed decision-making: 196 out of 231 males (84.8 %) versus 131 out of 155 females (84.5 %), p = 0.929. Even if assumed that all responders with incomplete questionnaires did have insufficient knowledge, 69.6 % were able to make an informed decision.\n\nCONCLUSION: The manner in which participants are informed contributes to the extent to which they can make an informed decision. A more tailored approach leads to improved knowledge, which facilitates IDM. The results indicate an equivalent level of IDM across different SES and sex groups."
    },
    {
      "pmid": "40774265",
      "doi": "10.1016/S1470-2045(25)00299-2",
      "title": "[(68)Ga]Ga-FAPI-46 PET accuracy for cancer imaging with histopathology validation: a single-centre, single-arm, interventional, phase 2 trial.",
      "journal": "The Lancet. Oncology",
      "pubdate": "2025-09-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Other",
      "trial_type": null,
      "study_class": "Other",
      "category_key": "lc",
      "category_label": "Lungenkrebs – Studien",
      "is_oa": true,
      "oa_url": "https://www.thelancet.com/pdfs/journals/lanonc/PIIS1470-2045(25)00299-2.pdf",
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40774265/",
      "url_doi": "https://doi.org/10.1016/S1470-2045(25)00299-2",
      "abstract": "BACKGROUND: The fibroblast activation protein α (FAP)-directed radiotracer [68Ga]Ga-FAPI-46 for PET-CT has shown promising diagnostic accuracy in cancer staging in retrospective studies. We aim to investigate the positive predictive value (PPV) of [68Ga]Ga-FAPI-46 PET for detecting FAP-expressing tumours and the potential association between PET radiotracer uptake intensity and immunohistochemical FAP expression.\n\nMETHODS: This single-centre, single-arm, interventional, phase 2 trial was conducted at the University Hospital Essen, Essen, Germany. Adults aged 18 years or older undergoing initial staging or restaging were eligible if they had at least one measurable tumour lesion (>1 cm) and a confirmed or suspected diagnosis of breast cancer, colorectal cancer, endometrial cancer, oesophageal cancer, head and neck cancer, ovarian cancer, pancreatic ductal adenocarcinoma (PDAC), prostate cancer, thyroid cancer, glioma, hepatocellular carcinoma, lymphoma, multiple myeloma, non-small-cell lung cancer (NSCLC), renal cell carcinoma (RCC), sarcoma, seminoma, cancer of unknown primary origin, or other tumour types; had a planned or recent surgery or biopsy within 8 weeks before or after enrolment; and an ECOG performance status of 2 or less. Key exclusion criteria were previous external beam radiotherapy to the target lesion and receiving systemic cancer therapy within 1 month before enrolment. PET-CT images were acquired at a median of 11 min (IQR 10-14) after an intravenous injection of a median of 145 Megabecquerel (MBq; 124-154) of [68Ga]Ga-FAPI-46 and analysed by three independent, masked readers. The study concluded on day 30 of follow-up if histopathological confirmation and archived tumour tissue were already available, or on the day of biopsy or surgery within 8 weeks of receiving [68Ga]Ga-FAPI-46 PET-CT. Immunohistochemical FAP expression (score 0-3) was evaluated by an independent masked pathologist. The primary endpoint was the PPV of [68Ga]Ga-FAPI-46 PET for detecting immunohistochemical FAP-positive tumours (histopathologically confirmed) on a per-patient and per-region basis, with a predefined threshold of PPV of at least 75%, analysed in the intention-to-treat population. This study is registered with ClinicalTrials.gov, NCT05160051, and is complete.\n\nFINDINGS: Between Dec 1, 2021, and Feb 6, 2024, 158 eligible participants were enrolled and three were excluded. 98 (63%) of 155 participants who received [68Ga]Ga-FAPI-46 PET-CT were male and 57 (37%) were female. One (1%) participant was African, two (1%) were Asian, and 152 (98%) were White. The median age of participants was 62 years (IQR 55-70). The median follow-up was 29 days (29-30). The patient-based PPV of [68Ga]Ga-FAPI-46 PET for detecting FAP-positive tumours based on immunohistochemical FAP staining was 90% (95% CI 84-95) and region-based PPV was 92% (85-96) in 127 (88%) of 144 participants with histopathological validation. Five (6%) of 90 adverse events were classified as possibly related to [68Ga]Ga-FAPI-46. Seven (8%) adverse events were serious, none related to [68Ga]Ga-FAPI-46. One participant died due to disease progression.\n\nINTERPRETATION: These results confirm the safety and potential of [68Ga]Ga-FAPI-46 PET as an imaging biomarker for the detection of FAP-expressing tumours. Further studies are warranted to refine the specificity and define the role of [68Ga]Ga-FAPI-46 PET in clinical practice.\n\nFUNDING: SOFIE Biosciences."
    },
    {
      "pmid": "40774040",
      "doi": "10.1016/j.lungcan.2025.108683",
      "title": "Intracranial activity of sotorasib vs docetaxel in pretreated KRAS G12C-mutated advanced non-small cell lung cancer from a global, phase 3, randomized controlled trial.",
      "journal": "Lung cancer (Amsterdam, Netherlands)",
      "pubdate": "2025-09-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article",
        "Randomized Controlled Trial",
        "Multicenter Study"
      ],
      "entity": "NSCLC",
      "trial_type": "RCT",
      "study_class": "Prospective",
      "category_key": "lc",
      "category_label": "Lungenkrebs – Studien",
      "is_oa": true,
      "oa_url": "https://doi.org/10.1016/j.lungcan.2025.108683",
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40774040/",
      "url_doi": "https://doi.org/10.1016/j.lungcan.2025.108683",
      "abstract": "OBJECTIVES: To assess the efficacy and safety of sotorasib in patients with brain metastases using data from the phase 3 CodeBreaK 200 study, which evaluated sotorasib in adults with pretreated advanced or metastatic KRAS G12C-mutated non-small cell lung cancer (NSCLC).\n\nMATERIALS AND METHODS: Patients with KRAS G12C-mutated NSCLC who progressed after platinum-based chemotherapy and checkpoint inhibitor therapy were randomized 1:1 to sotorasib or docetaxel. An exploratory post-hoc analysis evaluated central nervous system (CNS) progression-free survival (PFS) and time to CNS progression in patients with treated and stable brain metastases at baseline. Measures were assessed by blinded independent central review per study-modified Response Assessment in Neuro-Oncology Brain Metastases (RANO-BM) criteria.\n\nRESULTS: Of the patients randomly assigned to receive sotorasib (n=171) or docetaxel (n=174), baseline CNS metastases were present in 40 (23%) and 29 (17%) patients, respectively. With a median follow-up of 20.0 months for this patient subgroup, median CNS PFS was longer with sotorasib compared with docetaxel (9.6 vs 4.5 months; hazard ratio, 0.43 [95% CI, 0.20-0.92]; P=0.02). Among patients with baseline treated CNS lesions of ≥10 mm, the percentage of patients who achieved CNS tumor shrinkage of ≥30% was two-fold higher with sotorasib than docetaxel (33.3% vs 15.4%). Treatment-related adverse events among patients with CNS lesions at baseline were consistent with those of the overall study population.\n\nCONCLUSIONS: These results suggest intracranial activity with sotorasib complements the overall PFS benefit observed with sotorasib vs docetaxel, with safety outcomes similar to those in the general CodeBreaK 200 population.\n\nCLINICAL TRIALS REGISTRATION NUMBER: NCT04303780."
    },
    {
      "pmid": "40774039",
      "doi": "10.1016/j.lungcan.2025.108699",
      "title": "Unlocking the potential: tissue mutation abundance as a predictor for third-generation EGFR-TKI efficacy in NSCLC.",
      "journal": "Lung cancer (Amsterdam, Netherlands)",
      "pubdate": "2025-09-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Preclinical",
      "category_key": "lc",
      "category_label": "Lungenkrebs – Studien",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40774039/",
      "url_doi": "https://doi.org/10.1016/j.lungcan.2025.108699",
      "abstract": "BACKGROUND: Third-generation epidermal growth factor receptor (EGFR) tyrosine kinase inhibitors (TKIs) are recommended as first-line treatment for patients with unresectable non-small cell lung cancer (NSCLC) with EGFR-sensitive mutations, but few studies have explored the role of tissue mutation abundance in predicting their efficacy. To optimize targeted treatments, this study compares the efficacy of first-line third-generation EGFR-TKIs in unresectable NSCLC patients with EGFR-sensitive mutations, focusing on tissue mutation abundance.\n\nMETHODS: The study retrospectively analyzed clinical data from 697 patients, ultimately including 159 after screening. Differences in treatment response and median progression-free survival (mPFS) between these groups were examined, and risk factors for mPFS were identified through univariate and multivariate analyses. The disease progression patterns of the two groups were also compared.\n\nRESULTS: There was no notable difference in complete and partial response rates between the groups. However, the high-abundance group had significantly higher objective response rate (88 % vs. 66.7 %, p = 0.032) and disease control rates (97.2 % vs. 80.4 %, p < 0.001). The mPFS was also longer in the high-abundance group (22 months vs. 17 months, p = 0.024). In the high-abundance group, factors like mutation site, metastasis types and co-existing PI3KCA mutations affected mPFS in univariate analysis, but not in multivariate analysis. In the low-abundance group, ECOG PS and tumor site influenced mPFS. Both groups showed similar patterns of disease progression, including in situ tumor, visceral, bone, and brain metastasis, without statistical significance.\n\nCONCLUSIONS: In unresectable NSCLC with EGFR-sensitive mutations, tissue mutation abundance predicts the efficacy of third-generation TKIs. Patients with high mutation abundance consistently experience longer mPFS. Those with low abundance and peripheral lung cancer also have relatively long mPFS, but other low abundance cases show quick resistance and progression. Further research is needed to create more precise, personalized treatments for these patients."
    },
    {
      "pmid": "40763415",
      "doi": "10.1016/j.lungcan.2025.108678",
      "title": "Associations between progastrin-releasing peptide (ProGRP) and neuron-specific enolase (NSE) and survival in patients with limited-stage small cell lung cancer (LS SCLC) receiving chemoradiotherapy (CRT).",
      "journal": "Lung cancer (Amsterdam, Netherlands)",
      "pubdate": "2025-09-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article",
        "Randomized Controlled Trial"
      ],
      "entity": "SCLC",
      "trial_type": "RCT",
      "study_class": "Prospective",
      "category_key": "lc",
      "category_label": "Lungenkrebs – Studien",
      "is_oa": true,
      "oa_url": "https://www.lungcancerjournal.info/article/S0169-5002(25)00570-7/pdf",
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40763415/",
      "url_doi": "https://doi.org/10.1016/j.lungcan.2025.108678",
      "abstract": "BACKGROUND: There are no established biomarkers for predicting outcomes of chemoradiotherapy (CRT) in limited-stage small cell lung cancer (SCLC). Progastrin-releasing peptide (ProGRP) is a more sensitive and specific biomarker of SCLC than neuron-specific enolase (NSE). We investigated whether ProGRP was associated with treatment outcomes in a randomized phase II trial of LS SCLC (n = 170).\n\nMETHODS: Patients received platinum-etoposide chemotherapy and were randomized to receive twice-daily (BID) thoracic radiotherapy (TRT) of either 45 Gy or 60 Gy. Patients commencing TRT with baseline measurements of ProGRP and NSE were eligible for this study.\n\nRESULTS: We analyzed 89 patients. Median age was 65 years, 56.2 % were female, 89.9 % had performance status 0-1, and 85.4 % had stage III disease. At baseline, 79.8 % had elevated ProGRP and 58.4 % elevated NSE. After CRT, 23.6 % had elevated ProGRP and 5.6 % elevated NSE. Patients with elevated ProGRP at baseline had shorter PFS (median 12.2 months vs. not reached [NR], p = 0.006) and OS (median 29.3 months vs. NR, p = 0.001) than patient. Similarly, elevated ProGRP after CRT was associated with shorter PFS (median 11.1 months vs. NR, p = 0.006) and OS (median 30.6 months vs. NR, p = 0.002). Patients with elevated baseline ProGRP but normalized ProGRP after CRT had longer PFS (median 49.3 months vs. 7.8 months, p = 0.003) and OS (median NR vs. 30.5, p < 0.001) than patients with persistently elevated ProGRP. All associations remained significant in multivariable analyses. NSE was not associated with PFS or OS.\n\nCONCLUSION: ProGRP levels at baseline and after CRT were associated with PFS and OS in patients with LS SCLC."
    },
    {
      "pmid": "40763414",
      "doi": "10.1016/j.lungcan.2025.108700",
      "title": "Immune checkpoint inhibitors for advanced non-small cell lung cancer with preexisting COPD and CT-defined emphysema: A systematic review and meta-analysis.",
      "journal": "Lung cancer (Amsterdam, Netherlands)",
      "pubdate": "2025-09-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article",
        "Meta-Analysis"
      ],
      "entity": "NSCLC",
      "trial_type": "Review/Meta",
      "study_class": "Review",
      "category_key": "lc",
      "category_label": "Lungenkrebs – Studien",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40763414/",
      "url_doi": "https://doi.org/10.1016/j.lungcan.2025.108700",
      "abstract": "BACKGROUND: Preexisting chronic obstructive pulmonary disease(COPD) and Computed Tomography(CT)-defined emphysema are associated with worse prognosis in patients with non-small cell lung cancer(NSCLC) receiving chemotherapy, but the impact of these comorbidities on patients undergoing immune checkpoint inhibitors(ICIs) remains largely unclear.\n\nMETHODS: Studies on the safety and efficacy outcomes among advanced NSCLC with preexisting COPD and CT-defined emphysema receiving ICIs from various databases up to August 2024 were collected. The number of events, as well as pooled effect size [odds ratio(OR) and hazard ratio (HR)] and 95% confidence intervals (CIs) were obtained.\n\nRESULTS: A total of 21 studies (7 on efficacy, 11 on safety, and 3 on both) were included. Meta-analysis revealed the pooled overall response rate (ORR) and pooled disease control rate (DCR) were 38% and 62%, respectively. Compared to patients without preexisting COPD and CT-defined emphysema, the pooled OR for ORR and DCR was 1.88 (95% CI, 1.45-2.44) and 2.23 (95% CI, 1.67-2.98), without heterogeneity. COPD and CT-defined emphysema were also associated with better progression-free survival (HR, 0.63 [95% CI, 0.50-0.80]) and overall survival (HR, 0.59 [95% CI, 0.41-0.88]). The pooled incidences of any grade and grade 3 or higher checkpoint inhibitor-related pneumonitis (CIP) were 20% and 6% in patients with preexisting COPD and CT-defined emphysema, which was significantly higher than that in those without these comorbidities (OR, 1.97 [95% CI, 1.41-2.76]; OR, 2.52 [95% CI, 1.72-3.70]). Moreover, most cases of CIP (84.0%) improved with ICIs discontinuation and/or the administration of corticosteroids.\n\nCONCLUSION: Preexisting COPD and CT-defined emphysema were associated with favorable clinical efficacy and increased risk of CIP in the immunotherapy era. Most cases of CIP are treatable and manageable."
    },
    {
      "pmid": "40763413",
      "doi": "10.1016/j.lungcan.2025.108685",
      "title": "Global, regional, and national economic consequences of tracheal, bronchial, and lung cancer.",
      "journal": "Lung cancer (Amsterdam, Netherlands)",
      "pubdate": "2025-09-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "category_key": "lc",
      "category_label": "Lungenkrebs – Studien",
      "is_oa": true,
      "oa_url": "https://www.lungcancerjournal.info/article/S0169-5002(25)00577-X/pdf",
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40763413/",
      "url_doi": "https://doi.org/10.1016/j.lungcan.2025.108685",
      "abstract": "BACKGROUND: Quantifying the macroeconomic impact of tracheal, bronchial, and lung cancers (lung cancer) is crucial for guiding resource allocation, given rising global incidence, aging populations, and constraints in low- and middle-income countries (LMICs). This study evaluated the global, regional, and national macroeconomic burden of lung cancer in 2021.\n\nMETHODS: Disability-adjusted life years (DALYs) data came from the Global Burden of Disease (GBD) 2021 study. Gross Domestic Product (GDP) data, adjusted for Purchasing Power Parity (PPP), were sourced from the World Bank. The macroeconomic burden was estimated using the Value of Lost Welfare (VLW) approach, integrating DALYs with the Value of Statistical Life (VSL) extrapolated from US data, assuming income elasticity (IE) of 1.0. Results are in 2021 international dollars (USD), PPP-adjusted.\n\nRESULTS: Globally, lung cancer caused a VLW of United States Dollars (USD) 167.36 billion (0.17% of global GDP). Males bore a higher burden (USD 107.85 billion, 0.11% GDP) than females (USD 59.52 billion, 0.06% GDP). The VLW/GDP ratio was highest in Southeast Asia, East Asia, and Oceania (USD 54.82 billion, 2.62% regional GDP). Tobacco was the leading risk factor, contributing 105.2 billion USD (63%) of global VLW, followed by air pollution (22.9 billion) and occupational risks (27.6 billion).\n\nCONCLUSION: This quantitative analysis demonstrates that lung cancers impose a significant global macroeconomic burden, with pronounced disparities across sexes (disproportionately affecting males) and geographic regions. These findings underscore the imperative to prioritize evidence-based interventions-particularly tobacco control in high-burden areas-to optimize resource allocation and improve patient prognosis worldwide.Key limitations include reliance on model-based VSL estimates (extrapolated from U.S. data) and the assumption of constant income elasticity (IE = 1.0); generalizability may be constrained by cross-country variations in willingness-to-pay and data availability, particularly in LMICs."
    },
    {
      "pmid": "40752090",
      "doi": "10.1016/j.lungcan.2025.108684",
      "title": "Comprehensive first-in-human phase I/II study of FHND-9041 in patients with EGFR-mutated advanced non-small cell lung cancer.",
      "journal": "Lung cancer (Amsterdam, Netherlands)",
      "pubdate": "2025-09-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article",
        "Multicenter Study"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Other",
      "category_key": "lc",
      "category_label": "Lungenkrebs – Studien",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40752090/",
      "url_doi": "https://doi.org/10.1016/j.lungcan.2025.108684",
      "abstract": "INTRODUCTION: FHND-9041 is a novel third-generation EGFR tyrosine kinase inhibitor (EGFR-TKI). This first-in-human study is a single-arm, multi-center, open-label, non-randomized phase Ⅰ/II trial that aims to evaluate the tolerability, safety, pharmacokinetics, and anti-tumor activity of FHND-9041 in patients with EGFR-mutated non-small cell lung cancer (NSCLC).\n\nMETHODS: The phase I study enrolled 87 patients with previously-treated EGFR T790M-positive NSCLC. The dose escalation study was conducted at doses of 40, 80, 120, and 180 mg/day, with an expansion of 36 and 39 patients in the 80 mg and 120 mg dose groups, respectively, to evaluate safety and pharmacokinetics. With 80 mg QD as the recommended phase II dose, the phase II study assessed the efficacy and safety of FHND-9041 as first-line treatment in 37 treatment-naive patients.\n\nRESULTS: No dose-limiting toxicity was observed, and the maximum tolerated dose was not identified within the 40 - 180 mg dose range. Pharmacokinetic data indicated dose-proportional exposure up to 120 mg, with a plateau at 120 mg. The phase II study revealed an objective response rate of 62.2 % (23/37 evaluable patients) with a median progression-free survival of 15.5 months (95 % CI, 12.9 - 18.1). The most common adverse events were decreased white blood cell count (22.6 %) and diarrhea (21.8 %). Treatment-related grade 3/4 adverse events included decreased white blood cell count (11.3 %) and liver impairment (4.8 %).\n\nCONCLUSIONS: FHND-9041 exhibits favorable safety and efficacy profile, supporting its further clinical development for EGFR-mutated advanced NSCLC."
    },
    {
      "pmid": "40749261",
      "doi": "10.1016/j.lungcan.2025.108681",
      "title": "Robotic-assisted bronchoscopy for histopathologic subtyping of primary lung adenocarcinoma.",
      "journal": "Lung cancer (Amsterdam, Netherlands)",
      "pubdate": "2025-09-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "category_key": "lc",
      "category_label": "Lungenkrebs – Studien",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40749261/",
      "url_doi": "https://doi.org/10.1016/j.lungcan.2025.108681",
      "abstract": "BACKGROUND: The identification of high-grade patterns and mucinous features of invasive primary lung adenocarcinoma on biopsy specimens can have implications on therapeutic decisions across all stages of disease. Shape sensing robotic-assisted bronchoscopy (ssRAB) is an emerging modality for the concomitant diagnosis and staging of lung cancer. We evaluated the performance of ssRAB for adenocarcinoma pattern identification, and particularly high-grade patterns, as well as the histopathologic concordance between biopsy and surgical resection specimens.\n\nMETHODS: Patients with lung adenocarcinoma diagnosed via ssRAB forceps or cryobiopsy specimens between October 2019 and December 2023 were included in the analysis. Biopsy specimens were evaluated for the identification of histopathologic patterns and mucinous features. A generalized linear mixed model quantified the association between pre- and intra-operative factors and successful pattern identification on biopsy. The concordance between high-grade patterns and mucinous features on ssRAB-acquired biopsy and poorly differentiated grade and mucinous features on subsequent surgical resection was determined.\n\nRESULTS: A total of 242 ssRAB-acquired specimens were included in the final analysis. The biopsy specimen was sufficient to identify adenocarcinoma histopathologic patterns in 71 %. In a multivariable analysis, sampling by cryobiopsy was positively associated with pattern identification (OR 3.54, CI: 1.02-12.30; P = 0.04), as compared with forceps biopsy. A corresponding surgical resection specimen was available in 66 cases. The sensitivity, specificity, positive, and negative predictive values of biopsy were 63, 72, 61, and 74 %, respectively for the presurgical detection of poorly differentiated adenocarcinoma, and 87, 100, 100, and 96 %, respectively for the presurgical detection of mucinous features.\n\nCONCLUSION: This study is the first to report the performance of ssRAB-acquired biopsy for identification of adenocarcinoma patterns and its concordance with surgical resection. Our findings align with those previously reported for percutaneous lung biopsy. ssRAB emerges as a viable tool for the identification of adenocarcinoma patterns. Future studies are needed to confirm these findings in larger patient cohorts."
    },
    {
      "pmid": "40749260",
      "doi": "10.1016/j.lungcan.2025.108680",
      "title": "Biomarker landscape in advanced NSCLC: insights from a national prospective registry.",
      "journal": "Lung cancer (Amsterdam, Netherlands)",
      "pubdate": "2025-09-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": "Prospective (non-RCT)",
      "study_class": "Prospective",
      "category_key": "lc",
      "category_label": "Lungenkrebs – Studien",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40749260/",
      "url_doi": "https://doi.org/10.1016/j.lungcan.2025.108680",
      "abstract": "OBJECTIVES: The determination of actionable genes is a necessity in lung cancer for proper care practice. The Spanish Lung Cancer Group (Fundación GECP) has performed an exploratory analysis of this aspect, specifically in stage IV non-small cell lung cancer (NSCLC).\n\nMATERIALS AND METHODS: The Thoracic Tumor Registry (TTR) is a Spanish prospective, observational cohort study. At the time of data extraction (March 2024), 27,399 patients were enrolled from 82 hospitals.\n\nRESULTS: There were 13,583 patients with stage IV NSCLC. The analysis of at least one tumor marker was performed in 85.7 % of non-squamous and 62.8 % of squamous patients (p-value < 0.001), with differences between autonomous communities. In the non-squamous population, the three most frequently analysed markers were EGFR (77.3 %), ALK (66.1 %) and PD-L1 (56.3 %). Biomarker profiling has undergone a more pronounced and extensive development in squamous histology in recent years. Molecular determinations that do not have a generally approved targeted therapy have also increased. Biomarker testing in patients with ECOG PS 2 is lower compared to ECOG PS < 2 (77.6 % vs 82.6 %, p-value < 0.001). Sub-analysis shows rates also vary by hospital size.\n\nCONCLUSION: The analysis of tumor markers in stage IV NSCLC patients continues to increase in Spain, at the same level as in Europe o USA, despite the absence of national plans. There are clinically guided determinations that are rare in squamous histology but have an appreciable percentage of positivity. Even in patients with ECOG PS2, biomarker testing with high clinical suspicion should be considered.\n\nCLINICAL TRIAL REGISTRATION: NCT02941458."
    },
    {
      "pmid": "40749259",
      "doi": "10.1016/j.lungcan.2025.108671",
      "title": "Definition of resectable stage III non-small cell lung cancer: A systematic review from EORTC lung cancer group.",
      "journal": "Lung cancer (Amsterdam, Netherlands)",
      "pubdate": "2025-09-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Other",
      "category_key": "lc",
      "category_label": "Lungenkrebs – Studien",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40749259/",
      "url_doi": "https://doi.org/10.1016/j.lungcan.2025.108671",
      "abstract": "BACKGROUND: Stage III non-small cell lung cancer (NSCLC) is a heterogenous disease requiring a multimodality treatment approach. For resectable stage III NSCLC, treatments incorporating surgery might be beneficial, however, a definition on resectable disease is lacking. The European Organization for the Treatment and Research of Cancer (EORTC) Lung Cancer Group initiative aims to provide a uniform definition of resectable stage III NSCLC. As part of this initiative, we conducted a systematic review to identify definitions on resectability; the medical specialties involved for making the decision and the required work-up aiding the decision.\n\nMETHODOLOGY: Studies were included if they provided data or definitions on resectability in stage III NSCLC and were published in English, Dutch, or French between 2005- 2022.\n\nRESULTS: Out of 70 eligible articles, 46 provided tumour characteristics determining resectability. Factors against resection included: N3 or bulky N2 disease and locally invasive tumours. Factors favouring resection included N2-single station involvement and cT3N1. It remained unclear whether N2-multiple station and cT4N0-1 without invasion were defined as resectable. A multidisciplinary board including a thoracic surgeon, a medical (pneumo)oncologist and a radiation oncologist were involved in the decision in 95% of studies. PET-CT was considered standard in 70% and brain MRI/CT in 89% of the studies. A pathological mediastinal nodal confirmation was mandatory in 80% of the studies.\n\nCONCLUSIONS: This systematic literature review highlights tumour characteristics related to resectability, the specialties responsible for the decision and the most appropriate staging work-up in stage III NSCLC."
    },
    {
      "pmid": "40856114",
      "doi": "10.1002/cncr.70060",
      "title": "Clinical strategies for lung cancer management: Recommendations from the Bridging the Gaps Lung Cancer Consensus Conference 2024.",
      "journal": "Cancer",
      "pubdate": "2025-09-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article",
        "Consensus Development Conference",
        "Review"
      ],
      "entity": "Thoracic-other",
      "trial_type": "Review/Meta",
      "study_class": "Review",
      "category_key": "lc",
      "category_label": "Lungenkrebs – Studien",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40856114/",
      "url_doi": "https://doi.org/10.1002/cncr.70060",
      "abstract": "Clinical practice guidelines for nonsmall cell lung cancer (NSCLC) and small cell lung cancer include recommendations based on high-level clinical trial evidence, but complex clinical questions are frequently seen in real-world practice that are not clearly answered by prospective trial data. To address these questions, the Bridging the Gaps Lung Cancer Consensus Conference 2024 (BtG LCCC 2024) convened to develop US-focused expert guidance for clinical situations in which level 1 evidence is lacking. At BtG LCCC 2024, a multidisciplinary expert panel discussed ongoing clinical issues in small cell lung cancer management, targeted therapy in EGFR-mutated NSCLC, management of early stage NSCLC, identification and management of non-EGFR oncogene-driven NSCLC, and use of immunotherapy in advanced/metastatic NSCLC. By using a modified Delphi process, 12 consensus recommendations were developed with the goal of providing guidance on the use of novel diagnostic methods and treatments for clinicians who manage lung cancer. This report reviews these areas of consensus and discusses ongoing questions about ways to apply current clinical evidence."
    },
    {
      "pmid": "40554973",
      "doi": "10.1016/j.compbiomed.2025.110665",
      "title": "From BERT to generative AI - Comparing encoder-only vs. large language models in a cohort of lung cancer patients for named entity recognition in unstructured medical reports.",
      "journal": "Computers in biology and medicine",
      "pubdate": "2025-09-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Preclinical",
      "category_key": "lc",
      "category_label": "Lungenkrebs – Studien",
      "is_oa": true,
      "oa_url": "https://publica.fraunhofer.de/handle/publica/489295",
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40554973/",
      "url_doi": "https://doi.org/10.1016/j.compbiomed.2025.110665",
      "abstract": "BACKGROUND: Extracting clinical entities from unstructured medical documents is critical for improving clinical decision support and documentation workflows. This study examines the performance of various encoder and decoder models trained for Named Entity Recognition (NER) of clinical parameters in pathology and radiology reports, highlighting the applicability of Large Language Models (LLMs) for this task.\n\nMETHODS: Three NER methods were evaluated: (1) flat NER using transformer-based models, (2) nested NER with a multi-task learning setup, and (3) instruction-based NER utilizing LLMs. A dataset of 2013 pathology reports and 413 radiology reports, annotated by medical students, was used for training and testing.\n\nRESULTS: The performance of encoder-based NER models (flat and nested) was superior to that of LLM-based approaches. The best-performing flat NER models achieved F1-scores of 0.87-0.88 on pathology reports and up to 0.78 on radiology reports, while nested NER models performed slightly lower. In contrast, multiple LLMs, despite achieving high precision, yielded significantly lower F1-scores (ranging from 0.18 to 0.30) due to poor recall. A contributing factor appears to be that these LLMs produce fewer but more accurate entities, suggesting they become overly conservative when generating outputs.\n\nCONCLUSION: LLMs in their current form are unsuitable for comprehensive entity extraction tasks in clinical domains, particularly when faced with a high number of entity types per document, though instructing them to return more entities in subsequent refinements may improve recall. Additionally, their computational overhead does not provide proportional performance gains. Encoder-based NER models, particularly those pre-trained on biomedical data, remain the preferred choice for extracting information from unstructured medical documents."
    },
    {
      "pmid": "40345491",
      "doi": "10.1016/j.jtho.2025.04.016",
      "title": "Treatment Sequences in BRAF-V600-Mutated NSCLC: First-Line Targeted Therapy Versus First-Line (Chemo-) Immunotherapy.",
      "journal": "Journal of thoracic oncology : official publication of the International Association for the Study of Lung Cancer",
      "pubdate": "2025-09-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Other",
      "category_key": "lc",
      "category_label": "Lungenkrebs – Studien",
      "is_oa": true,
      "oa_url": "https://doi.org/10.1016/j.jtho.2025.04.016",
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40345491/",
      "url_doi": "https://doi.org/10.1016/j.jtho.2025.04.016",
      "abstract": "BACKGROUND: Targeted treatment of patients with metastatic BRAF-V600-mutated NSCLC using BRAF/MEK-inhibitors is effective but limited by acquired resistance. Patients with BRAF-mutant NSCLC may derive long-lasting benefit from immune checkpoint inhibition with programmed death-1/programmed death-ligand 1 (PD-L1) antibodies (immuno-oncology [IO]). Although IO is the preferred first-line therapy in BRAF-mutated melanoma, the optimal treatment sequence in BRAF-mutated NSCLC is not defined.\n\nMETHODS: This retrospective study investigated the clinical outcome of patients with metastatic BRAF-V600-mutated NSCLC diagnosed in the German national Network Genomic Medicine Lung Cancer.\n\nRESULTS: We identified 205 patients with BRAF-V600-mutated NSCLC; 175 patients received first-line therapy with dabrafenib/trametinib (DAB/TRM, 65.1%), IO alone (19.4%), or chemotherapy-IO (15.4%). Overall survival (OS) and time-to-treatment failure of first-line therapy was identical for patients receiving first-line DAB/TRM (median OS 28.0 months) or chemo/IO (27.8 months, hazard ratio [HR] 1.1, p = 0.68). Female patients had superior OS (HR 0.65, p = 0.049, confirmed in multivariate model), which was mainly driven by superior OS of female to that of male patients receiving first-line DAB/TRM (OS HR 0.53, p = 0.015). There was no sex difference in survival of patients receiving IO-based first-line treatment (OS HR 1.02). Surprisingly, high PD-L1 status (tumor proportion score ≥50%) was associated with shortened time-to-treatment failure in first-line treatment (HR 1.83, p = 0.002, confirmed in multivariate models adjusting for sex; OS with nonsignificant trend, HR 1.4), regardless of whether the first-line regimen was IO-based or targeted therapy.\n\nCONCLUSIONS: Targeted or IO-based first-line treatment of BRAF-V600-mutated NSCLC has similar survival outcomes. Sex and PD-L1 status may support decision-making at the individual patient level."
    },
    {
      "pmid": "40173271",
      "doi": "10.1164/rccm.202501-0028OC",
      "title": "Oscillometry-defined Small Airway Dysfunction in Tobacco-exposed Adults with Impaired or Preserved Airflow.",
      "journal": "American journal of respiratory and critical care medicine",
      "pubdate": "2025-09-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Other",
      "trial_type": null,
      "study_class": "Other",
      "category_key": "lc",
      "category_label": "Lungenkrebs – Studien",
      "is_oa": true,
      "oa_url": "https://doi.org/10.1164/rccm.202501-0028oc",
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40173271/",
      "url_doi": "https://doi.org/10.1164/rccm.202501-0028OC",
      "abstract": "Rationale: Small airway dysfunction (SAD) is a key feature of chronic obstructive pulmonary disease and might present in tobacco-exposed adults with normal spirometry. So far, the role of oscillometry-defined SAD in this population is largely unexplored. Objective: To investigate the prevalence of oscillometry-defined SAD and its associations with airway structural changes, quality of life (QoL), metabolic disease, and cardiovascular disease (CVD) in tobacco-exposed adults with impaired airflow or preserved airflow (PA). Methods: In a subcohort (n = 1,628) nested within a lung cancer screening trial, we assessed airway disease using pre-bronchodilator spirometry, oscillometry, and artificial intelligence-powered computed tomography. Impaired airflow included airflow obstruction (AFO) and preserved ratio impaired spirometry (PRISm). Subjects with PA, defined as FEV1 and FEV1:FVC greater than the lower limit of normal, were further stratified as PA with SAD (PA-SAD) or normal lung function. SAD was defined as the frequency dependence of resistance or reactance area greater than the upper limit of normal. Computed tomography biomarkers included airway wall thickness, luminal diameter, branch count, and emphysema. QoL was measured using the euroqol 5-dimension 5-level (EQ-5D-5L). Measurements and Main Results: The overall prevalence of SAD was 39%. SAD was present in 26% of subjects with PA and in 60% of those with impaired airflow. The frequency of AFO, PRISm, and PA-SAD was 21%, 15%, and 16%, respectively. Similar to those with impaired airflow, subjects with PA-SAD had lower EQ-5D-5L scores, greater airway wall thickness, narrower lumen, lower branch count, and higher rate of metabolic disease and CVD than those with normal lung function (P < 0.01 for all). However, they had minimal emphysema and significantly higher branch count than those with AFO. Subjects with AFO or PRISm and concurrent SAD had greater structural changes and more frequent CVD than those with AFO or PRISm alone. SAD was associated with CVD (odds ratio, 1.91 [95% confidence interval, 1.55-2.36]), even after adjusting for confounders and metabolic disease. Conclusions: SAD is highly prevalent among tobacco-exposed adults and is associated with airway structural changes, impaired QoL, and an increased rate of CVD, even among those with PA. PA-SAD is distinct from AFO by its preserved airway count and minimal emphysema."
    },
    {
      "pmid": "40890128",
      "doi": "10.1038/s41467-025-62350-4",
      "title": "High-fidelity Cas9-mediated targeting of KRAS driver mutations restrains lung cancer in preclinical models.",
      "journal": "Nature communications",
      "pubdate": "2025-09-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Preclinical",
      "category_key": "lc",
      "category_label": "Lungenkrebs – Studien",
      "is_oa": true,
      "oa_url": "https://www.nature.com/articles/s41467-025-62350-4.pdf",
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40890128/",
      "url_doi": "https://doi.org/10.1038/s41467-025-62350-4",
      "abstract": "Missense mutations in the 12th codon of KRAS are key drivers of lung cancer, with glycine-to-cysteine (G12C) and glycine-to-aspartic acid (G12D) substitutions being among the most prevalent. These mutations are strongly associated with poor survival outcomes. Given the critical role of KRAS in lung cancer and other cancers, it remains as a major target for the development of new and complementary treatments. We have developed a CRISPR-High Fidelity (HiFi)-Cas9-based therapy strategy that can effectively and specifically target KRASG12C and KRASG12D mutants, avoiding KRASWT off-targeting and affecting KRAS downstream pathways, thereby significantly reducing tumorgenicity. The delivery of HiFiCas9 components via ribonucleoprotein particles (RNPs) and adenovirus (AdV) effectively abrogates cell viability in KRAS-mutant Non-Small Cell Lung Cancer (NSCLC) preclinical models, including 2D and 3D cell cultures, cell-derived xenografts (CDX), and patient-derived xenograft organoids (PDXO). Our in vitro studies demonstrate that HiFiCas9-based therapy achieves superior KRAS inhibition compared to Sotorasib and effectively circumvents certain resistance mechanisms associated with Sotorasib treatment. Moreover, in vivo delivery using adenoviral particles significantly suppresses tumor growth in preclinical NSCLC models. Collectively, our findings establish HiFiCas9 as an effective therapeutic strategy with promising clinical applications, especially if in vivo delivery methods are further optimized."
    },
    {
      "pmid": "40877204",
      "doi": "10.1002/cnr2.70330",
      "title": "Etirinotecan Pegol (NKTR-102) in Patients With Active Brain Metastases From Lung or Breast Cancer.",
      "journal": "Cancer reports (Hoboken, N.J.)",
      "pubdate": "2025-09-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "category_key": "lc",
      "category_label": "Lungenkrebs – Studien",
      "is_oa": true,
      "oa_url": "https://onlinelibrary.wiley.com/doi/pdfdirect/10.1002/cnr2.70330",
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40877204/",
      "url_doi": "https://doi.org/10.1002/cnr2.70330",
      "abstract": "BACKGROUND: Brain metastases are common in patients with lung and breast cancer and are associated with poor outcomes. While there is some intracranial activity with systemic therapies, most chemotherapies are minimally effective. Etirinotecan pegol (EP) is a PEGylated chemotherapy with favorable pharmacokinetics over irinotecan.\n\nMETHODS: We conducted a phase 2 trial of EP in patients with previously treated metastatic non-small cell lung cancer (NSCLC, n = 12), small cell lung cancer (SCLC, N = 3) and breast cancer (MBC, n = 12), having progressive brain metastases after brain-directed radiotherapy (or refusal). The primary endpoint was a 25% or greater disease control rate, defined as CR, PR+SD, in the central nervous system (CNS) at 12 weeks; secondary endpoints included toxicity and systemic disease control.\n\nRESULTS: The CNS control rate at 12 weeks in NSCLC and MBC was 17% (two patients in each cohort) and 0% in SCLC. The median overall progression-free survival for NSCLC was 2.7 months (95% CI: 1.3, 6.7) and MBC was 1.4 months (95% CI: 1.3, 6.9). The most common adverse events were diarrhea (48%), nausea (48%) and fatigue (26%). Six patient deaths occurred in this study. Dehydration/diarrhea (1) and neutropenic sepsis (3) from study treatment were at least possibly related to these deaths.\n\nCONCLUSION: This study demonstrates that EP did not meet the threshold of clinical efficacy in patients with refractory CNS metastases from lung or breast cancer."
    },
    {
      "pmid": "40729911",
      "doi": "10.1016/j.ecoenv.2025.118703",
      "title": "Adverse outcome pathway (AOP) framework for predicting toxic mechanisms in E-cigarette-induced lung injury.",
      "journal": "Ecotoxicology and environmental safety",
      "pubdate": "2025-09-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "category_key": "lc",
      "category_label": "Lungenkrebs – Studien",
      "is_oa": true,
      "oa_url": "https://doi.org/10.1016/j.ecoenv.2025.118703",
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40729911/",
      "url_doi": "https://doi.org/10.1016/j.ecoenv.2025.118703",
      "abstract": "This study establishes an Adverse Outcome Pathway (AOP) framework to decode pulmonary injury mechanisms induced by E-cigarette constituents, emphasizing the structural properties of propylene glycol (PG), vegetable glycerin (VG), and nicotine in driving oxidative-inflammatory cascades. Computational toxicogenomics leveraging the Comparative Toxicogenomics Database (CTD) identified 1214 chemical-gene interactions specific to PG/VG pyrolysis byproducts (formaldehyde, acrolein) and nicotine, with 83.7 % overlap with lung injury-associated genes from public repositories. Furthermore, analysis revealed Hippo pathway inhibition in lung tissues harvested from patients with lung cancer attributable to long-term smoking. Similarly, in vitro experiments revealed that exposure of bronchial epithelial cells to E-cigarette components suppressed of Hippo pathway kinases. This suppression induced the nuclear translocation of YAP/TAZ and consequently led to the hypersecretion of pro-inflammatory cytokines, including IL-6 and TNF-α. Moreover, a murine model subjected to chronic E-cigarette aerosol exposure manifested oxidative lung injury and neutrophilic infiltration. These findings collectively imply that E-cigarette exposure can induce lung injury, and upon prolonged exposure, may be associated with an increased risk of cancer development. Quantitative weight-of-evidence (QWOE) modeling delineated the following cascade: 1) PG/VG thermal degradation generates reactive carbonyls (KE1: oxidative stress), 2) nicotine synergistically amplifies inflammation (KE2: chronic inflammation), and 3) Hippo/YAP axis suppression (KE3) drives genomic instability via impaired DNA repair fidelity. This AOP framework establishes a predictive paradigm linking structural properties of nicotine delivery systems to signaling perturbations, advancing toxicity assessment for next-generation tobacco products."
    },
    {
      "pmid": "40555300",
      "doi": "10.1016/j.ejps.2025.107176",
      "title": "LPAR4-targeted dual-loaded liposome for synergistic lung cancer therapy.",
      "journal": "European journal of pharmaceutical sciences : official journal of the European Federation for Pharmaceutical Sciences",
      "pubdate": "2025-09-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "category_key": "lc",
      "category_label": "Lungenkrebs – Studien",
      "is_oa": true,
      "oa_url": "https://doi.org/10.1016/j.ejps.2025.107176",
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40555300/",
      "url_doi": "https://doi.org/10.1016/j.ejps.2025.107176",
      "abstract": "Lung cancer continues to be the primary contributor to global cancer deaths, with metastasis posing a major challenge to effective treatment. Although chemotherapy is a primary first-line intervention, its efficacy in preventing tumor dissemination is limited. This study explores a targeted therapeutic strategy by co-delivering doxorubicin (DOX), a potent chemotherapeutic, and ATN161, an integrin α5β1 antagonist, using a liposomal nanocarrier system. Integrin α5β1 is crucial in the advancement and invasion of tumors, leading its suppression a potential strategy for therapeutic approaches. Since lysophosphatidic acid receptor 4 (LPAR4) expression is minimal in normal cells, but transiently increases in tumor-initiating cells (TICs) under stress conditions, we designed LPAR4-targeted liposomes by conjugating anti-LPAR4 antibodies to their surface, enabling both active targeting of lung cancer cells and inhibition of LPAR4-induced tumor metastasis. This targeted delivery system enhances drug accumulation at tumor sites, potentiating cytotoxicity while reducing systemic toxicity. Additionally, ATN161 disrupts fibronectin-integrin interactions, thereby impairing tumor cell adhesion and metastatic progression. Collectively, our study demonstrates that LPAR4-targeted, DOX and ATN161 dual-loaded liposomes offer a promising therapeutic approach for suppressing lung cancer growth and metastasis, with potential clinical implications for improving treatment outcomes."
    },
    {
      "pmid": "40554742",
      "doi": "10.1200/JCO-24-02744",
      "title": "Patritumab Deruxtecan (HER3-DXd; MK-1022) in Non-Small Cell Lung Cancer After Platinum-Based Chemotherapy and Immunotherapy.",
      "journal": "Journal of clinical oncology : official journal of the American Society of Clinical Oncology",
      "pubdate": "2025-09-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article",
        "Multicenter Study"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Other",
      "category_key": "lc",
      "category_label": "Lungenkrebs – Studien",
      "is_oa": true,
      "oa_url": "https://doi.org/10.1200/jco-24-02744",
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40554742/",
      "url_doi": "https://doi.org/10.1200/JCO-24-02744",
      "abstract": "PURPOSE: Patritumab deruxtecan (HER3-DXd; MK-1022) is an investigational HER3-directed antibody-drug conjugate composed of a human immunoglobulin G1 monoclonal antibody to HER3 (patritumab) covalently linked via a stable tetrapeptide-based cleavable linker to a topoisomerase I inhibitor payload that has shown durable antitumor activity in previously treated patients with EGFR-mutated advanced non-small cell lung cancer (NSCLC). We extend these observations to patients with advanced NSCLC with other/no identified driver genomic alterations.\n\nMETHODS: Patients with advanced squamous or nonsquamous NSCLC without a common EGFR-activating mutation whose disease had progressed on previous therapies including platinum-based chemotherapy, immune checkpoint inhibitors, and targeted therapy (for patients with known actionable genomic alterations) received HER3-DXd 5.6 mg/kg intravenously once every 3 weeks. The primary end point was confirmed objective response rate (cORR).\n\nRESULTS: Forty-seven patients were treated with HER3-DXd (median treatment duration, 4.2 [range, 0.7-19.8] months). The cORR was 27.7% (95% CI, 15.6% to 42.6%), and the median duration of response was 8.1 (95% CI, 4.2 to not evaluable) months. The median progression-free survival was 5.5 (95% CI, 4.0 to 11.2) months, and the median overall survival was 15.2 (95% CI, 10.8 to 17.7) months. Similar efficacy was observed in patients with NSCLC harboring identified driver genomic alterations and in those without such genomic features. The rate of study drug discontinuation associated with treatment-emergent adverse events (TEAEs) was 12.8%. Study drug-related grade ≥3 TEAEs occurred in 51.1% of patients and were serious in 12.8% (none were associated with death). Adjudicated treatment-related interstitial lung disease occurred in five patients (10.6%; all grade 1 or 2).\n\nCONCLUSION: The previously reported efficacy and safety of HER3-DXd in heavily pretreated patients with EGFR-mutated NSCLC are also observed in those with other NSCLC subtypes and warrant further clinical evaluation."
    },
    {
      "pmid": "40498298",
      "doi": "10.1007/s40487-025-00350-6",
      "title": "Impact of Tumor Response and Response Duration on Survival Among Participants Receiving Pembrolizumab Plus Chemotherapy as First-Line Therapy for Non-Small-Cell Lung Cancer.",
      "journal": "Oncology and therapy",
      "pubdate": "2025-09-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Preclinical",
      "category_key": "lc",
      "category_label": "Lungenkrebs – Studien",
      "is_oa": true,
      "oa_url": "https://link.springer.com/content/pdf/10.1007/s40487-025-00350-6.pdf",
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40498298/",
      "url_doi": "https://doi.org/10.1007/s40487-025-00350-6",
      "abstract": "INTRODUCTION: Response Evaluation Criteria in Solid Tumors (RECIST) is the primary tool for assessing tumor response in solid tumors. Immunotherapy elicits unique response patterns, and assessment of their contribution to overall survival (OS) is of interest. We evaluated tumor size changes (TSC) for association with OS, evaluated whether deeper response had greater association with OS than the 30% RECIST cutoff, and quantified the contribution of objective response rate (ORR) and duration of response (DOR) to OS benefit using data from KEYNOTE-189 and KEYNOTE-407 examining first-line pembrolizumab plus chemotherapy in metastatic non-small-cell lung cancer (NSCLC).\n\nMETHODS: Associations between early TSC (percentage change from baseline in sum of target lesion diameters) and OS were evaluated using recursive partitioning analyses, C-index, and time-varying receiver operating characteristic curve. Deeper response and OS associations were assessed in sensitivity analyses. Contribution of TSC, ORR, and DOR to the OS benefit of pembrolizumab plus chemotherapy (versus chemotherapy) was quantified with a proportion of treatment effect analysis. Data cutoff was May 2019.\n\nRESULTS: In total, 1175 participants were included (KEYNOTE-189, n = 616; KEYNOTE-407, n = 559). At week 12, -30% TSC had a greater association with OS than other cutoffs, which was similar to week 12 ORR. Deeper response did not have greater association with OS than the 30% RECIST cutoff. For pembrolizumab plus chemotherapy versus chemotherapy in KEYNOTE-189, the proportion of treatment effect on OS benefit for DOR coupled with ORR was higher than ORR alone (0.57 versus 0.36) or an alternative TSC cutoff (0.57 versus 0.08 for -10%, 0.09 for -20%, and 0.20 for -30%), with similar results in KEYNOTE-407 for DOR and ORR versus ORR alone (0.92 versus 0.61) or an alternative TSC cutoff (0.92 versus 0.36, 0.43, and 0.40, respectively).\n\nCONCLUSIONS: These ad hoc exploratory analyses suggest that RECIST remains a valid assessment for metastatic NSCLC treated with immunotherapy plus chemotherapy. Early responses per RECIST criteria predicted improved OS.\n\nTRIAL REGISTRATION: ClinicalTrials.gov, NCT02578680, NCT02775435."
    },
    {
      "pmid": "40674592",
      "doi": "10.1093/oncolo/oyaf217",
      "title": "ENIGMA+: a national, decentralized, remote consent study for clinical data and biospecimen collection in patients with ALK-positive advanced NSCLC.",
      "journal": "The oncologist",
      "pubdate": "2025-09-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Other",
      "category_key": "lc",
      "category_label": "Lungenkrebs – Studien",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40674592/",
      "url_doi": "https://doi.org/10.1093/oncolo/oyaf217",
      "abstract": "OBJECTIVE: Despite advances in ALK inhibitors for ALK fusion-positive (ALK+) non-small-cell lung cancer (NSCLC), drug resistance remains a challenge. Studies of treatment outcomes and resistance biomarkers are imperative for drug development, yet patient representation can be limited. This study evaluated the feasibility of a decentralized research infrastructure to establish a clinical and biospecimen repository, broadening patient access and inclusion.\n\nPATIENTS AND METHODS: Patients with advanced ALK+ NSCLC across the United States were enrolled through remote informed consent. Clinical history and tumor molecular profiling data were collected at baseline and during remote follow-ups. Archival tumor and saliva biospecimens (for germline sampling) were obtained for analysis.\n\nRESULTS: Of 87 eligible patients, 80 (92%) completed remote consent and enrolled. The clinical data collection rate was 100%, with archival tumor acquired from 80% and saliva samples from 65%. Patients represented 31 states, with 94% residing outside the study center's state and 90% receiving care elsewhere. Next-generation sequencing was conducted on 55 treatment-naïve and 18 treatment-resistant biopsies, all of whom received at least one prior second-generation ALK inhibitor, and 9 received lorlatinib. ALK resistance mutations were identified in 54% of treatment-resistant biopsies; other commonly co-altered genes included TP53 (18%) and CDKN2A/B (16%).\n\nCONCLUSIONS: This study highlights the feasibility of a decentralized design to enhance the inclusion of a broader patient population with ALK+ NSCLC. This establishes a scalable framework that may help overcome barriers to patient participation in research, with the goal of improving therapy development and patient outcomes. The Elucidating Novel Immune and Genomic Markers for ALK+ study accrual and analysis continue (NCT04881916)."
    },
    {
      "pmid": "40542959",
      "doi": "10.1007/s12325-025-03259-8",
      "title": "Matching-Adjusted Indirect Comparison of Sotorasib Versus Adagrasib in Previously Treated Advanced/Metastatic Non-Small Cell Lung Cancer Harboring KRAS G12C Mutation.",
      "journal": "Advances in therapy",
      "pubdate": "2025-09-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Other",
      "category_key": "lc",
      "category_label": "Lungenkrebs – Studien",
      "is_oa": true,
      "oa_url": "https://link.springer.com/content/pdf/10.1007/s12325-025-03259-8.pdf",
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40542959/",
      "url_doi": "https://doi.org/10.1007/s12325-025-03259-8",
      "abstract": "INTRODUCTION: Sotorasib and adagrasib are the only treatments approved in the USA and Europe for advanced/metastatic KRAS G12C-mutated non-small cell lung cancer (NSCLC). In the absence of head-to-head trials, a matching-adjusted indirect comparison (MAIC) was conducted to assess the relative efficacy and safety of sotorasib versus adagrasib using phase 3 trials.\n\nMETHODS: Patient-level data from CodeBreaK 200 were reweighted to match the baseline characteristics reported in KRYSTAL-12. The analysis evaluated progression free-survival (PFS), objective response rate (ORR), and treatment-related adverse events (TRAE). Age, sex, region, prior treatment, brain metastases, and liver metastases were selected for adjustment in the primary analysis per clinical guidance, using an unanchored approach (no common comparator). We conducted sensitivity analyses including additional covariates or anchoring the analysis via common comparator (docetaxel). Additional subgroup analysis was performed in patients with baseline brain metastases, assessing systemic PFS.\n\nRESULTS: Following adjustment, the reweighted patient characteristics from CodeBreaK 200 and KRYSTAL-12 were well balanced. In the primary analysis, sotorasib and adagrasib showed similar efficacy: PFS (HR [hazard ratio] 0.93; 95% confidence interval [CI] 0.70-1.22; p = 0.589) and ORR (odds ratio 0.86; 95% CI 0.53-1.38; p = 0.524). Among patients with brain metastases, sotorasib demonstrated a 39% reduced risk of progression compared with adagrasib (HR 0.61; 95% CI 0.38-0.98; p = 0.040). Sotorasib also demonstrated a more favorable safety profile than adagrasib, with lower odds of TRAEs, TRAEs leading to dose reduction or dose interruption, and all eight individual TRAEs evaluated. Sensitivity analyses supported the robustness of base-case results.\n\nCONCLUSION: In this MAIC, sotorasib and adagrasib showed comparable efficacy in previously treated advanced KRAS G12C-mutated NSCLC. Among patients with baseline brain metastases, PFS point estimates favored sotorasib. Sotorasib also demonstrated a favorable overall safety profile. These findings may help inform payer decisions and clinical practice in the treatment of KRAS G12C-mutated NSCLC."
    },
    {
      "pmid": "40419140",
      "doi": "10.1016/j.jtho.2025.05.016",
      "title": "Lenvatinib Plus Pembrolizumab, Pemetrexed, and a Platinum as First-Line Therapy for Metastatic Nonsquamous NSCLC: Phase 3 LEAP-006 Study.",
      "journal": "Journal of thoracic oncology : official publication of the International Association for the Study of Lung Cancer",
      "pubdate": "2025-09-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article",
        "Randomized Controlled Trial",
        "Multicenter Study"
      ],
      "entity": "NSCLC",
      "trial_type": "RCT",
      "study_class": "Prospective",
      "category_key": "lc",
      "category_label": "Lungenkrebs – Studien",
      "is_oa": true,
      "oa_url": "https://doi.org/10.1016/j.jtho.2025.05.016",
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40419140/",
      "url_doi": "https://doi.org/10.1016/j.jtho.2025.05.016",
      "abstract": "INTRODUCTION: We present the LEAP-006 (NCT03829319) phase 3 study evaluating the addition of lenvatinib to first-line pembrolizumab plus chemotherapy in metastatic nonsquamous NSCLC.\n\nMETHODS: Adults with previously untreated stage IV nonsquamous NSCLC without targetable genetic alterations were randomized 1:1 to lenvatinib 8 mg/d or placebo once daily plus pembrolizumab 200 mg every 3 weeks with pemetrexed and carboplatin or cisplatin for 4 cycles, followed by pembrolizumab (≤35 total cycles) and pemetrexed until disease progression or intolerable toxicity. Primary end points were progression-free survival and overall survival (OS). Part 1 was an open-label safety run-in of lenvatinib plus pembrolizumab and chemotherapy; part 2 was the randomized, double-blind study.\n\nRESULTS: Participants (n = 748) were randomized to the lenvatinib (n = 375) or placebo (n = 373) arms. Median follow-up at final analysis (August 11, 2023) for OS was 36.8 months. Median (95% confidence interval [CI]) progression-free survival was 12.1 (10.4-14.1) versus 9.5 (8.3-10.7) months in the lenvatinib and placebo arms, respectively (hazard ratio, 0.88 [95% CI, 0.74-1.05]; 1-sided p = 0.07976). Median (95% CI) OS was 21.8 (18.6-24.0) versus 22.1 (19.7-24.2) months (hazard ratio, 1.05 [95% CI, 0.88-1.26]; 1-sided p = 0.70818). Grade 3 or higher treatment-related adverse events occurred in 69.7% and 55.6% of participants, respectively (grade 5, 5.6% versus 2.7%).\n\nCONCLUSIONS: Adding lenvatinib to first-line pembrolizumab plus chemotherapy did not improve efficacy versus pembrolizumab plus chemotherapy in stage IV nonsquamous NSCLC without targetable genetic alterations. There were no new safety signals. Pembrolizumab plus chemotherapy remains a standard of care for this population.\n\nTRIAL REGISTRATION: ClinicalTrials.gov (https://clinicaltrials.gov/), NCT03829319."
    },
    {
      "pmid": "40383434",
      "doi": "10.1016/j.jtho.2025.05.012",
      "title": "Amivantamab in Participants With Advanced NSCLC and MET Exon 14 Skipping Mutations: Final Results From the CHRYSALIS Study.",
      "journal": "Journal of thoracic oncology : official publication of the International Association for the Study of Lung Cancer",
      "pubdate": "2025-09-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article",
        "Multicenter Study"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Other",
      "category_key": "lc",
      "category_label": "Lungenkrebs – Studien",
      "is_oa": true,
      "oa_url": "https://doi.org/10.1016/j.jtho.2025.05.012",
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40383434/",
      "url_doi": "https://doi.org/10.1016/j.jtho.2025.05.012",
      "abstract": "INTRODUCTION: Amivantamab is an EGFR-MET bispecific antibody with immune cell-directing activity. We assessed the safety and efficacy of amivantamab in participants with advanced NSCLC harboring primary MET exon 14 skipping mutations (METex14).\n\nMETHODS: CHRYSALIS enrolled participants with METex14 NSCLC who progressed after or declined standard-of-care therapy. Participants received intravenous amivantamab weekly for 4 weeks and biweekly thereafter. Objective response rate, duration of response (DoR), clinical benefit rate, progression-free survival, overall survival, safety, and circulating tumor DNA were analyzed.\n\nRESULTS: Among 97 participants, 16 were treatment naive, 28 received prior treatment without MET therapies, and 53 received prior MET therapies. Objective response rate was 32% overall, 50% in treatment-naive participants, 46% in participants without prior MET therapies, and 19% in participants with prior MET therapies. In participants without prior MET therapies, amivantamab activity was observed regardless of co-occurring genomic alterations. Clinical benefit rate was 69% overall, 88% in treatment-naive participants, 64% in participants without prior MET therapies, and 66% in participants with prior MET therapies. Median DoR was 11.2 months; 61% (19/31) of the responders had DoR greater than or equal to 6 months. Median progression-free survival was 5.3 months (95% confidence interval, 4.3-7.0); median overall survival was 15.8 months (95% confidence interval, 14.6-not estimable). Most common adverse events were rash (79%) and infusion-related reactions (72%), most being grades 1 to 2 (52%).\n\nCONCLUSIONS: The safety profile was consistent with previous reports of amivantamab in EGFR-mutant NSCLC. Amivantamab demonstrated clinically meaningful and durable antitumor activity in participants with METex14 advanced NSCLC, including those who progressed on prior MET therapies."
    },
    {
      "pmid": "40889961",
      "doi": "10.1016/j.lungcan.2025.108719",
      "title": "Retraction notice to \"Antibody-drug conjugate components in association with the incidence of ADC-related interstitial lung disease: A systematic review and meta-analysis\". [Lung Cancer 204 (2025) 108559].",
      "journal": "Lung cancer (Amsterdam, Netherlands)",
      "pubdate": "2025-08-31T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "category_key": "lc",
      "category_label": "Lungenkrebs – Studien",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40889961/",
      "url_doi": "https://doi.org/10.1016/j.lungcan.2025.108719",
      "abstract": null
    },
    {
      "pmid": "40885709",
      "doi": "10.1038/s41419-025-07992-4",
      "title": "WEE1 inhibitor exerts synergistic effect with KRAS G12C inhibitor via MYBL2-RRM2 axis in KRAS(G12C)-mutant lung cancer.",
      "journal": "Cell death & disease",
      "pubdate": "2025-08-30T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "category_key": "lc",
      "category_label": "Lungenkrebs – Studien",
      "is_oa": true,
      "oa_url": "https://www.nature.com/articles/s41419-025-07992-4.pdf",
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40885709/",
      "url_doi": "https://doi.org/10.1038/s41419-025-07992-4",
      "abstract": "The clinical effect of KRAS G12C inhibitors (G12Ci) as monotherapy is poor, prompting the development of combination treatment strategies. Here, we demonstrate that the WEE1 kinase inhibitor (WEE1i), Adavosertib, can sensitize the effect of G12Ci through the MYBL2-RRM2 axis, which is associated with poor prognosis in lung cancer. Overexpressing the MYBL2-RRM2 axis or supplementing the products of the RRM2 enzyme, dNTPs/dNs, can partially reverse this synergistic inhibitory effect. We also observed marked effects of the combination therapy in tumor xenografts models. Collectively, these results uncover the WEE1 kinase inhibitors, some of which are available clinically, as effective enhancers for G12Ci therapy."
    },
    {
      "pmid": "40882030",
      "doi": "10.1158/0008-5472.CAN-25-0998",
      "title": "TNG260 is a Small-Molecule CoREST Inhibitor that Sensitizes STK11-Mutant Tumors to Anti-PD-1 Immunotherapy.",
      "journal": "Cancer research",
      "pubdate": "2025-08-29T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Other",
      "trial_type": null,
      "study_class": "Other",
      "category_key": "lc",
      "category_label": "Lungenkrebs – Studien",
      "is_oa": true,
      "oa_url": "https://aacrjournals.org/cancerres/article-pdf/doi/10.1158/0008-5472.CAN-25-0998/3647378/can-25-0998.pdf",
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40882030/",
      "url_doi": "https://doi.org/10.1158/0008-5472.CAN-25-0998",
      "abstract": "Non-small cell lung cancer (NSCLC) patients with loss of the tumor suppressor gene STK11 are resistant to immune checkpoint therapies like anti-PD-1. Here, we conducted an in vivo CRISPR screen that identified HDAC1 as a target to reverse anti-PD-1 resistance driven by loss of STK11 and developed TNG260, a potent small-molecule inhibitor of the CoREST complex with selectivity exceeding previously generated inhibitors in this class in preclinical studies. Treatment with TNG260 led to increased expression of immunomodulatory genes in STK11-deficient cancer cells. When combined with anti-PD-1, TNG260 induced immune-mediated stasis and/or regression in STK11-deficient syngeneic tumor models and autochthonous NSCLC models. In the tumors of patients with STK11-deficient cancers on a clinical trial (NCT05887492), treatment with a combination of TNG260 and pembrolizumab increased intratumoral histone acetylation, PD-L1 tumor proportion scores, and T cell infiltration into the tumor microenvironment. This study illustrates a promising treatment strategy for addressing immune evasion in STK11-mutant NSCLC patients."
    },
    {
      "pmid": "40880183",
      "doi": "10.1158/1078-0432.CCR-24-4342",
      "title": "Phase I Dose Escalation Trial Combining Olaparib and Thoracic Radiation Therapy in Extensive-Stage Small Cell Lung Cancer.",
      "journal": "Clinical cancer research : an official journal of the American Association for Cancer Research",
      "pubdate": "2025-08-29T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "SCLC",
      "trial_type": null,
      "study_class": "Other",
      "category_key": "lc",
      "category_label": "Lungenkrebs – Studien",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40880183/",
      "url_doi": "https://doi.org/10.1158/1078-0432.CCR-24-4342",
      "abstract": "PURPOSE: Patients with extensive-stage small cell lung cancer (ES-SCLC) are commonly treated with induction systemic therapy and consolidative thoracic radiation therapy (TRT). PARP inhibitors have demonstrated radiosensitization in preclinical lung cancer models. We performed an investigator-initiated, multi-institutional, single-arm, open label phase I study of concurrent olaparib with TRT.\n\nPATIENTS AND METHODS: Patients without progression after induction platinum/etoposide +/- atezolizumab were treated with oral olaparib for 3 weeks and concurrent low-dose TRT (30 Gy/10 fractions) in weeks 2 and 3. Olaparib dose started at 50mg twice daily and escalated in 50mg/dose increments in cohorts of 3 patients each. Primary objectives were the safety and maximum tolerated dose (MTD) of olaparib + TRT. Secondary objectives included in-field local recurrence rate, progression-free survival (PFS), and overall survival (OS).\n\nRESULTS: Between 10/2018 and 03/2022, 24 patients with a median age of 68 years were treated (median follow-up: 11.4 months) with platinum/etoposide and 30 Gy/10 fractions TRT; 10 patients also received atezolizumab. The MTD of olaparib with TRT was 200mg twice daily. There were 3 grade 3 (G3) dose-limiting adverse events (AEs), including pneumonitis/pneumonia, esophagitis, and abdominal pain. The most common G2-3 treatment-related AEs were esophagitis (n=12) and pneumonitis/pneumonia (n=2). There were no G4 or 5 AEs. The 12-month cumulative incidence of local recurrence was 27%, median PFS and OS were 3.6 months and 17.7 months, respectively.\n\nCONCLUSIONS: This study defined a MTD and recommended phase II dose of 200mg twice daily olaparib with concurrent low-dose TRT, and the combination appeared safe without unexpected toxicities."
    },
    {
      "pmid": "40883523",
      "doi": "10.1007/s00330-025-11949-8",
      "title": "Artificial intelligence as an independent reader of risk-dominant lung nodules: influence of CT reconstruction parameters.",
      "journal": "European radiology",
      "pubdate": "2025-08-29T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "category_key": "lc",
      "category_label": "Lungenkrebs – Studien",
      "is_oa": true,
      "oa_url": "https://link.springer.com/content/pdf/10.1007/s00330-025-11949-8.pdf",
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40883523/",
      "url_doi": "https://doi.org/10.1007/s00330-025-11949-8",
      "abstract": "OBJECTIVES: To assess the impact of reconstruction parameters on AI's performance in detecting and classifying risk-dominant nodules in a baseline low-dose CT (LDCT) screening among a Chinese general population.\n\nMATERIALS AND METHODS: Baseline LDCT scans from 300 consecutive participants in the Netherlands and China Big-3 (NELCIN-B3) trial were included. AI analyzed each scan reconstructed with four settings: 1 mm/0.7 mm thickness/interval with medium-soft and hard kernels (D45f/1 mm, B80f/1 mm) and 2 mm/1 mm with soft and medium-soft kernels (B30f/2 mm, D45f/2 mm). Reading results from consensus read by two radiologists served as reference standard. At scan level, inter-reader agreement between AI and reference standard, sensitivity, and specificity in determining the presence of a risk-dominant nodule were evaluated. For reference-standard risk-dominant nodules, nodule detection rate, and agreement in nodule type classification between AI and reference standard were assessed.\n\nRESULTS: AI-D45f/1 mm demonstrated a significantly higher sensitivity than AI-B80f/1 mm in determining the presence of a risk-dominant nodule per scan (77.5% vs. 31.5%, p < 0.0001). For reference-standard risk-dominant nodules (111/300, 37.0%), kernel variations (AI-D45f/1 mm vs. AI-B80f/1 mm) did not significantly affect AI's nodule detection rate (87.4% vs. 82.0%, p = 0.26) but substantially influenced the agreement in nodule type classification between AI and reference standard (87.7% [50/57] vs. 17.7% [11/62], p < 0.0001). Change in thickness/interval (AI-D45f/1 mm vs. AI-D45f/2 mm) had no substantial influence on any of AI's performance (p > 0.05).\n\nCONCLUSION: Variations in reconstruction kernels significantly affected AI's performance in risk-dominant nodule type classification, but not nodule detection. Ensuring consistency with radiologist-preferred kernels significantly improved agreement in nodule type classification and may help integrate AI more smoothly into clinical workflows.\n\nKEY POINTS: Question Patient management in lung cancer screening depends on the risk-dominant nodule, yet no prior studies have assessed the impact of reconstruction parameters on AI performance for these nodules. Findings The difference between reconstruction kernels (AI-D45f/1 mm vs. AI-B80f/1 mm, or AI-B30f/2 mm vs. AI-D45f/2 mm) significantly affected AI's performance in risk-dominant nodule type classification, but not nodule detection. Clinical relevance The use of kernel for AI consistent with radiologist's choice is likely to improve the overall performance of AI-based CAD systems as an independent reader and support greater clinical acceptance and integration of AI tools into routine practice."
    },
    {
      "pmid": "40877276",
      "doi": "10.1038/s41467-025-63471-6",
      "title": "A comparative analysis of heterogeneity in lung cancer screening effectiveness in two randomised controlled trials.",
      "journal": "Nature communications",
      "pubdate": "2025-08-28T00:00:00+00:00",
      "pubtypes": [
        "Journal Article",
        "Randomized Controlled Trial"
      ],
      "entity": "Thoracic-other",
      "trial_type": "RCT",
      "study_class": "Prospective",
      "category_key": "lc",
      "category_label": "Lungenkrebs – Studien",
      "is_oa": true,
      "oa_url": "https://www.nature.com/articles/s41467-025-63471-6.pdf",
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40877276/",
      "url_doi": "https://doi.org/10.1038/s41467-025-63471-6",
      "abstract": "Clinical trials demonstrate that screening can reduce lung cancer mortality by over 20%. However, lung cancer screening effectiveness (reduction in lung cancer specific mortality) may vary by personal risk-factors. Here we evaluate heterogeneity in lung cancer screening effectiveness through traditional sub-group analyses, predictive modelling approaches and machine-learning in individual-level data from the Dutch-Belgian lung cancer screening trial (NELSON; 14,808 participants, 12,429 men, 2377 women, 2 persons with an unknown sex) and the National Lung Screening Trial (NLST; 53,405 participants, 31,501 men, 21,904 women). We find that screening effectiveness varies by pack-years (screening effectiveness ranges across trials: lowest groups = 26.8-50.9%, highest groups = 5.5-9.5%), smoking status (screening effectiveness ranges across trials: former smokers = 37.8-39.1%, current smokers = 16.1-22.7%) and sex (screening effectiveness ranges across trials: women = 24.6-25.3%; men = 8.3-24.9%). Furthermore, screening effectiveness varies by histology (screening effectiveness ranges across trials: adenocarcinoma = 17.8-23.0%, other lung cancers = 24.5-35.5%, small-cell carcinoma = 9.7%-11.3%). Screening is ineffective for squamous-cell carcinoma in NLST (screening effectiveness = 27.9% (95% confidence interval: 69.8% increase to 4.5% decrease) mortality increase) but effective in NELSON (screening effectiveness = 52.2% (95% confidence interval: 25.7-69.1% decrease) mortality reduction). We find that variations in screening effectiveness across pack-years, smoking status, and sex are primarily explained by a greater prevalence of histologies with favourable screening effectiveness in these groups. Our study shows that heterogeneity in lung screening effectiveness is primarily driven by histology and that relaxing smoking-related screening eligibility criteria may enhance screening effectiveness."
    },
    {
      "pmid": "40864503",
      "doi": "10.1158/1078-0432.CCR-25-1735",
      "title": "First-line MET tyrosine kinase inhibitors versus immunotherapy ± chemotherapy for patients with MET exon 14 skipping mutant metastatic NSCLC.",
      "journal": "Clinical cancer research : an official journal of the American Association for Cancer Research",
      "pubdate": "2025-08-27T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Other",
      "category_key": "lc",
      "category_label": "Lungenkrebs – Studien",
      "is_oa": true,
      "oa_url": "https://aacrjournals.org/clincancerres/article-pdf/doi/10.1158/1078-0432.CCR-25-1735/3646790/ccr-25-1735.pdf",
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40864503/",
      "url_doi": "https://doi.org/10.1158/1078-0432.CCR-25-1735",
      "abstract": "PURPOSE: First-line treatment options for MET exon 14 skipping (METex14) mutant metastatic non-small cell lung cancer (NSCLC) vary due to differences in drug approvals and clinical experience. This study investigates factors influencing outcomes with first-line MET tyrosine kinase inhibitors (TKI) versus immune checkpoint inhibitors (ICI)±chemotherapy.\n\nEXPERIMENTAL DESIGN: Clinicopathologic data were collected from patients with metastatic METex14 mutant NSCLC receiving first-line MET TKI or ICI±chemotherapy at five centers. Primary endpoints were real-world progression-free survival (rwPFS) and overall survival (OS) to first-line MET TKI versus ICI±chemotherapy. Subgroup analyses by clinicopathological characteristics were performed.\n\nRESULTS: Among 158 patients, 80 received MET TKI and 78 ICI±chemotherapy as first-line. Baseline clinicopathologic features were balanced except for higher proportion of patients with a history of smoking in the ICI±chemotherapy group (p=0.03). With a median follow-up of 37.9 months, no difference was observed in rwPFS (HR 0.85, p=0.4) or OS (HR 0.97, p=0.9) with first-line MET TKI versus ICI±chemotherapy. In subgroup analyses, first-line ICI±chemotherapy improved rwPFS in PD-L1≥80% (HR 0.50, p=0.03), while MET TKI improved rwPFS (HR 0.40, p=0.005) and OS (HR 0.49, p=0.03) in PD-L1<50%, as well as rwPFS (HR 0.39, p=0.02) and OS (HR 0.36, p=0.03) in brain metastases, and rwPFS in bone metastases (HR 0.55, p=0.01). No differences were observed in the incidence of high-grade toxicity (p=0.9) or rates of permanent discontinuation (p=0.2) between first-line MET TKI and ICI±chemotherapy.\n\nCONCLUSIONS: First-line MET TKI improved outcomes in PD-L1<50% and brain/bone metastases, while ICI±chemotherapy prolonged PFS only in PD-L1≥80%, emphasizing the need for personalized treatment selection."
    },
    {
      "pmid": "40896974",
      "doi": "10.1016/j.lungcan.2025.108729",
      "title": "Communication about personal values of patients with advanced lung cancer in the hospital: results of a mixed-methods study.",
      "journal": "Lung cancer (Amsterdam, Netherlands)",
      "pubdate": "2025-08-27T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "category_key": "lc",
      "category_label": "Lungenkrebs – Studien",
      "is_oa": true,
      "oa_url": "https://www.lungcancerjournal.info/article/S0169-5002(25)00621-X/pdf",
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40896974/",
      "url_doi": "https://doi.org/10.1016/j.lungcan.2025.108729",
      "abstract": "BACKGROUND: Guidelines recommend to discuss the treatment and care goals of patients with advanced cancer in alignment with their values and preferences, yet this approach is often not adequately implemented in hospitals. To explore the personal values of patients with metastatic lung cancer and how they communicate them to physicians, a mixed-methods study was conducted at a German University Lung Cancer Center.\n\nMETHODS: The study included quantitative data from 66 patients with metastatic lung cancer using the Human Values Scale, a group comparison after propensity score matching with the German cohort from the 9th European Social Survey, semi-structured in-depth interviews (n = 17), qualitative content analysis, and integration of the data using side-by-side display.\n\nRESULTS: The quantitative analysis showed that patients prioritized the value dimensions of self-transcendence (universalism, benevolence; p = 0.02) and openness to change (self-direction, stimulation; p = 0.03), with a shift toward stronger self-direction in more advanced disease. In contrast, values related to conservation (conformity, tradition, security; p = 0.04) and self-enhancement (power, achievement; p = 0.02) were less important. Despite these stated preferences, qualitative data revealed that personal values and existential concerns were largely overlooked in clinical encounters. Patients often accepted physicians' treatment recommendations without question, suggesting a gap in addressing their values and preferences.\n\nCONCLUSIONS: Our findings highlight the need for physicians to take a proactive role in discussing patient values and empowering them in decision-making. These insights can inform the development of value assessment tools and interventions to improve shared decision-making and goal-concordant care."
    },
    {
      "pmid": "40884897",
      "doi": "10.1016/j.lungcan.2025.108731",
      "title": "Lineage-specific transcription factor landscape of thymic neuroendocrine tumors.",
      "journal": "Lung cancer (Amsterdam, Netherlands)",
      "pubdate": "2025-08-27T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thymic",
      "trial_type": null,
      "study_class": "Other",
      "category_key": "lc",
      "category_label": "Lungenkrebs – Studien",
      "is_oa": true,
      "oa_url": "https://doi.org/10.1016/j.lungcan.2025.108731",
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40884897/",
      "url_doi": "https://doi.org/10.1016/j.lungcan.2025.108731",
      "abstract": "INTRODUCTION: Thymic neuroendocrine tumors (TNETs) are rare malignancies characterized by aggressive clinical behavior and limited therapeutic options. In small cell lung cancer (SCLC), molecular subtypes based on the expression of lineage-defining transcription factors (TFs)-ASCL1, NEUROD1, POU2F3, and YAP1-have been proposed. However, the TF landscape of TNETs remains poorly defined. Given the pathological similarities among neuroendocrine tumors across organs, we aimed to investigate whether the TF-based classification system used in SCLC is applicable to TNETs.\n\nMETHODS: Sixteen pathologically confirmed TNETs-including large cell neuroendocrine carcinoma (LCNEC), thymic small cell carcinoma (TSCC), atypical carcinoid (AC), and typical carcinoid (TC)-were retrospectively analyzed. Immunohistochemistry was performed to evaluate classical neuroendocrine (NE) markers (synaptophysin, chromogranin A, CD56) and TFs (ASCL1, NEUROD1, POU2F3, YAP1). H-scores were calculated, and tumors were categorized according to TFs expression profiles.\n\nRESULTS: Synaptophysin was strongly expressed in all cases, while chromogranin A and CD56 showed variable expression, with reduced levels in LCNEC and TSCC. The combined NE score was significantly higher in carcinoid tumors compared to LCNEC and TSCC. For TFs, ASCL1 expression was observed in 93.8 % of cases, whereas NEUROD1 and POU2F3 were rarely or not expressed. YAP1 expression was confined to LCNEC cases, all of which co-expressed ASCL1 and YAP1. Based on H-scores, TNETs were classified into three subgroups: (1) ASCL1-positive/YAP1-negative (n = 12, 75 %), (2) ASCL1/YAP1 double-positive (n = 3, 19 %), and (3) double-negative (n = 1, 6 %).\n\nCONCLUSION: This study reveals molecular heterogeneity among TNETs. Notably, ASCL1 and YAP1 co-expression characterizes all LCNEC cases, making a distinct TF landscape in high-grade TNETs."
    },
    {
      "pmid": "40858894",
      "doi": "10.1007/s00520-025-09852-5",
      "title": "Anxiety and self-efficacy in Chinese lung cancer patients: cross-lagged effects and the mediation of resilience.",
      "journal": "Supportive care in cancer : official journal of the Multinational Association of Supportive Care in Cancer",
      "pubdate": "2025-08-27T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "category_key": "lc",
      "category_label": "Lungenkrebs – Studien",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40858894/",
      "url_doi": "https://doi.org/10.1007/s00520-025-09852-5",
      "abstract": "AIM: To explore the longitudinal causal relationship between anxiety and self-efficacy in lung cancer patients and the mediating role of resilience in the reciprocal relationships.\n\nDESIGN: A longitudinal observational study.\n\nMETHODS: This study collected data on anxiety, resilience, and self-efficacy in 333 Chinese first-diagnosed lung cancer patients at three time points: T1 (preoperative hospitalization), T2 (one month after surgery), and T3 (three months after surgery).\n\nRESULTS: The results of cross-lagged panel modeling showed that there was a significant mediating effect of resilience, which mediated the weakening effect of anxiety at T1 on self-efficacy at T3 and mediated the weakening effect of self-efficacy at T1 on anxiety at T3.\n\nCONCLUSION: These findings suggest that resilience longitudinally mediated the relationship between anxiety and self-efficacy in lung cancer patients.\n\nIMPLICATIONS FOR THE PROFESSION AND/OR PATIENT CARE: Enhancing medical staff's capacity to reduce the incidence of preoperative anxiety and improve self-efficacy in patients undergoing lung cancer surgery.\n\nIMPACT: Future research could develop interventions related to resilience to buffer or even block the debilitating effects of anxiety on self-efficacy and enhance the weakening effects of self-efficacy on anxiety in lung cancer patients.\n\nPATIENT OR PUBLIC CONTRIBUTION: This study directly involved the patients in hospital settings.\n\nREPORTING METHOD: This study adhered to the STROBE guidelines for cohort studies."
    }
  ],
  "categories": [
    {
      "key": "lc",
      "label": "Lungenkrebs – Studien"
    },
    {
      "key": "vte",
      "label": "VTE & Lungenkrebs – News"
    }
  ]
}