{
  "generated": "2025-09-28T05:15:41.631677Z",
  "items": [
    {
      "pmid": "40996757",
      "doi": "10.1001/jamaoncol.2025.3320",
      "title": "Understanding Lung Cancer in Younger People.",
      "journal": "JAMA oncology",
      "pubdate": "2025-09-25T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": "SJR",
      "metric_value": 8.377,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40996757/",
      "url_doi": "https://doi.org/10.1001/jamaoncol.2025.3320",
      "abstract": null
    },
    {
      "pmid": "40986428",
      "doi": "10.1158/2159-8290.CD-24-1417",
      "title": "EML4-ALK variant-specific genetic interactions shape lung tumorigenesis.",
      "journal": "Cancer discovery",
      "pubdate": "2025-09-23T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": "SJR",
      "metric_value": 7.283,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40986428/",
      "url_doi": "https://doi.org/10.1158/2159-8290.CD-24-1417",
      "abstract": "Diverse fusions of EML4 and ALK are oncogenic drivers in lung adenocarcinomas. EML4-ALK variants have distinct breakpoints within EML4, but their functional differences remain poorly understood. Here, we use somatic genome editing to generate autochthonous mouse models of EML4-ALK-driven lung tumors and show that V3 is more oncogenic than V1. By employing multiplexed genome editing and quantifying the effects of 29 putative tumor suppressor genes on V1- and V3-driven lung cancer growth, we show that many tumor suppressor genes have variant-specific effects on tumorigenesis. Pharmacogenomic analyses further suggest that tumor genotype can influence therapeutic responses. Analysis of human EML4-ALK-positive lung cancers also identified variant-specific differences in their genomic landscapes. These findings suggest that EML4-ALK variants behave more like distinct oncogenes rather than a uniform entity and highlight the dramatic impact of oncogenic fusion partner proteins and coincident tumor suppressor gene alterations on the biology of oncogenic fusion-driven cancers."
    },
    {
      "pmid": "40991405",
      "doi": "10.1158/0008-5472.CAN-25-1141",
      "title": "PRT3789 is a First-in-Human SMARCA2-Selective Degrader that Induces Synthetic Lethality in SMARCA4-Mutated Cancers.",
      "journal": "Cancer research",
      "pubdate": "2025-09-24T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": "SJR",
      "metric_value": 3.879,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40991405/",
      "url_doi": "https://doi.org/10.1158/0008-5472.CAN-25-1141",
      "abstract": "SMARCA2 and SMARCA4 are the core catalytic subunits of the SWI/SNF chromatin remodeling complex. Approximately 10% of non-small cell lung cancer (NSCLC) patients harbor SMARCA4 mutations, resulting in protein loss or loss-of-function (LOF) alterations. These SMARCA4-deficient cancers are highly dependent on SMARCA2 for proliferation, growth, and survival, making SMARCA2 a promising synthetic lethal target. Here, we developed and characterized PRT3789, a clinical-stage SMARCA2-selective targeted protein degrader (TPD). It induced polyubiquitination at lysine residues unique to SMARCA2 through stable ternary complex formation with the VHL E3 ligase. The selectivity was driven by interactions with an extended loop unique to SMARCA2, as revealed by structure-based analyses. PRT3789 promoted selective degradation of SMARCA2, while sparing its highly homologous paralog, SMARCA4. In SMARCA4-deficient models, SMARCA2 degradation disrupted SWI/SNF complex integrity by inducing dissociation of multiple subunits, leading to downstream transcriptional reprogramming. PRT3789 induced robust tumor growth inhibition and regression in SMARCA4-deficient models, both as monotherapy and in combination with targeted therapies or chemotherapies. In contrast, SMARCA4-wild-type models exhibited minimal response despite confirmed SMARCA2 degradation, consistent with SMARCA4 sparing and preserved SWI/SNF complex integrity. In clinical settings, PRT3789 reduced SMARCA2 protein levels in peripheral blood mononuclear cells (PBMCs) from patients with SMARCA4-mutated cancers. Initial signs of clinical activity have been observed, including RECIST-confirmed partial responses. Together, these findings demonstrate the selective targeting of SMARCA2 and the potential for a favorable therapeutic index with PRT3789. Phase I/II clinical trials with PRT3789 are ongoing in biomarker-selected patients with SMARCA4-mutated solid tumors."
    },
    {
      "pmid": "40991294",
      "doi": "10.1158/0008-5472.CAN-25-0021",
      "title": "MEN1 Promotes Ferroptosis by Disrupting CD44 Alternative Splicing to Suppress Lung Cancer.",
      "journal": "Cancer research",
      "pubdate": "2025-09-24T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://aacrjournals.org/cancerres/article-pdf/doi/10.1158/0008-5472.CAN-25-0021/3654559/can-25-0021.pdf",
      "metric_name": "SJR",
      "metric_value": 3.879,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40991294/",
      "url_doi": "https://doi.org/10.1158/0008-5472.CAN-25-0021",
      "abstract": "Ferroptosis is a characteristic form of cell death triggered by excessive iron-dependent reactive oxygen species (ROS) that plays an important role in suppressing tumor development. Here, we identified MEN1 as a driver of ferroptosis in lung cancer. MEN1 facilitated lipid ROS generation and sensitized lung cancer cells to ferroptosis by perturbing CD44 precursor messenger RNA (pre-mRNA) splicing. CD44 variant isoforms were highly expressed and correlated with poor prognosis in human lung cancers. Loss of Men1 profoundly accelerated the progression of mutant Kras driven lung adenocarcinoma (LUAD) and promoted the accumulation of CD44 variant isoforms. Mechanistically, MEN1 maintained a relatively slow RNA polymerase II (Pol II) elongation by controlling the release of PAF1 from the CD44 pre-mRNA, which in turn prevented the inclusion of CD44 variable exons (CD44v). Furthermore, CD44v6-interfering peptides effectively abrogated the growth and metastasis of established MEN1 deficient tumors by activating ferroptosis. Collectively, this study unveils a mechanism of tumor suppression based on MEN1 regulation of CD44 alternative splicing, ROS production, and ferroptosis induction."
    },
    {
      "pmid": "40670667",
      "doi": "10.1038/s41416-025-03088-0",
      "title": "Single-cell spatial analysis with Xenium reveals anti-tumour responses of CXCL13 + T and CXCL9+ cells after radiotherapy combined with anti-PD-L1 therapy.",
      "journal": "British journal of cancer",
      "pubdate": "2025-10-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://www.nature.com/articles/s41416-025-03088-0.pdf",
      "metric_name": "SJR",
      "metric_value": 3.144,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40670667/",
      "url_doi": "https://doi.org/10.1038/s41416-025-03088-0",
      "abstract": "BACKGROUND: The standard treatment for unresectable non-small cell lung cancer (NSCLC) is anti-PD-L1 therapy combined with chemoradiotherapy (anti-PD-L1-CRT). Although some patients achieve complete cancer eradication and cure, more than half of patients retain persistent cancer cells. Our research aimed to unravel the nuanced mechanisms involved in both immune attack and evasion induced by anti-PD-L1-CRT with single cell spatial transcriptome.\n\nMETHODS: Xenium is a cutting-edge single-cell spatial analysis tool that enables pathology-based and single-cell analyses while preserving spatial information. In our study, we used Xenium to identify the tumour microenvironment (TME), immune dynamics, and residual cancer cells at the single-cell level following treatment with anti-PD-L1-CRT.\n\nRESULTS: Posttreatment alterations included a significant increase in CXCL9+ cells and CXCL13 + T cells, particularly around tumour cells. Additionally, we discovered that CXCL13 + T cells directly impact cancer cells in the posttreatment environment. Moreover, we identified clusters of immune-cold cancer cells posttreatment, revealing their activation of DNA repair pathways and high proliferative capacity. The novel spatial analysis tool Xenium enabled identification of the immune environment at the single-cell level following treatment with anti-PD-L1-CRT, elucidating its characteristics.\n\nCONCLUSIONS: These findings suggest potential advancements in developing new treatments to improve posttreatment immune responses and address resistance challenges."
    },
    {
      "pmid": "40189749",
      "doi": "10.1080/2162402X.2025.2484880",
      "title": "Surrogate markers of intestinal dysfunction associated with survival in advanced cancers.",
      "journal": "Oncoimmunology",
      "pubdate": "2025-12-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://doi.org/10.1080/2162402x.2025.2484880",
      "metric_name": "SJR",
      "metric_value": 2.542,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40189749/",
      "url_doi": "https://doi.org/10.1080/2162402X.2025.2484880",
      "abstract": "Deviations in the diversity and composition of the gut microbiota are called \"gut dysbiosis\". They have been linked to various chronic diseases including cancers and resistance to immunotherapy. Stool shotgun based-metagenomics informs on the ecological composition of the gut microbiota and the prevalence of homeostatic bacteria such as"
    },
    {
      "pmid": "40541589",
      "doi": "10.1016/j.critrevonc.2025.104812",
      "title": "The effects of race on anti-PD-(L)1 monoclonal antibodies in non-small cell lung cancer: A systematic literature review and meta-analysis.",
      "journal": "Critical reviews in oncology/hematology",
      "pubdate": "2025-10-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article",
        "Meta-Analysis",
        "Review"
      ],
      "entity": "NSCLC",
      "trial_type": "Review/Meta",
      "study_class": "Review",
      "is_oa": true,
      "oa_url": "https://doi.org/10.1016/j.critrevonc.2025.104812",
      "metric_name": "SJR",
      "metric_value": 1.82,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40541589/",
      "url_doi": "https://doi.org/10.1016/j.critrevonc.2025.104812",
      "abstract": "INTRODUCTION: Non-small cell lung cancer (NSCLC) represents approximately 85 % of lung cancers, with five-year survival only 4.5 % for metastatic disease. Programmed death (ligand)-1 (PD-[L]1) inhibitors have advanced NSCLC treatment, but patient demographics can potentially affect clinical outcomes. This systematic literature review and meta-analysis were undertaken to determine if the benefits of anti-PD-(L)1 therapies in NSCLC are independent of race (bio-geographic background).\n\nMETHODS: PubMed, Embase, Cochrane Library and World Health Organization Global Index Medicus were systematically searched (inception-to-Aug-2024). Primary analysis focused on studies with subgroup analysis (White vs Asian, White vs Non-White, Asian vs Non-Asian) of anti-PD-(L)1 efficacy in both resectable/localized and unresectable/advanced NSCLC. Subgroup analysis included stratification by PD-L1 expression, treatment line, and treatment regimen. Bayesian inferential meta-analysis was performed for outcomes with ≥ 1 study.\n\nRESULTS: From 4406 records, 22 randomized controlled trials, 3 pooled analyses, and 2 pharmacokinetic studies were included. In unresectable/advanced NSCLC, anti-PD-(L)1 therapy significantly improved overall survival and progression-free survival (PFS) for White (hazard ratio [HR] 0.80; 95 % credible interval [95 % CrI] 0.74-0.87, p < 0.001 and HR 0.68; 95 % CrI 0.61-0.77, p < 0.001, respectively) and Asian (HR 0.81; 95 % CrI 0.69-0.96, p = 0.027 and HR 0.63; 95 % CrI 0.50-0.80, p = 0.002) patients. The significant improvements in PFS were maintained for both groups within all sub-analyses. Limited data prohibited conduction of meta-analysis for resectable/localized NSCLC.\n\nCONCLUSIONS: The benefits of anti-PD-(L)1 therapy in unresectable/advanced NSCLC appear similar for White and Asian patients. Increased quality and quantity of data is required to draw definitive conclusions for resectable/localized NSCLC and with respect to treatment line/regimen and PD-L1 expression."
    },
    {
      "pmid": "40684711",
      "doi": "10.1016/j.ejrad.2025.112290",
      "title": "Comparison of nodule volumetric classification by using two different nodule segmentation algorithms in an LDCT lung cancer baseline screening dataset.",
      "journal": "European journal of radiology",
      "pubdate": "2025-10-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": "SJR",
      "metric_value": 1.003,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40684711/",
      "url_doi": "https://doi.org/10.1016/j.ejrad.2025.112290",
      "abstract": "OBJECTIVES: To investigate the performance of two segmentation algorithms for nodule volumetric classification at participant/scan level in the NELCIN-B3 cohort (Netherlands and China Big-3), a lung cancer screening program (LCS) using low-dose CT (LDCT).\n\nMETHODS: Baseline scans with qualified LDCT images from consecutive NELCIN-B3 participants were included from June 2017 to July 2018. Performance of two software algorithms were independently evaluated by two radiologists: software A (Syngo.via VB30A) by reader 1 and software B (AVIEW v1.1.39.14) by reader 2. According to the NELSON2.0 protocol, nodules with a solid component ≥ 100 mm\n\nRESULTS: In total, 300 participants were evaluated comprising 159 women (53.0 %) and 193 (64.3 %) never smokers, with a mean ± standard deviation age of 61.2 ± 7.1 years. There were disagreements in 17 cases: in 11 (11/300, 3.7 %), this was due to differences in nodule selection and nodule type classification between readers; and in 6 (6/300, 2.0 %), this was due to variations in nodule volume metrics between algorithms. Inter-software agreement was almost perfect (κ = 0.88 [95 %CI: 0.83-0.93]). In the consensus read, reader 1/software A generated 12 misclassifications (11 PM, 1 NM), giving a negative predictive value of 99.6 % (95 % CI: 98.9 %-100.0 %). Reader 2/software B generated 5 misclassifications (2 PM, 3 NM), giving a negative predictive value of 98.9 % (95 % CI: 97.7 %-100.0 %).\n\nCONCLUSION: Two software algorithms (Syngo.via VB30A and AVIEW v1.1.39.14) showed comparable performance for lung nodule volumetric classification at participant/scan level. Further research is needed to confirm the results in other LDCT LCS programs."
    },
    {
      "pmid": "41004707",
      "doi": "10.1200/JCO-25-01817",
      "title": "Bridging the Gap: The Evolving Landscape of CNS Management in Small Cell Lung Cancer: Prophylactic Cranial Irradiation in the Modern Era.",
      "journal": "Journal of clinical oncology : official journal of the American Society of Clinical Oncology",
      "pubdate": "2025-09-26T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "SCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41004707/",
      "url_doi": "https://doi.org/10.1200/JCO-25-01817",
      "abstract": null
    },
    {
      "pmid": "41006257",
      "doi": "10.1038/s41467-025-63461-8",
      "title": "AI cancer driver mutation predictions are valid in real-world data.",
      "journal": "Nature communications",
      "pubdate": "2025-09-26T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://www.nature.com/articles/s41467-025-63461-8.pdf",
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41006257/",
      "url_doi": "https://doi.org/10.1038/s41467-025-63461-8",
      "abstract": "Characterizing and validating which mutations influence development of cancer is challenging. Artificial intelligence (AI) has delivered significant advances in protein structure prediction, but its utility for identifying cancer drivers is less explored. We evaluate multiple computational methods for identifying cancer driver mutations. For re-identifying known drivers, methods incorporating protein structure or functional genomic data outperform methods trained only on evolutionary data. We validate variants of unknown significance (VUSs) annotated as pathogenic by testing their association with overall survival in two cohorts of patients with non-small cell lung cancer (N = 7965 and 977). VUSs identified as pathogenic drivers by AI in KEAP1 and SMARCA4 are associated with worse survival, unlike \"benign\" VUSs. \"Pathogenic\" VUSs also exhibit mutual exclusivity with known oncogenic alterations at the pathway level, further suggesting biological validity. AI predictions thus contribute to a more comprehensive understanding of tumor genetics as validated by real-world data."
    },
    {
      "pmid": "40995949",
      "doi": "10.1080/14796694.2025.2560225",
      "title": "RELAY: safety and efficacy of ramucirumab plus erlotinib in elderly Japanese patients with metastatic EGFR-mutated NSCLC.",
      "journal": "Future oncology (London, England)",
      "pubdate": "2025-09-25T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40995949/",
      "url_doi": "https://doi.org/10.1080/14796694.2025.2560225",
      "abstract": "AIM: The global phase III RELAY trial demonstrated the efficacy of ramucirumab (RAM) plus erlotinib (ERL) in patients with untreated metastatic epidermal growth factor receptor (\n\nMETHODS: Patients were randomized (1:1) to RAM (10 mg/kg) or placebo (PL) intravenously every 2 weeks plus 150 mg/day ERL orally. Primary endpoint was progression-free survival (reported elsewhere). This report describes response rates, study drug exposure, dose adjustments, safety, and post-study treatment discontinuation therapies in Japanese elderly patients (RAM+ERL, n = 12; PL+ERL, n = 17).\n\nRESULTS: Overall response rate was similar in RAM+ERL (83.3%) and PL+ERL (82.4%) arms. Median treatment duration of RAM and ERL was 6.0 and 15.4 months, respectively. Most patients had RAM and/or ERL dose adjustments. Adverse events, including grade ≥ 3 events, were similar in both treatment arms, although proteinuria occurred exclusively in the RAM+ERL arm (six patients; no grade ≥ 3 events). All patients received subsequent therapy after first-line study treatment; various subsequent therapies were used.\n\nCONCLUSION: These results suggest that RAM+ERL may be a suitable first-line treatment option for elderly patients with\n\nCLINICAL TRIAL REGISTRATION: www.clinicaltrials.gov identifier is NCT02411448."
    },
    {
      "pmid": "41005236",
      "doi": "10.1016/j.lungcan.2025.108753",
      "title": "An umbrella review of meta-analyses on smoking cessation and cancer survival: a brief report.",
      "journal": "Lung cancer (Amsterdam, Netherlands)",
      "pubdate": "2025-09-23T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41005236/",
      "url_doi": "https://doi.org/10.1016/j.lungcan.2025.108753",
      "abstract": "Smoking cessation at or around the time of cancer diagnosis is associated with significant improvements in survival across multiple tumor types. This umbrella review of 12 meta-analyses demonstrates that patients who quit smoking post-diagnosis have a 15-29% reduction in mortality in lung cancer, a 20% reduction in head and neck cancers, and a 24% reduction in colorectal cancer. Suggestive benefits were also observed in breast, bladder, and gastrointestinal cancers. The strongest evidence supports the prognostic value of cessation in lung and colorectal cancers. These findings underscore the clinical importance of integrating structured tobacco cessation interventions into routine oncologic care, not only for long-term disease prevention but also to improve survival outcomes in patients already diagnosed with cancer. Despite the consistency of benefit, cessation support remains underutilized in oncology settings. Addressing this gap represents a critical and actionable step toward improving cancer prognosis with minimal toxicity and high cost-effectiveness."
    }
  ]
}