{
  "generated": "2025-10-14T05:17:02.705347Z",
  "items": [
    {
      "pmid": "40189749",
      "doi": "10.1080/2162402X.2025.2484880",
      "title": "Surrogate markers of intestinal dysfunction associated with survival in advanced cancers.",
      "journal": "Oncoimmunology",
      "pubdate": "2025-12-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://doi.org/10.1080/2162402x.2025.2484880",
      "metric_name": "SJR",
      "metric_value": 2.542,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40189749/",
      "url_doi": "https://doi.org/10.1080/2162402X.2025.2484880",
      "abstract": "Deviations in the diversity and composition of the gut microbiota are called \"gut dysbiosis\". They have been linked to various chronic diseases including cancers and resistance to immunotherapy. Stool shotgun based-metagenomics informs on the ecological composition of the gut microbiota and the prevalence of homeostatic bacteria such as"
    },
    {
      "pmid": "40650354",
      "doi": "10.1002/ijc.70045",
      "title": "Stage- and histology-specific sensitivity for the detection of lung cancer of the NELSON screening protocol-A modeling study.",
      "journal": "International journal of cancer",
      "pubdate": "2025-12-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://onlinelibrary.wiley.com/doi/pdfdirect/10.1002/ijc.70045",
      "metric_name": "SJR",
      "metric_value": 2.252,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40650354/",
      "url_doi": "https://doi.org/10.1002/ijc.70045",
      "abstract": "The Dutch-Belgian lung cancer (LC) screening trial (Nederlands-Leuvens Longkanker Screenings Onderzoek [NELSON]) demonstrated low-dose computed tomography (CT) reduces LC mortality by 24% among men. The NELSON protocol differed from previous trials in the eligibility criteria, the use of volume-based nodule management, and increasing screening intervals. The early-stage sensitivity of the protocol is pivotal in determining the optimal screening strategy, such as the interval and age range. The MIcrosimulation SCreening ANalysis-Lung natural history model was used to reproduce LC incidence and mortality by detection method (clinical or screen-detected), sex, histology, and stage in the NELSON trial based on individual-level data. We evaluated screening effectiveness by stage and histology, accounting for population characteristics, trial design, and LC epidemiology. We find stage IA non-small cell LC (NSCLC) sensitivity of 24.6% (other NSCLC) to 41.0% (adenocarcinoma) at baseline screening. At repeat screening rounds, we find this increased to 70.9% for stage IA adenocarcinoma. For stage IB, the sensitivity by histology ranges from 26.4% to 77.1%; for stage II, 39.6%-81.9%. Upon detection, the probability of LC mortality prevention is estimated at 83% for stage IA. The sensitivity for detecting early-stage LC is found to depend on the histology of cancer and is increased for adenocarcinoma at repeat screenings. Despite a low rate of referral to follow-up screening in the NELSON trial, early-stage CT sensitivity and the probability of mortality prevention were similar to previous estimates from the National Lung cancer Screening Trial. Previously demonstrated screening effectiveness may be maintained when implementing new programs, while reducing unnecessary follow-up when considering NELSON evidence."
    },
    {
      "pmid": "40168159",
      "doi": "10.1080/17581966.2025.2477411",
      "title": "The association between blood-based HYAL2 methylation and early-stage lung cancer: a case-control study.",
      "journal": "Lung cancer management",
      "pubdate": "2025-12-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://doi.org/10.1080/17581966.2025.2477411",
      "metric_name": "SJR",
      "metric_value": 0.506,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40168159/",
      "url_doi": "https://doi.org/10.1080/17581966.2025.2477411",
      "abstract": "BACKGROUND: Blood-based DNA methylation biomarkers have great potential for the early detection of lung cancer (LC). Here, we investigated the association between\n\nMETHODS: Matrix-assisted laser desorption ionization time-of-flight (MALDI-TOF) mass spectrometry was performed to measure the methylation levels of 4 CpG sites in\n\nRESULTS: Hypomethylation of all 4 CpG sites in\n\nCONCLUSIONS: Our results suggested blood-based"
    },
    {
      "pmid": "40962011",
      "doi": "10.1016/j.ejphar.2025.178168",
      "title": "Prognostic implications of antitumour efficacy and adverse events of EGFR-TKIs in non-small cell lung cancer: an ambispective cohort study.",
      "journal": "European journal of pharmacology",
      "pubdate": "2025-11-05T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40962011/",
      "url_doi": "https://doi.org/10.1016/j.ejphar.2025.178168",
      "abstract": "The objective of this study was to quantify the impact of longitudinal tumour dynamics, time-varying drug-related adverse events (DRAEs), and other clinical characteristics on long-term outcomes in patients with non-small cell lung cancer (NSCLC) treated with epidermal growth factor receptor tyrosine kinase inhibitors (EGFR-TKIs). An ambispective cohort of 277 patients was analysed and externally validated using independent clinical trial data from 470 patients in the Project Data Sphere. Individual tumour growth trajectories were characterised by predicted sum of the longest diameters (SLD) using tumour growth inhibition (TGI) modelling. Time-dependent Cox and parametric time-to-event models were then applied to evaluate the influence of predicted tumour growth trajectories, observed dynamic DRAE profiles, cross-sectional variables derived from these measures, and additional covariates on time-to-treatment failure (TTF) and progression-free survival (PFS). The TGI models effectively captured individual tumour dynamics. Across both Cox and parametric time-to-event models, prognostic factors consistently included DRAEs, baseline metastasis, EGFR-TKI treatment history, and the specific EGFR-TKI administered. Notably, grade 2 DRAEs were associated with an optimal balance between efficacy and safety, and this association remained robust in sensitivity analyses and was preliminarily validated using external data. These findings emphasise the clinical relevance of DRAE grades in indicating long-term clinical benefit. By linking manageable toxicity with durable therapeutic outcomes, the study provides valuable insights for developing safe and effective EGFR-TKI treatment strategies in patients with NSCLC."
    },
    {
      "pmid": "40961811",
      "doi": "10.1016/j.ejca.2025.115779",
      "title": "Atezolizumab with carboplatin plus nab-paclitaxel combination therapy for TTF-1 negative advanced nonsquamous non-small cell lung cancer: A multicenter, single-arm phase 2 trial (F1NE TUNE, LOGiK 2102).",
      "journal": "European journal of cancer (Oxford, England : 1990)",
      "pubdate": "2025-10-16T00:00:00+00:00",
      "pubtypes": [
        "Journal Article",
        "Multicenter Study"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://doi.org/10.1016/j.ejca.2025.115779",
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40961811/",
      "url_doi": "https://doi.org/10.1016/j.ejca.2025.115779",
      "abstract": "BACKGROUND: Individuals with thyroid transcription factor-1 (TTF-1)-negative nonsquamous non-small cell lung cancer (NSCLC) have a poor prognosis. There have been no prospective studies targeting TTF-1-negative nonsquamous NSCLC.\n\nMETHODS: This multicenter, single-arm phase 2 study enrolled chemotherapy-naïve individuals with TTF-1-negative advanced nonsquamous NSCLC to receive four cycles of atezolizumab in combination with carboplatin plus nab-paclitaxel, followed by atezolizumab alone. The primary endpoint was progression-free survival (PFS).\n\nRESULTS: Between June 2022 and March 2024, 52 patients (41 male and 11 female) with a median age of 68.0 years were enrolled. Thirty-three patients had adenocarcinoma and 19 had nonadenocarcinoma. Nineteen, 30, and 3 patients were current, former, and never-smokers, respectively. The PD-L1 tumor proportion score was < 1 % in 22 cases, 1-49 % in 18 cases, ≥ 50 % in 11 cases, and unknown in 1 case. The median PFS was 4.9 months (80 % confidence interval [CI], 4.3-5.9 months). The lower limit of the 80 % CI did not exceed the prespecified threshold of 4.5 months; therefore, the study did not meet its primary endpoint. The median overall survival was 13.2 months (95 % CI, 10.3-27.2 months). The response rate was 56.9 % (95 % CI, 43.3-69.5 %). There were no new safety signals.\n\nCONCLUSIONS: This first prospective study of individuals with TTF-1-negative advanced nonsquamous NSCLC has provided evidence for the efficacy and safety of the combination of carboplatin plus nab-paclitaxel with atezolizumab in such patients. The prognosis of TTF-1-negative advanced nonsquamous NSCLC remains poor, however, warranting further treatment development."
    },
    {
      "pmid": "40957291",
      "doi": "10.1016/j.ejca.2025.115693",
      "title": "A phase II study of afatinib in combination with pemetrexed and carboplatin in patients with EGFR mutation-positive non-squamous, advanced non-small cell lung cancer (NSCLC) refractory to first-line osimertinib treatment: NEJ025B study.",
      "journal": "European journal of cancer (Oxford, England : 1990)",
      "pubdate": "2025-10-16T00:00:00+00:00",
      "pubtypes": [
        "Journal Article",
        "Multicenter Study"
      ],
      "entity": "NSCLC",
      "trial_type": "Phase II",
      "study_class": "Prospective",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40957291/",
      "url_doi": "https://doi.org/10.1016/j.ejca.2025.115693",
      "abstract": "BACKGROUND: Osimertinib is commonly used as a first-line treatment for EGFR-mutated advanced non-small cell lung cancer (NSCLC). However, the optimal treatment strategy following osimertinib failure remains unclear.\n\nMETHODS: Patients with EGFR-mutated NSCLC and exon 19 deletion or L858R mutation after failure of osimertinib treatment were assigned to a regimen of afatinib (20 mg daily) combined with carboplatin (AUC 5 mg/mL/min) and pemetrexed (500 mg/m\n\nRESULTS: Thirty-six patients were enrolled. One patient met the exclusion criteria, and the efficacy was evaluated in the remaining 35 patients. The 6M-PFSR, the primary endpoint, was 57.1 %. The confidence interval of 39.3-71.5 % exceeded the predefined threshold of 35 %, thereby meeting its primary endpoint. Notably, 28.6 % of patients achieved a long-term PFS of 1 year or longer. The objective response rate (ORR) was 51.4 %, the disease control rate (DCR) was 88.6 %, the median PFS was 8.2 months, the median duration of response (DOR) was 5.6 months, and the median overall survival (OS) was 22.5 months. The most common adverse events were diarrhea (52.8 %) and anorexia (47.2 %), both of which were predictable and manageable. Interstitial pneumonia developed in three patients (8.3 %), one of whom died. Another patient died from sepsis, bringing the total number of deaths in the study to two.\n\nCONCLUSIONS: The combination of afatinib and the platinum doublet demonstrated satisfactory efficacy with manageable adverse events in tumors refractory to osimertinib, meeting its primary endpoint.\n\nTRIAL REGISTRATION NUMBER: jRCTs021200005."
    },
    {
      "pmid": "41082707",
      "doi": "10.1200/JCO-25-00036",
      "title": "Simultaneous Durvalumab and Platinum-Based Chemoradiotherapy in Unresectable Stage III Non-Small Cell Lung Cancer: The Phase III PACIFIC-2 Study.",
      "journal": "Journal of clinical oncology : official journal of the American Society of Clinical Oncology",
      "pubdate": "2025-10-13T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": "Phase III",
      "study_class": "Prospective",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41082707/",
      "url_doi": "https://doi.org/10.1200/JCO-25-00036",
      "abstract": "PURPOSE: Immunotherapy targeting PD-L1 improves outcomes in patients with unresectable stage III non-small cell lung cancer (NSCLC) and no progression after definitive, concurrent chemoradiotherapy (cCRT). Earlier administration of immunotherapy, simultaneously with cCRT, may improve outcomes further.\n\nMETHODS: Eligible patients were randomly assigned (2:1) to receive either durvalumab or placebo administered from the start of cCRT. Patients without progression after completing cCRT received consolidation durvalumab or placebo (per initial random assignment) until progression. The primary end point was progression-free survival (PFS) by blinded independent central review. Key secondary end points included objective response rate (ORR), overall survival (OS), the proportion of patients alive at 24 months (OS24), and safety.\n\nRESULTS: In total, 328 patients were randomly assigned to receive durvalumab (n = 219) or placebo (n = 109). There was no statistically significant difference with durvalumab versus placebo in PFS (hazard ratio [HR], 0.85 [95% CI, 0.65 to 1.12];\n\nCONCLUSION: Among patients with unresectable stage III NSCLC, durvalumab administered from the start of cCRT failed to demonstrate additional benefit compared with cCRT plus placebo. Consolidation durvalumab following definitive cCRT remains the standard of care in this setting."
    },
    {
      "pmid": "41082894",
      "doi": "10.1016/S1470-2045(25)00485-1",
      "title": "Radiotherapy-free approach in inoperable locally advanced non-small-cell lung cancer: are we ready for this shift?",
      "journal": "The Lancet. Oncology",
      "pubdate": "2025-10-10T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41082894/",
      "url_doi": "https://doi.org/10.1016/S1470-2045(25)00485-1",
      "abstract": null
    },
    {
      "pmid": "41082893",
      "doi": "10.1016/S1470-2045(25)00462-0",
      "title": "Radiotherapy-free pembrolizumab combined with chemotherapy for locally advanced non-small-cell lung cancer with PD-L1 tumour proportion score of 50% or higher (Evolution trial): a multicentre, single-arm, phase 2 study.",
      "journal": "The Lancet. Oncology",
      "pubdate": "2025-10-10T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41082893/",
      "url_doi": "https://doi.org/10.1016/S1470-2045(25)00462-0",
      "abstract": "BACKGROUND: The standard of care for unresectable, locally advanced non-small-cell lung cancer (NSCLC) is chemoradiotherapy followed by durvalumab. This study (Evolution trial WJOG11819L) aimed to evaluate the efficacy and safety of radiotherapy-free pembrolizumab and chemotherapy in patients with unresectable, locally advanced NSCLC with a PD-L1 tumour proportion score (TPS) of 50% or higher.\n\nMETHODS: This prospective, multicentre, single-arm, phase 2 study was conducted in nine institutes in Japan. Inclusion criteria were age 20 years or older, histologically confirmed unresectable, locally advanced NSCLC with a PD-L1 TPS of 50% or higher, an Eastern Cooperative Oncology Group performance status of 0 or 1, at least one measurable lesion, no previous systemic therapy, and adequate organ function. Patients received intravenous induction therapy comprising pembrolizumab 200 mg every 3 weeks plus platinum-based chemotherapy for four cycles: either cisplatin 75 mg/m\n\nFINDINGS: Between May 18, 2020, and Feb 22, 2022, 21 patients were assessed for eligibility and all were enrolled. Median age was 73 years (IQR 68-80); 16 (76%) patients were male; race and ethnicity data were not collected. Three (14%) patients discontinued and 18 (86%) patients completed the induction therapy; eight (38%) patients discontinued during maintenance therapy and ten (48%) patients completed the maintenance therapy. Median follow-up was 32·5 months (IQR 26·2-39·5). The 2-year progression-free survival rate was 67% (90% CI 46-83). The most common grade 3 or worse adverse events were neutropenia (eight [38%] of 21 patients), leukopenia (four [19%]), and pneumonia (three [14%]). Serious adverse events occurred in seven (33%) patients. No treatment-related deaths were reported.\n\nINTERPRETATION: These findings suggest that pembrolizumab combined with platinum-based chemotherapy, without radiotherapy, might provide a feasible and promising alternative treatment strategy for patients with unresectable, locally advanced NSCLC with a PD-L1 TPS of 50% or higher.\n\nFUNDING: Merck Sharp & Dohme."
    },
    {
      "pmid": "40923280",
      "doi": "10.1200/JCO-25-00788",
      "title": "Phase II Dose-Randomized Study of Sunvozertinib in Platinum-Pretreated Non-Small Cell Lung Cancer With Epidermal Growth Factor Receptor Exon 20 Insertion Mutations (WU-KONG1B).",
      "journal": "Journal of clinical oncology : official journal of the American Society of Clinical Oncology",
      "pubdate": "2025-10-10T00:00:00+00:00",
      "pubtypes": [
        "Journal Article",
        "Randomized Controlled Trial",
        "Multicenter Study"
      ],
      "entity": "NSCLC",
      "trial_type": "RCT",
      "study_class": "Prospective",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40923280/",
      "url_doi": "https://doi.org/10.1200/JCO-25-00788",
      "abstract": "PURPOSE: WU-KONG1B (ClinicalTrials.gov identifier: NCT03974022) is a multinational phase II, dose-randomized study to assess the antitumor efficacy of sunvozertinib in pretreated patients with advanced non-small cell lung cancer (NSCLC) with epidermal growth factor receptor (\n\nMETHODS: Eligible patients with advanced-stage\n\nRESULTS: Among 85, 89, and 107 efficacy-evaluable patients in 200 mg-rand, 300 mg-rand, and 300 mg-all (including randomly assigned and nonrandomized patients) cohorts, the cORRs were 45.9% (97.5% CI, 33.6% to 58.5%), 47.2% (97.5% CI, 35.1% to 59.5%), and 45.8% (97.5% CI, 34.8% to 57.0%), respectively, per IRC assessment. The predefined null hypothesis was rejected with statistical significance (\n\nCONCLUSION: Sunvozertinib is efficacious at both 200 and 300 mg once daily in treating platinum-pretreated patients with advanced"
    },
    {
      "pmid": "41072927",
      "doi": "10.1093/ejcts/ezaf347",
      "title": "Value of Video-Assisted Mediastinal Lymphadenectomy in Mediastinal Staging in Non-Small Cell Lung Cancer Patients.",
      "journal": "European journal of cardio-thoracic surgery : official journal of the European Association for Cardio-thoracic Surgery",
      "pubdate": "2025-10-10T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41072927/",
      "url_doi": "https://doi.org/10.1093/ejcts/ezaf347",
      "abstract": "OBJECTIVES: Mediastinal lymph node staging is essential in the management of patients with non-small cell lung cancer. According to the guideline of the European Society of Thoracic Surgery, invasive staging should be performed in selected patients. The outcome of invasive staging with video-assisted mediastinoscopic lymphadenectomy in patients with potentially respectable non-small cell lung cancer is evaluated in this study.\n\nMETHODS: Patients who underwent invasive mediastinal staging by video-assisted mediastinoscopic lymphadenectomy between 2008 and 2019 received retrospective single-centre analysis. Patients were divided into two groups: one group met the guideline criteria for invasive staging, whereas the other group did not.\n\nRESULTS: 1640 patients were included in the study, 374 (22.8%) of whom had mediastinal lymph node metastases. N2 and N3 status were detected in 300 (18.2%) and 74 (4.5%) patients, respectively. The complication rate for the procedure was 4.8% (n = 79). False negative results were detected in 5 Patients (2.2%). For the entire cohort, the sensitivity, specificity, negative predictive value and accuracy were 98.68% (95% CI 96.95-99.57%), 100% (95% CI 99.65-100%), 99.53 (95% CI 98.88-99.8%), and 99.65% (95% CI 99.19-99.89%), respectively. In the Guideline accordant-group, mediastinal metastases were detected in 370 out of 1463 cases (25.3%), whereas in the other-group metastases were found in 4 out of 177 cases (2.3%), (p < 0.001).\n\nCONCLUSIONS: Video-assisted mediastinoscopic lymphadenectomy is a safe procedure with high sensitivity, specificity, negative predictive value and accuracy. The guideline criteria for selecting patients who should be considered for invasive mediastinal staging are valid.\n\nCLINICAL REGISTRATION NUMBER: Ethics committee of Medical Association Westphalia Lippe (2021-049-f-S)."
    },
    {
      "pmid": "40839841",
      "doi": "10.1200/JCO-25-01448",
      "title": "Reply to: \"Baseline Brain Metastasis Imbalance in TRUST: Implications for Interpreting Intracranial Efficacy of Taletrectinib\" and \"Taletrectinib in ROS1 Fusion-Positive Non-Small Cell Lung Cancer: Promising Yet Premature?\".",
      "journal": "Journal of clinical oncology : official journal of the American Society of Clinical Oncology",
      "pubdate": "2025-10-10T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40839841/",
      "url_doi": "https://doi.org/10.1200/JCO-25-01448",
      "abstract": null
    },
    {
      "pmid": "41068447",
      "doi": "10.1038/s41571-025-01080-4",
      "title": "Unresectable stage III non-small-cell lung cancer: state of the art and challenges.",
      "journal": "Nature reviews. Clinical oncology",
      "pubdate": "2025-10-09T00:00:00+00:00",
      "pubtypes": [
        "Journal Article",
        "Review"
      ],
      "entity": "Thoracic-other",
      "trial_type": "Review/Meta",
      "study_class": "Review",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41068447/",
      "url_doi": "https://doi.org/10.1038/s41571-025-01080-4",
      "abstract": "Despite advances in immunotherapy, unresectable stage III non-small-cell lung cancer (NSCLC) remains a highly challenging disease, with only around one-third of patients remaining disease-free at 5 years. The PACIFIC trial established consolidation with the anti-PD-L1 antibody durvalumab after concurrent chemoradiotherapy as the standard-of-care approach. Furthermore, the LAURA trial has redefined the treatment of patients with stage III unresectable EGFR-mutant NSCLC, demonstrating unprecedented progression-free survival durations with osimertinib consolidation. Despite these advances, novel approaches are urgently needed. Circulating tumour DNA-based monitoring of minimal residual disease is emerging as a personalized method of tailoring treatment duration and escalation strategies. Novel radiotherapy techniques have the potential to provide synergy with immunotherapy while minimizing toxicities. Additionally, ongoing trials evaluating chemoimmunotherapy combinations adapted from the neoadjuvant setting with the potential for conversion to resectable disease might, in the near future, redefine the boundary of surgical resectability. In this Review, we describe the rapidly evolving field of unresectable stage III NSCLC, providing a state-of-the-art overview that includes challenging topics such as biomarkers, personalization of therapy and the role of immunotherapy rechallenge."
    },
    {
      "pmid": "41065506",
      "doi": "10.1158/1078-0432.CCR-25-0952",
      "title": "LRP1B loss predicts sensitivity to immunotherapy in patients with NSCLC: an analysis of the phase 3 Checkmate 026 randomized trial.",
      "journal": "Clinical cancer research : an official journal of the American Association for Cancer Research",
      "pubdate": "2025-10-09T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41065506/",
      "url_doi": "https://doi.org/10.1158/1078-0432.CCR-25-0952",
      "abstract": "PURPOSE: Low-density lipoprotein receptor-related protein 1b (LRP1b) is a cell surface receptor, commonly altered in many cancers and associated with improved responses, progression free survival (PFS) and overall survival (OS) with immune checkpoint inhibition (ICI).\n\nEXPERIMENTAL DESIGN: LRP1b alterations were determined by whole exome sequencing (WES) and associated with PFS and objective response rates (ORR) in patients with non-small cell lung cancer (NSCLC) in post-hoc analysis of the randomized controlled phase 3 Checkmate-026 trial (CM026, NCT02041533) examining chemotherapy vs nivolumab, adjusting for tumor mutational burden (TMB) and clinical features. We separately evaluated a de-identified nationwide (US-based) NSCLC clinico-genomic database (CGDB) for associations of LRP1b alterations and progression-free survival with anti-PD-1 immunotherapy.\n\nRESULTS: In the CGDB cohort of patients with NSCLC (N=18,369), LRP1b mutations were positively associated with TP53/KRAS alterations and inversely with EGFR/RET/MET/ERBB2 alterations and significantly improved PFS with PD-1 inhibition (n=1569, adjusted HR 0.86 p=0.014). In CM026, patients with LRP1b alterations had a statistically significant improvement in ORR to nivolumab vs. LRP1b wild-type (wt) patients (odds ratio 3.5; 95% CI 1.71-7.13; p=0.0006) but not with chemotherapy (odds ratio 0.63; 95% CI 0.32-1.26; p=0.19), adjusting for TMB, age, gender, histology, smoking and performance status. LRP1b mutations were associated with improved PFS with nivolumab (HR 0.66, p=0.04) but not chemotherapy (HR 1.26, p=0.25), also maintained in multivariate and TMB adjusted analysis.\n\nCONCLUSIONS: LRP1b mutations are a candidate predictive biomarker for ICI vs. chemotherapy in NSCLC. Further mechanistic characterization of LRP1b and prospective validation are warranted, and might enable future clinical use."
    },
    {
      "pmid": "41068040",
      "doi": "10.1016/j.lungcan.2025.108790",
      "title": "Corrigendum to \"Characterization and economic burden of KRASG12C-mutant lung cancer in real-world Spanish practice: a retrospective observational study (SILK study)\" [Lung Cancer 206 (2025) 108677].",
      "journal": "Lung cancer (Amsterdam, Netherlands)",
      "pubdate": "2025-10-08T00:00:00+00:00",
      "pubtypes": [
        "Published Erratum"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://www.lungcancerjournal.info/article/S0169-5002(25)00682-8/pdf",
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41068040/",
      "url_doi": "https://doi.org/10.1016/j.lungcan.2025.108790",
      "abstract": null
    }
  ]
}