{
  "generated": "2025-12-05T05:18:06.050697Z",
  "items": [
    {
      "pmid": "41329713",
      "doi": "10.1158/0008-5472.CAN-25-0433",
      "title": "Transfer of Damaged Mitochondria from Cancer Cells to Cancer-Associated Fibroblasts Promotes Tyrosine Kinase Inhibitor Tolerance in EGFR-Mutant Lung Cancer.",
      "journal": "Cancer research",
      "pubdate": "2025-12-02T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://doi.org/10.1158/0008-5472.can-25-0433",
      "metric_name": "SJR",
      "metric_value": 3.879,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41329713/",
      "url_doi": "https://doi.org/10.1158/0008-5472.CAN-25-0433",
      "abstract": "Drug-tolerant persister (DTP) cells drive therapeutic resistance in EGFR-mutant lung adenocarcinoma. Using single-cell RNA sequencing, we identified a clinically significant RGS5+MYL9+ cancer-associated fibroblast (CAF) population that was associated with EGFR tyrosine kinase inhibitor (TKI) resistance and poor prognosis. These CAFs were recruited to DTP niches via CCL11 signaling, and they formed tunneling nanotubes through Miro1/RhoA activation induced by TKI-generated mitochondrial reactive oxygen species (ROS). Remarkably, RGS5+MYL9+ CAFs functioned as \"metabolic sinks\" by accepting tumor-derived damaged mitochondria, thereby promoting DTP survival. Treatment with fasudil, a Rho kinase inhibitor, effectively blocked mitochondrial transfer and restored sensitivity to the EGFR-TKI osimertinib in vivo. Together, this work reveals targetable stromal-tumor crosstalk that sustains DTP populations, proposing a combination therapy for overcoming EGFR-TKI resistance."
    },
    {
      "pmid": "41321105",
      "doi": "10.1158/0008-5472.CAN-25-3547",
      "title": "Can't KEEP Up: UXS1 Dependency Exposes a Pyrimidine Vulnerability in KEAP1-Mutant Lung Cancer.",
      "journal": "Cancer research",
      "pubdate": "2025-12-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": "SJR",
      "metric_value": 3.879,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41321105/",
      "url_doi": "https://doi.org/10.1158/0008-5472.CAN-25-3547",
      "abstract": "Loss-of-function mutations in KEAP1 are found in more than 20% of non-small cell lung cancers. These mutations stabilize the transcription factor NRF2 to induce a battery of antioxidative and cytoprotective genes. Although NRF2 accumulation promotes cancer cell fitness, it also creates several targetable vulnerabilities. In this issue of Cancer Research, Gebru and colleagues reveal the dependency of KEAP1-mutant non-small cell lung cancers on UDP-xylose synthase 1 (UXS1). The authors found that NRF2-driven expression of UDP-glucose 6-dehydrogenase leads to the accumulation of UDP-glucuronic acid. Consequently, loss of UXS1-mediated UDP-glucuronic acid decarboxylation causes sequestration of UDP, depletion of pyrimidine pools, and replication stress, thereby inducing apoptosis and senescence. Importantly, these effects are selective to KEAP1-mutant tumors, with KEAP1 wild-type cells and normal tissue unaffected by UXS1 loss. DNA damage induction with cell-cycle kinase inhibitors synergized with UXS1 loss to promote the death of KEAP1-mutant cells. These findings suggest that UXS1 loss is synthetic lethal with NRF2 activation and may be a promising target for therapy. See related article by Gebru et al., p. 4806."
    },
    {
      "pmid": "40975161",
      "doi": "10.1016/j.canlet.2025.218046",
      "title": "Hinokitiol preferentially suppresses metastatic lung adenocarcinoma via TMDD1-mediated ferroptosis induction and iron-sulfur cluster inhibition.",
      "journal": "Cancer letters",
      "pubdate": "2025-12-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": "SJR",
      "metric_value": 2.756,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40975161/",
      "url_doi": "https://doi.org/10.1016/j.canlet.2025.218046",
      "abstract": "Dysregulated ISC metabolism has been implicated in cancer progression, but its role in LUAD pathogenesis and therapeutic targeting remains poorly understood. Here, we demonstrate that ISC biogenesis is significantly upregulated in LUAD, driven by transcription factors KLF15 and ZNF384, which activate GLRX5, LYRM4, NFS1 and BOLA3 promoters. IL-1β promotes PCAF mitochondrial translocation, releasing EP300 to amplify KLF15/ZNF384-mediated transcriptional activation. The natural monoterpenoid Hinokitiol inhibits LUAD growth by disrupting EP300-KLF15/ZNF384 interactions, suppressing ISC biogenesis gene expression and inducing ferroptosis. Mechanistically, the membrane protein TMDD1, particularly its cytoplasmic domain, promotes Hinokitiol's anti-tumor effects by facilitating EP300-KLF15/ZNF384 dissociation and inhibiting ISC biogenesis. Remarkably, Hinokitiol exhibits stage-dependent efficacy, with superior suppression of metastatic (stage IV) tumors linked to heightened ferroptosis sensitivity. This study not only elucidates the transcriptional machinery governing ISC biogenesis in LUAD but also highlights Hinokitiol's dual mechanism as a promising stage-specific therapeutic agent, offering novel strategies for advanced disease management."
    },
    {
      "pmid": "40650354",
      "doi": "10.1002/ijc.70045",
      "title": "Stage- and histology-specific sensitivity for the detection of lung cancer of the NELSON screening protocol-A modeling study.",
      "journal": "International journal of cancer",
      "pubdate": "2025-12-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://onlinelibrary.wiley.com/doi/pdfdirect/10.1002/ijc.70045",
      "metric_name": "SJR",
      "metric_value": 2.252,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40650354/",
      "url_doi": "https://doi.org/10.1002/ijc.70045",
      "abstract": "The Dutch-Belgian lung cancer (LC) screening trial (Nederlands-Leuvens Longkanker Screenings Onderzoek [NELSON]) demonstrated low-dose computed tomography (CT) reduces LC mortality by 24% among men. The NELSON protocol differed from previous trials in the eligibility criteria, the use of volume-based nodule management, and increasing screening intervals. The early-stage sensitivity of the protocol is pivotal in determining the optimal screening strategy, such as the interval and age range. The MIcrosimulation SCreening ANalysis-Lung natural history model was used to reproduce LC incidence and mortality by detection method (clinical or screen-detected), sex, histology, and stage in the NELSON trial based on individual-level data. We evaluated screening effectiveness by stage and histology, accounting for population characteristics, trial design, and LC epidemiology. We find stage IA non-small cell LC (NSCLC) sensitivity of 24.6% (other NSCLC) to 41.0% (adenocarcinoma) at baseline screening. At repeat screening rounds, we find this increased to 70.9% for stage IA adenocarcinoma. For stage IB, the sensitivity by histology ranges from 26.4% to 77.1%; for stage II, 39.6%-81.9%. Upon detection, the probability of LC mortality prevention is estimated at 83% for stage IA. The sensitivity for detecting early-stage LC is found to depend on the histology of cancer and is increased for adenocarcinoma at repeat screenings. Despite a low rate of referral to follow-up screening in the NELSON trial, early-stage CT sensitivity and the probability of mortality prevention were similar to previous estimates from the National Lung cancer Screening Trial. Previously demonstrated screening effectiveness may be maintained when implementing new programs, while reducing unnecessary follow-up when considering NELSON evidence."
    },
    {
      "pmid": "41067998",
      "doi": "10.1016/j.cllc.2025.08.007",
      "title": "Central Nervous System Outcomes of Lazertinib Treatment in EGFR-Mutated Advanced NSCLC: Pooled Analysis From LASER201 and LASER301.",
      "journal": "Clinical lung cancer",
      "pubdate": "2025-12-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://doi.org/10.1016/j.cllc.2025.08.007",
      "metric_name": "SJR",
      "metric_value": 1.515,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41067998/",
      "url_doi": "https://doi.org/10.1016/j.cllc.2025.08.007",
      "abstract": "BACKGROUND: Lazertinib, a brain-penetrant, third-generation epidermal growth factor receptor (EGFR) tyrosine kinase inhibitor (TKI), significantly improved efficacy in patients with treatment-naïve, EGFR-mutated advanced non-small cell lung cancer (NSCLC) in the clinical trials, LASER201 and LASER301. This analysis evaluated the efficacy and safety of lazertinib in patients with EGFR-mutated NSCLC and CNS metastases using pooled data from LASER201 and LASER301.\n\nPATIENTS AND METHODS: Patients with treatment-naïve, EGFR-mutated advanced NSCLC and stable CNS metastases who were treated with lazertinib in a cohort of LASER201 and LASER301 were included. Intracranial progression-free survival (iPFS), intracranial objective response rate (iORR), intracranial disease control rate (iDCR), intracranial duration of response (iDoR), and treatment-emergent adverse events (TEAEs) were assessed.\n\nRESULTS: A total of 64 patients were included in the intracranial full analysis set (iFAS); 24 patients had at least 1 measurable CNS lesion at baseline. The median iPFS was 27.7 months (95% CI: 15.7-32.8) in the iFAS population. For patients with at least 1 measurable CNS lesion at baseline, iORR was 92% and iDCR was 96%. The median iDoR was 26.5 months (95% CI: 8.3-30.1). TEAEs were reported in 98% of patients in the iFAS population, with grade ≥3 TEAEs occurring in 55% of patients. The most common TEAEs were paresthesia (47%), rash (41%), and pruritus (36%).\n\nCONCLUSION: In this pooled analysis of LASER201 and LASER301, lazertinib demonstrated a clinically meaningful treatment benefit and consistent safety profile in patients with EGFR-mutated advanced NSCLC and CNS metastases."
    },
    {
      "pmid": "40973606",
      "doi": "10.1016/j.cllc.2025.08.012",
      "title": "A Phase 2 Study of Osimertinib in Combination With Platinum-Pemetrexed in Patients With Uncommon Epidermal Growth Factor Receptor-Mutated Advanced Non-Small Cell Lung Cancer (NEJ067/OPAL2).",
      "journal": "Clinical lung cancer",
      "pubdate": "2025-12-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": "SJR",
      "metric_value": 1.515,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40973606/",
      "url_doi": "https://doi.org/10.1016/j.cllc.2025.08.012",
      "abstract": "BACKGROUND: In treatment-naïve advanced non-small cell lung cancer (NSCLC) patients with epidermal growth factor receptor (EGFR) mutations, approximately 10% to 15% correspond to uncommon mutations. For patients with EGFR uncommon mutations, monotherapy with either a second-generation EGFR tyrosine kinase inhibitor (TKI), afatinib, or a third-generation EGFR-TKI, osimertinib, is recommended as the initial therapy. However, needs remain unmet for patients with central nervous system (CNS) metastases and those who do not respond adequately to single-agent TKI therapy for EGFR uncommon mutations. The recently published FLAURA2 trial showed that osimertinib in combination with platinum-pemetrexed significantly prolonged progression-free survival (PFS) and provided high disease control compared with osimertinib monotherapy for common mutations. Therefore, we planned this phase II study to evaluate the efficacy and safety of osimertinib in combination with platinum-pemetrexed in treatment-naïve NSCLC patients with EGFR uncommon mutations.\n\nPATIENTS AND METHODS: Forty patients will be enrolled in the study. The primary endpoint is the objective response rate, and the secondary endpoints include safety, PFS and overall survival in overall patients, patients with and without CNS lesions at baseline and according to mutation subtype.\n\nCONCLUSIONS: In this study, we will explore the efficacy and safety of osimertinib in combination with platinum-pemetrexed in treatment-naïve NSCLC patients with EGFR uncommon mutations. Our findings may provide treatment options for patients with EGFR uncommon mutations, especially those with CNS metastases or those requiring more intensive treatment."
    },
    {
      "pmid": "40887341",
      "doi": "10.1016/j.cllc.2025.08.001",
      "title": "Durvalumab Plus Platinum-Etoposide in Extensive-Stage Small-Cell Lung Cancer: Outcomes in Age, Sex, and Platinum Subgroups From the Phase 3 CASPIAN Study.",
      "journal": "Clinical lung cancer",
      "pubdate": "2025-12-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article",
        "Randomized Controlled Trial",
        "Multicenter Study"
      ],
      "entity": "Thoracic-other",
      "trial_type": "RCT",
      "study_class": "Prospective",
      "is_oa": true,
      "oa_url": "https://www.clinical-lung-cancer.com/article/S1525-7304(25)00164-0/pdf",
      "metric_name": "SJR",
      "metric_value": 1.515,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40887341/",
      "url_doi": "https://doi.org/10.1016/j.cllc.2025.08.001",
      "abstract": "INTRODUCTION: In the phase 3 CASPIAN study, first-line durvalumab plus etoposide combined with either carboplatin or cisplatin (EP) significantly improved overall survival (OS) versus EP alone in treatment-naïve extensive-stage small-cell lung cancer (ES-SCLC). We report exploratory subgroup analyses from CASPIAN.\n\nMETHODS: Patients with untreated ES-SCLC were randomized to durvalumab plus EP or EP alone. We analyzed OS and safety in subgroups defined by age, sex, and planned platinum agent, and patient-reported outcomes (PROs) by age.\n\nRESULTS: Of 537 patients (durvalumab plus EP: n = 268; EP alone: n = 269), 80.6% versus 19.4% were aged <70 versus ≥70 years; 69.6% versus 30.4% were male versus female; and planned platinum was cisplatin versus carboplatin in 25.1% versus 74.9%. The OS HRs for durvalumab plus EP versus EP were 0.71 (95% CI, 0.58-0.88) versus 0.74 (95% CI, 0.49-1.11) for patients aged <70 versus ≥70 years; 0.76 (95% CI, 0.62-0.95) versus 0.60 (95% CI, 0.42-0.84) for males versus females; and 0.65 (95% CI, 0.45-0.94) versus 0.74 (95% CI, 0.60-0.91) for planned cisplatin versus carboplatin. With durvalumab plus EP, rates of grade 3/4 adverse events (AEs) were similar across subgroups; serious AEs were more frequent in patients aged ≥70 versus <70 years; and immune-mediated AEs were more common in females versus males. Adding durvalumab to EP had no detrimental effect on PROs in either age subgroup.\n\nCONCLUSIONS: These findings support the use of durvalumab plus EP as first-line standard of care for ES-SCLC. Additional trials focused on elderly populations would be informative."
    },
    {
      "pmid": "40946254",
      "doi": "10.1007/s40487-025-00378-8",
      "title": "First-Line Tislelizumab Plus Chemotherapy in Advanced Non-Squamous Non-Small Cell Lung Cancer: PD-L1 ≥ 50% Subgroup Analysis from the RATIONALE-304 Trial.",
      "journal": "Oncology and therapy",
      "pubdate": "2025-12-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Preclinical",
      "is_oa": true,
      "oa_url": "https://doi.org/10.1007/s40487-025-00378-8",
      "metric_name": "SJR",
      "metric_value": 1.33,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40946254/",
      "url_doi": "https://doi.org/10.1007/s40487-025-00378-8",
      "abstract": "INTRODUCTION: RATIONALE-304 compared first-line tislelizumab (a programmed cell death protein 1 inhibitor) plus chemotherapy versus chemotherapy in advanced non-squamous non-small cell lung cancer (nsq-NSCLC). This exploratory analysis focused on patients with tumor cell programmed death ligand 1 (PD-L1) expression ≥ 50%.\n\nMETHODS: Patients with stage IIIB/IV nsq-NSCLC were randomized (2:1) to tislelizumab plus platinum-based chemotherapy and pemetrexed every 3 weeks, followed by maintenance tislelizumab and pemetrexed, or platinum-based chemotherapy and pemetrexed followed by maintenance pemetrexed. The primary endpoint was independent review committee (IRC)-assessed progression-free survival (PFS); secondary endpoints included overall survival (OS), IRC-assessed objective response rates, and safety.\n\nRESULTS: The PD-L1 ≥ 50% population included 110 patients (tislelizumab plus chemotherapy, n = 74; chemotherapy, n = 36); 71.8% (n = 79) were male and 28.2% (n = 31) were female. Consistent with the final analysis (median follow-up 16.5 months), the 4-year follow-up data (median follow-up 23.4 months) continued to show an improvement in median PFS (17.2 vs. 4.6 months; stratified HR 0.29, 95% CI 0.17-0.50) and median OS (41.9 vs. 13.1 months; stratified HR 0.38, 95% CI 0.23-0.62) for patients who received tislelizumab plus chemotherapy versus chemotherapy. An additional post hoc analysis showed no significant differences in PFS or OS between PD-L1 50-89% and ≥ 90% subgroups in the tislelizumab plus chemotherapy arm. The safety profile of tislelizumab plus chemotherapy was manageable and consistent with previous analyses.\n\nCONCLUSIONS: In patients with advanced nsq-NSCLC and PD-L1 tumor cell expression ≥ 50%, first-line tislelizumab plus chemotherapy demonstrated clinically meaningful improvement in PFS and OS versus chemotherapy. Efficacy was consistent across subgroups of patients with high PD-L1 tumor cell expression levels (50-89% and ≥ 90%).\n\nTRIAL REGISTRATION: Clinical Trials.gov NCT03663205."
    },
    {
      "pmid": "41275660",
      "doi": "10.1016/j.oraloncology.2025.107791",
      "title": "Subcutaneous amivantamab in recurrent/metastatic head and neck squamous cell cancer after disease progression on checkpoint inhibitor and chemotherapy: Preliminary results from the phase 1b/2 OrigAMI-4 study.",
      "journal": "Oral oncology",
      "pubdate": "2025-12-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://doi.org/10.1016/j.oraloncology.2025.107791",
      "metric_name": "SJR",
      "metric_value": 1.326,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41275660/",
      "url_doi": "https://doi.org/10.1016/j.oraloncology.2025.107791",
      "abstract": "Overexpression of EGFR and MET occurs in a high proportion of recurrent and/or metastatic (R/M) head and neck squamous cell carcinoma (HNSCC). Amivantamab, an EGFR-MET bispecific antibody with immune-cell directing activity, is approved in EGFR-mutated advanced non-small cell lung cancer and is being evaluated in phase 3 trials for other solid tumors. Cohort 1 of OrigAMI-4 (NCT06385080) enrolled adult participants with human papillomavirus-unrelated R/M HNSCC with disease progression on/after prior checkpoint inhibitor and platinum-based chemotherapy. Subcutaneous amivantamab was administered at 1600 mg (2240 mg for ≥ 80 kg body weight) on Cycle 1 Day 1 and 2400 mg (3360 mg for ≥ 80 kg body weight) thereafter. Primary end point was investigator-assessed objective response rate (ORR). As of July 1, 2025 (median follow-up, 3.5 months [range, 0-13.4]), 86 participants (median age, 63.5 years; 45 % Asian; 43 % White) received ≥ 1 dose of subcutaneous amivantamab. Subcutaneous amivantamab was well tolerated. Administration-related reactions were reported in 7 % (n = 6/86) of participants; no new safety signals were observed. In the efficacy population (n = 38; median follow-up, 8.3 months [range, 1.1-13.4]), confirmed ORR was 45 % (95 % CI, 29 %-62 %), median time to first response was 6.4 weeks (range, 5.7-18.3), and median duration of response was 7.2 months (95 % CI, 5.3-NE). The clinical benefit rate (responder or durable stable disease) was 76 % (95 % CI, 60 %-89 %). Median progression-free survival was 6.8 months (95 % CI, 4.2-9.0). Subcutaneous amivantamab as second-/third-line treatment among participants with R/M HNSCC demonstrated rapid and durable antitumor activity. The safety profile of subcutaneous amivantamab was consistent with previous studies."
    },
    {
      "pmid": "41116141",
      "doi": "10.1007/s12325-025-03365-7",
      "title": "A Time and Motion Study Comparing Subcutaneous Pembrolizumab Versus Intravenous Pembrolizumab in Combination with Chemotherapy for the Treatment of Metastatic Non-small Cell Lung Cancer.",
      "journal": "Advances in therapy",
      "pubdate": "2025-12-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article",
        "Multicenter Study",
        "Randomized Controlled Trial"
      ],
      "entity": "NSCLC",
      "trial_type": "RCT",
      "study_class": "Prospective",
      "is_oa": true,
      "oa_url": "https://link.springer.com/content/pdf/10.1007/s12325-025-03365-7.pdf",
      "metric_name": "SJR",
      "metric_value": 1.236,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41116141/",
      "url_doi": "https://doi.org/10.1007/s12325-025-03365-7",
      "abstract": "INTRODUCTION: Subcutaneous (SC) formulations of oncology therapies could provide time-saving benefits for both patients and healthcare professionals (HCPs) compared with intravenous (IV) delivery. This prospective observational study, conducted alongside the MK-3475A-D77 phase 3, open-label randomized clinical trial, quantifies HCP and patient time with pembrolizumab SC versus pembrolizumab IV among patients with metastatic non-small cell lung cancer.\n\nMETHODS: Seventeen sites across eight countries in Europe (n = 4), South America (n = 3), and Asia (n = 1) were enrolled. Primary endpoints were active HCP time; patient time in the treatment chair, treatment room, and healthcare facility; and consumables usage. Descriptive statistics included weighted mean (WM), and a linear mixed model (LMM) was employed to explore differences in time measures between pembrolizumab SC and pembrolizumab IV per visit.\n\nRESULTS: Overall, 212 observations were analyzed (153 SC and 59 IV). Total active HCP time was reduced by 45.6% with SC versus IV (WM, 14.0 vs 25.8 min); HCPs spent 44.3% less time on the drug preparation process with SC versus IV (WM, 5.1 vs 9.1 min) and 46.3% less time on the drug administration process with SC versus IV (WM, 8.9 vs 16.7 min). Patient chair time was reduced by 49.6% with SC versus IV (WM, 59.0 vs 117.2 min). Patients receiving SC spent less time in the treatment room than those receiving IV (WM, 66.7 vs 126.9 min; difference - 47.4%). Exploratory LMM showed considerable between-group differences for active HCP time and patient time in the treatment chair and treatment room.\n\nCONCLUSION: Pembrolizumab SC substantially reduces active HCP time and patient chair time versus pembrolizumab IV. Time liberated for HCPs could be reallocated toward additional patient care activities, while optimized chair utilization could improve overall healthcare efficiency."
    },
    {
      "pmid": "41237754",
      "doi": "10.1016/j.thromres.2025.109525",
      "title": "Venous thrombosis in lung cancer compared with other tumors: results from the TESEO-SEOM registry.",
      "journal": "Thrombosis research",
      "pubdate": "2025-12-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article",
        "Multicenter Study"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": "SJR",
      "metric_value": 0.972,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41237754/",
      "url_doi": "https://doi.org/10.1016/j.thromres.2025.109525",
      "abstract": "BACKGROUND: Cancer-associated venous thromboembolism (VTE) is a major adverse prognostic factor with heterogeneous outcomes across tumor types. We aimed to describe the characteristics of lung cancer patients with VTE, compare outcomes across malignancies, and assess their association with complications, progression, and survival.\n\nMETHODS: We analyzed TESEO-SEOM, a prospective multicenter registry including patients with active cancer and VTE. Patients were stratified by tumor site, with lung as reference. Outcomes included recurrent VTE, bleeding, and survival. Analyses were stratified by tumor type and VTE presentation (clinically suspected, symptomatic/asymptomatic incidental). Complications were estimated using competing-risk methods.\n\nRESULTS: Among 3855 patients, the most frequent cancers were gastrointestinal (39.4 %), lung (22.2 %), and breast (10.4 %). Pulmonary embolism predominated (55 %), especially in lung cancer (69.8 %). Overall, 48.9 % of events were clinically suspected and 50.9 % incidental; suspected were more common in lung cancer (53.9 %), whereas incidental diagnoses predominated in gastrointestinal tumors (58.8 %). Complications occurred in 17.6 % (10.2 % bleeding, 7.4 % recurrent VTE). Recurrence was highest in gastrointestinal cancers (11.4 %, Gray's p = 0.022), while bleeding did not differ (p = 0.213). VTE-related mortality was low (1 %), while mixed-cause mortality was highest in lung cancer (17.2 %). Median PFS and OS were shortest in lung cancer (4.5 and 7.7 months, p < 0.0001). Incidental asymptomatic events conferred longer survival, particularly in lung cancer (OS 11.5 vs. 7.3 months for symptomatic incidental and 5.6 for suspected, p < 0.001).\n\nCONCLUSION: VTE in lung cancer is associated with more severe presentation, higher mixed-cause mortality, and worse survival than in other tumors. Incidental asymptomatic VTE predicts better outcomes, supporting risk stratification by tumor type and presentation."
    },
    {
      "pmid": "41331169",
      "doi": "10.1007/s12672-025-04168-6",
      "title": "A deep learning model for multiclass lung cancer classification using multimodal data fusion.",
      "journal": "Discover oncology",
      "pubdate": "2025-12-02T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://doi.org/10.1007/s12672-025-04168-6",
      "metric_name": "SJR",
      "metric_value": 0.88,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41331169/",
      "url_doi": "https://doi.org/10.1007/s12672-025-04168-6",
      "abstract": null
    },
    {
      "pmid": "41108995",
      "doi": "10.1016/j.suronc.2025.102309",
      "title": "Mediastinal staging with video-assisted mediastinoscopic lymphadenectomy after endobronchial ultrasound-guided transbronchial needle aspiration: real-world evidence in 228 patients.",
      "journal": "Surgical oncology",
      "pubdate": "2025-12-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Preclinical",
      "is_oa": false,
      "oa_url": null,
      "metric_name": "SJR",
      "metric_value": 0.792,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41108995/",
      "url_doi": "https://doi.org/10.1016/j.suronc.2025.102309",
      "abstract": "BACKGROUND: Accurate staging of mediastinal lymph nodes in patients with non-small-cell lung cancer (NSCLC) is essential to determine further management. Current guidelines recommend confirmatory mediastinoscopy for patients with suspicious mediastinal lymph node metastases in image-based staging but negative findings on endobronchial ultrasound-guided transbronchial needle aspiration (EBUS-TBNA). In clinical practice, adherence to these recommendations is low and many physicians omit invasive surgical staging. This study aimed to assess the results of subsequent video-assisted mediastinoscopic lymphadenectomy (VAMLA).\n\nMETHODS: Retrospective single-center cohort analysis of patients who underwent surgery between 2015 and 2019. All patients were diagnosed with potentially resectable lung cancer or FDG-avid pulmonary nodule suspicious for NSCLC and underwent VAMLA following N0-N2 EBUS-TBNA for mediastinal staging.\n\nRESULTS: VAMLA was performed in 228 patients. Nodal upstaging after EBUS-TBNA occurred in 17.5 % of the cases (n = 40). During EBUS-TBNA, 1.72 (±1.06) lymph node stations were sampled, compared to 5.59 (±1.1) resected stations in VAMLA (p < 0.001). Clinical nodal status staged by PET/CT was significantly correlated with the occurrence of nodal upstaging by VAMLA, with an odds ratio of 7.69 in cN2 and 5.88 in patients with cN3, compared to cN0. Complications occurred in 8 patients (3.59 %). VAMLA was false negative in 1 patient (0.4 %).\n\nCONCLUSION: Subsequent VAMLA enables the accurate staging of patients after negative EBUS-TBNA. Overall, 17.5 % of cases had nodal upstaging and would otherwise not have received guideline-compliant treatment for NSCLC. These results underline the role of surgical mediastinal staging after negative EBUS-TBNA in patients with suspicious radiologic findings."
    },
    {
      "pmid": "41217067",
      "doi": "10.1080/20565623.2025.2578145",
      "title": "Plain language summary of the ALINA study results: alectinib compared with chemotherapy after surgery in people with ALK-positive non-small cell lung cancer.",
      "journal": "Future science OA",
      "pubdate": "2025-12-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://doi.org/10.1080/20565623.2025.2578145",
      "metric_name": "SJR",
      "metric_value": 0.536,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41217067/",
      "url_doi": "https://doi.org/10.1080/20565623.2025.2578145",
      "abstract": null
    },
    {
      "pmid": "41205892",
      "doi": "10.1016/j.envpol.2025.127348",
      "title": "Association of radon exposure with lung cancer: serum biomarkers and computed tomography evidence from male miners.",
      "journal": "Environmental pollution (Barking, Essex : 1987)",
      "pubdate": "2026-01-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://doi.org/10.1016/j.envpol.2025.127348",
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41205892/",
      "url_doi": "https://doi.org/10.1016/j.envpol.2025.127348",
      "abstract": "The objective of this research is to investigate the association between occupational radon exposure and pulmonary health outcomes in male miners from Chongqing, China. Between June 2022 and December 2023, 110 miners were enrolled in this cross-sectional study. Personal radon exposure levels were measured using passive cumulative dosimeters, with pulmonary health assessed through radiologist-interpreted low-dose computed tomography (CT) scans and serum biomarker analysis (CEA, CYFRA21-1, NSE, and CA125) via ELISA. Multivariable analyses revealed strong dose-response relationships between radon exposure and both serum biomarkers and CT abnormalities. high radon exposure predicted substantial biomarker elevations including a 2.45-fold increase in CYFRA21-1 (β = 0.39, 95 % CI 0.25-0.54, p < 0.001), 1.60-fold increase in CEA (β = 0.20, 0.05-0.35, p = 0.008), and 3.58-fold increased CT abnormality risk (OR = 3.58, p = 0.023). Mediation analysis identified CYFRA21-1 as accounting for 69 % (p = 0.024) and CEA for 24.7 % (p = 0.036) of radon's effect on CT abnormalities. These findings demonstrate that occupational radon exposure contributes to pulmonary damage through both direct effects and biomarker-mediated pathways, with CYFRA21-1 and CEA emerging as potential early indicators of lung cancer in radon-exposed populations."
    },
    {
      "pmid": "41192233",
      "doi": "10.1016/j.ejca.2025.116059",
      "title": "EORTC 1417 - REACTION: A phase II study of etoposide and cis/carboplatin with or without pembrolizumab in untreated extensive small cell lung cancer.",
      "journal": "European journal of cancer (Oxford, England : 1990)",
      "pubdate": "2025-12-09T00:00:00+00:00",
      "pubtypes": [
        "Journal Article",
        "Randomized Controlled Trial",
        "Multicenter Study"
      ],
      "entity": "SCLC",
      "trial_type": "RCT",
      "study_class": "Prospective",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41192233/",
      "url_doi": "https://doi.org/10.1016/j.ejca.2025.116059",
      "abstract": "BACKGROUND: Anti-PD-L1 antibodies with platinum-etoposide extend overall survival (OS) of extensive disease Small Cell Lung Cancer (ED-SCLC) patients. We evaluated the benefit of first-line pembrolizumab with platinum-etoposide in chemo-sensitive ED-SCLC.\n\nMETHODS: REACTION is a multicenter, open-label, randomized phase II trial. Eligible patients (responders after 2 cycles of platinum-etoposide) were randomized 1:1 to experimental arm pembrolizumab in combination with 4 cycles of platinum-etoposide then pembrolizumab vs platinum-etoposide in the control arm. The primary endpoint was progression free survival (PFS). Circulating tumour cells (CTCs) were enumerated and their association with PFS and OS was investigated.\n\nRESULTS: Between Feb 7, 2018 and Oct 31, 2019, 125 patients were recruited (61 vs 64 experimental and control arms respectively) with 119 (58 vs 61) eligible and receiving at least one dose of treatment. Baseline characteristics were median age 65 vs 63.5 years, PS 1 (62 vs 60 %), and brain metastases (8 vs 11 %), in the experimental and control arms respectively. Amongst 124 patients who started treatment, 46 (37 %) experienced adverse events grade ≥ 3 for pembrolizumab arm vs 26 % in the control arm. Response rate was 61 % (67 vs 56 %). Median PFS (95 % CI) was 4.7 months (4.2, 5.6) vs 5.4 (4.7, 5.6), HR (80 % CI) = 0.84 (0.65, 1.09) and 1-sided p = 0.194. Median OS (95 % CI) was 12.3 months (8.9, 14.8) vs 10.4 (8.2, 12.2), HR (80 % CI) = 0.73 (0.54, 1.0) and 1-sided p = 0.097. CTC count per 7.5 ml blood at randomization was associated significantly with both PFS and OS regardless of treatment arms.\n\nCONCLUSIONS: Pembrolizumab added to platinum-etoposide did not improve PFS over platinum-etoposide alone in chemo-sensitive patients with ED."
    },
    {
      "pmid": "41339316",
      "doi": "10.1038/s41467-025-66803-8",
      "title": "Non-small cell lung cancer molecular subtypes and vulnerability to immunotherapy treatment combinations.",
      "journal": "Nature communications",
      "pubdate": "2025-12-03T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://www.nature.com/articles/s41467-025-66803-8_reference.pdf",
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41339316/",
      "url_doi": "https://doi.org/10.1038/s41467-025-66803-8",
      "abstract": "The phase 3 IMpower150 trial in treatment-naïve patients with metastatic non-small-cell lung cancer (NSCLC) demonstrates significantly longer progression-free (PFS) and overall survival (OS) with first-line atezolizumab (anti-PD-L1)-bevacizumab (anti-VEGF)-carboplatin-paclitaxel (ABCP) than with bevacizumab-carboplatin-paclitaxel (BCP). We characterise four molecular NSCLC subtypes identified by unsupervised clustering of transcriptomes of 564 pre-treatment primary tumour samples from IMpower150 using non-negative matrix factorization (NMF1-4). Each subtype has distinct tumour PD-L1 expression levels, epithelial characteristics, immune composition, and treatment outcomes. Both NMF2 (enriched in tumour proliferation signal, macrophages, and monocytes) and NMF4 (enriched in B cells and T cells) have elevated tumour PD-L1 expression. Of these two, only NMF4 demonstrates PFS and OS benefits with ABCP versus either BCP or atezolizumab-carboplatin-paclitaxel (ACP). Patients with NMF1 (enriched in basal and squamous-like cells) have improved outcomes on ABCP compared with ACP or BCP; those with NMF3 (enriched in adenocarcinoma signatures) show similar outcomes among treatments. These insights could help inform individualised first-line treatment for metastatic NSCLC."
    },
    {
      "pmid": "41325571",
      "doi": "10.1200/JCO-24-02835",
      "title": "Amivantamab Plus Lazertinib in Atypical EGFR-Mutated Advanced Non-Small Cell Lung Cancer: Results From CHRYSALIS-2.",
      "journal": "Journal of clinical oncology : official journal of the American Society of Clinical Oncology",
      "pubdate": "2025-12-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://doi.org/10.1200/jco-24-02835",
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41325571/",
      "url_doi": "https://doi.org/10.1200/JCO-24-02835",
      "abstract": "PURPOSE: For patients with advanced non-small cell lung cancer (NSCLC) harboring atypical epidermal growth factor receptor (\n\nPATIENTS AND METHODS: CHRYSALIS-2 Cohort C enrolled participants with NSCLC harboring atypical\n\nRESULTS: As of January 12, 2024, 105 participants received amivantamab-lazertinib. Most common atypical mutations were G719X (56%), L861X (26%), and S768I (23%), including single and compound mutations. In the overall population (median follow-up: 16.1 months), the ORR was 52% (95% CI, 42 to 62). The median duration of response (mDoR) was 14.1 months (95% CI, 9.5 to 26.2). The median progression-free survival (mPFS) was 11.1 months (95% CI, 7.8 to 17.8); median overall survival (mOS) was not estimable (NE; 95% CI, 22.8 to NE). Adverse events were consistent with previous studies and primarily grade 1 and 2. Among treatment-naïve participants, the ORR was 57% (95% CI, 42 to 71). The mPFS was 19.5 months (95% CI, 11.2 to NE), the mDoR was 20.7 months (95% CI, 9.9 to NE), and mOS was NE (95% CI, 26.3 to NE). Solitary or compound\n\nCONCLUSION: In participants with atypical"
    },
    {
      "pmid": "41232543",
      "doi": "10.1016/S1470-2045(25)00537-6",
      "title": "Defining eligibility for lung cancer screening based on individual risk.",
      "journal": "The Lancet. Oncology",
      "pubdate": "2025-12-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41232543/",
      "url_doi": "https://doi.org/10.1016/S1470-2045(25)00537-6",
      "abstract": null
    },
    {
      "pmid": "41232542",
      "doi": "10.1016/S1470-2045(25)00490-5",
      "title": "Effectiveness of NELSON versus PLCOm2012 lung cancer screening eligibility criteria in Germany (HANSE): a prospective cohort study.",
      "journal": "The Lancet. Oncology",
      "pubdate": "2025-12-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article",
        "Multicenter Study"
      ],
      "entity": "Thoracic-other",
      "trial_type": "Prospective (non-RCT)",
      "study_class": "Prospective",
      "is_oa": true,
      "oa_url": "https://doi.org/10.1016/s1470-2045(25)00490-5",
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41232542/",
      "url_doi": "https://doi.org/10.1016/S1470-2045(25)00490-5",
      "abstract": "BACKGROUND: Low-dose chest CT screening can reduce lung cancer mortality through early diagnosis. Several studies suggest that risk prediction models are more efficient than categorical age and smoking criteria for participant selection, but there are still reservations from policy makers about their implementation. We aimed to compare the effectiveness of a predefined PLCOm2012 model threshold with the categorical NELSON risk criteria.\n\nMETHODS: In this ongoing prospective cohort study, current or former smokers aged 55-79 years who met either NELSON risk criteria or had a PLCOm2012 6-year risk of at least 1·58% were recruited from three certified German lung cancer centres in Großhansdorf, Hannover, and Lübeck, and received low-dose CT at baseline and 1-year follow-up screening rounds, including all downstream follow-up procedures. The PLCOm2012 cutoff point of at least 1·58% was predefined and estimated to result in an equal group size as with the NELSON inclusion criteria. The primary outcome was the comparison of the positive predictive values for lung cancers detected in PLCOm2012-selected versus NELSON-selected groups. Here, we report the final results of the primary analysis. This study is registered with ClinicalTrials.gov, NCT04913155.\n\nFINDINGS: Between July 23, 2021, and Aug 19, 2022 (end of recruitment), 5191 participants (2208 [43·5%] female, 2983 [57·5%] male, and 5076 [97·8%] of European White ethnicity) who met either one or both high-risk criteria were enrolled (4167 PLCOm2012-selected vs 3916 NELSON-selected participants) and underwent the baseline low-dose CT scan. In the observation period between the two low-dose CT screening rounds (mean volume CT dose index 1·15 mGy [SD 0·15]) with a median time interval of 1·05 years (IQR 0·95-1·08), 111 lung cancers were detected. The positive predictive value (lung cancer detection rate) in the PLCOm2012-selected group was 108 of 4167 participants (2·59% [95% CI 2·13-3·12]) compared with 85 of 3916 participants (2·17% [1·74-2·68]) in the NELSON-selected group (p=0·0016), resulting in a lower number needed to screen (38·6 [32·1-46·9] vs 46·1 [37·3-57·5]).\n\nINTERPRETATION: Participant selection using the PLCOm2012 risk prediction model with a 6-year risk of at least 1·58% cutoff is more efficient and effective in detecting lung cancer than the NELSON criteria and should therefore be implemented in lung cancer screening programmes.\n\nFUNDING: Federal Ministry of Education and Research (German Center for Lung Research) and AstraZeneca."
    },
    {
      "pmid": "41327467",
      "doi": "10.1186/s13075-025-03703-8",
      "title": "From autoimmune inflammation to malignancy: causal genetic evidence for the RA-squamous cell lung cancer axis.",
      "journal": "Arthritis research & therapy",
      "pubdate": "2025-12-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://doi.org/10.1186/s13075-025-03703-8",
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41327467/",
      "url_doi": "https://doi.org/10.1186/s13075-025-03703-8",
      "abstract": "BACKGROUND: The association between rheumatoid arthritis (RA) and lung cancer risk has attracted considerable clinical attention, but conclusions remain inconsistent due to confounding factors such as smoking, and previous studies have paid less attention to specific histological subtypes. This study aims to systematically elucidate the complex relationship between the two through an evidence triangulation strategy combining large-scale clinical cohort studies, machine learning risk prediction, and genetic causal inference.\n\nMETHODS: This study adopted an evidence triangulation strategy, integrating evidence from different populations and methods. First layer of evidence (clinical association, Chinese population): We conducted 1:1 propensity score matching analysis on a real-world cohort of 8,867 subjects (4,661 RA patients) (2014-2024, First Teaching Hospital of Tianjin University of Traditional Chinese Medicine), with particular focus on the association between RA and different lung cancer subtypes (adenocarcinoma, squamous cell carcinoma, small cell carcinoma). We also built machine learning models (logistic regression, random forest, XGBoost) based on 22 clinical features from this cohort to explore the feasibility of individualized risk prediction for overall lung cancer. Second layer of evidence (genetic causation, European population): We turned to use completely independent large-scale public GWAS summary data (RA: N = 92,044, European ancestry; squamous cell lung cancer: N = 63,053, European ancestry; smoking: N = 111,752, European ancestry), employing multivariable Mendelian randomization (MVMR) analysis, after adjusting for the genetic effects of smoking, to specifically explore the causal effect of RA on squamous cell lung cancer.\n\nRESULTS: Clinical evidence reveals that the association between RA and lung cancer exhibits significant subtype specificity: after matching, RA significantly increases squamous cell lung cancer risk (adjusted OR = 2.415, 95% CI: 1.104-5.283, P = 0.027), but shows no significant association with adenocarcinoma (P = 0.437) or small cell carcinoma (P = 0.564). Machine learning models based on clinical features showed limited predictive ability (AUC = 0.57-0.68), revealing the challenge of translating population associations into individual predictions. In an independent European population, genetic analysis presents an instructive paradox: preliminary univariable MR analysis shows RA has a genetic protective effect on squamous cell lung cancer (OR = 0.985), while linkage disequilibrium score regression (LDSC) shows no significant genetic correlation between the two (rg = -0.019, P = 0.806). After simultaneously adjusting for the genetic effects of smoking in multivariable MR analysis, the causal promoting effect of RA on squamous cell lung cancer was revealed (OR = 1.02, 95% CI: 1.00-1.04, P = 0.046), explaining that the apparent protective effect observed in univariable analysis was actually caused by smoking confounding.\n\nCONCLUSION: RA specifically increases squamous cell lung cancer (but not other subtypes) risk. Multivariable Mendelian randomization resolves the causal paradox caused by smoking confounding. Clinical evidence (China) and genetic evidence (Europe) come from different populations and require further validation. Results support implementation of targeted squamous cell lung cancer screening for high-risk RA patients."
    },
    {
      "pmid": "41033335",
      "doi": "10.1016/S2213-2600(25)00240-1",
      "title": "Durvalumab, carboplatin, and etoposide in patients who are treatment-naive with extensive-stage small-cell lung cancer and poor performance status (NEJ045A): a single-arm phase 2 trial.",
      "journal": "The Lancet. Respiratory medicine",
      "pubdate": "2025-12-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41033335/",
      "url_doi": "https://doi.org/10.1016/S2213-2600(25)00240-1",
      "abstract": "BACKGROUND: Treating patients with extensive-stage small-cell lung cancer (SCLC) with poor performance status poses considerable challenges. We aimed to evaluate the combination of an immune checkpoint inhibitor with platinum-based therapy in this population.\n\nMETHODS: This open-label, single-arm phase 2 NEJ045A trial enrolled untreated patients with extensive-stage SCLC with performance status 2 or 3. Participants received four cycles of durvalumab, carboplatin, and etoposide, followed by durvalumab maintenance. A dose adjustment strategy was used, with initial reductions in carboplatin-etoposide dosages, subsequently adjusted based on adverse events, allowing for potential escalation. The primary endpoint was tolerability, assessed by the proportion of patients completing induction therapy. A key secondary endpoint was 1-year survival rate. This trial is registered at the Japan Registry of Clinical Trials (jRCTs031200319) and has been completed.\n\nFINDINGS: Between April 8, 2021, and Oct 3, 2023, 57 patients (performance status 2 n=43 and performance status 3 n=14) were enrolled with a median age of 73·5 years (IQR 69·0-77·5), 44 (79%) of 56 were male. 26 (67%; 80% CI 55·2-76·7; p<0·0001) of 39 patients with performance status 2 and five (50%; 26·7-73·3; p=0·0088) of ten with performance status 3 completed induction therapy, exceeding the pre-specified threshold. Grade 3 or higher adverse events occurred in 52 (93%) of 56 patients, and 12 (21%) of 56 discontinued due to adverse events. The 1-year survival rates were 43·4% (80% CI 34·1-53·1) overall (p<0·0001), 50·0% (39·1-60·9) in performance status 2 (p<0·0001), and 18·2% (5·0-41·5) in performance status 3.\n\nINTERPRETATION: Durvalumab, carboplatin, and etoposide showed tolerability and promising efficacy as a first-line treatment for patients with untreated extensive-stage SCLC with poor performance status, supporting the integration of immune checkpoint inhibitors in this therapeutically challenging population.\n\nFUNDING: AstraZeneca KK."
    },
    {
      "pmid": "40983066",
      "doi": "10.1016/S2213-2600(25)00209-7",
      "title": "Retifanlimab versus placebo in combination with platinum-based chemotherapy in patients with first-line non-squamous or squamous metastatic non-small-cell lung cancer (POD1UM-304): a phase 3, multiregional, placebo-controlled, double-blind, randomised study.",
      "journal": "The Lancet. Respiratory medicine",
      "pubdate": "2025-12-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article",
        "Randomized Controlled Trial",
        "Multicenter Study"
      ],
      "entity": "Thoracic-other",
      "trial_type": "RCT",
      "study_class": "Prospective",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40983066/",
      "url_doi": "https://doi.org/10.1016/S2213-2600(25)00209-7",
      "abstract": "BACKGROUND: Checkpoint inhibitors, including combinations with standard-of-care chemotherapy, have shown survival benefit in patients with metastatic non-small-cell lung cancer (NSCLC); however, access to these drugs varies. We aimed to evaluate the efficacy of the PD-1 inhibitor retifanlimab plus platinum-based chemotherapy as first-line treatment for non-squamous or squamous metastatic NSCLC.\n\nMETHODS: POD1UM-304 was a phase 3, multiregional, placebo-controlled, double-blind, randomised study conducted in approximately 124 hospitals and private clinical centres in 16 countries. Male and female adults aged 18 years or older with squamous or non-squamous stage IV NSCLC (staging by American Joint Committee on Cancer version 8) with Eastern Cooperative Oncology Group performance status 0 or 1 and no previous systemic therapy for metastatic NSCLC were eligible. Patients were randomly assigned (2:1) using interactive response technology to receive intravenous retifanlimab 375 mg or matching placebo on day 1 of each 21-day cycle plus standard platinum-based chemotherapy according to tumour histology for up to 2 years. Patients with non-squamous NSCLC received pemetrexed 500 mg/m\n\nFINDINGS: Between Sept 11, 2020, and March 14, 2023, 1388 patients were assessed for eligibility, 583 of whom were randomly assigned to retifanlimab plus chemotherapy (n=391) or placebo plus chemotherapy (n=192). 381 (65%) patients had non-squamous NSCLC and 202 (35%) had squamous NSCLC; 467 (80%) patients were male and 116 (20%) were female. Median age was 64 years (IQR 58-68). Median overall survival was longer in the retifanlimab plus chemotherapy group than in the placebo plus chemotherapy group (18·1 months [95% CI 16·2-21·0] vs 13·4 months [11·0-16·7]; hazard ratio 0·75 [95% CI 0·60-0·93]; p=0·0042). Overall, higher incidences of treatment-emergent adverse events that were serious (158 [41%] of 389 vs 57 [30%] of 190), grade 3 or worse (238 [61%] vs 103 [54%]), or led to retifanlimab or placebo dose delay (169 [43%] vs 67 [35%]) or discontinuation (33 [8%] vs nine [5%]) were observed in the retifanlimab plus chemotherapy group than in the placebo plus chemotherapy group. The proportions of fatal COVID-19-related treatment-emergent adverse events were similar in the retifanlimab plus chemotherapy group and the placebo plus chemotherapy group (four [1%] vs five [3%]).\n\nINTERPRETATION: Retifanlimab improved overall survival compared with placebo when added to platinum-based chemotherapy, with a safety profile that is representative of previous PD-1 and PD-L1 inhibitor-chemotherapy combinations. Adding retifanlimab to first-line chemotherapy could be a potential treatment option for patients with squamous or non-squamous metastatic NSCLC.\n\nFUNDING: Incyte."
    },
    {
      "pmid": "41164890",
      "doi": "10.1080/14796694.2025.2579208",
      "title": "Safety of osimertinib in Chinese patients with non-small cell lung cancer: a multi-center, prospective, observational study.",
      "journal": "Future oncology (London, England)",
      "pubdate": "2025-12-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article",
        "Multicenter Study"
      ],
      "entity": "NSCLC",
      "trial_type": "Prospective (non-RCT)",
      "study_class": "Prospective",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41164890/",
      "url_doi": "https://doi.org/10.1080/14796694.2025.2579208",
      "abstract": "BACKGROUND: This prospective, observational study evaluated the real-world safety of osimertinib in a broad Chinese population with non-small cell lung cancer (NSCLC).\n\nMETHODS: Chinese NSCLC patients who received osimertinib were enrolled and followed up for 12 months. The primary endpoint was the incidence of adverse drug reactions (ADRs).\n\nRESULTS: From 20 April 2020 to 1 August 2022, 1,700 patients were enrolled from 30 centers, with 706 (41.5%) patients ≥65 years old. Osimertinib was administered as first-line, second-line, third/later-line and adjuvant therapy in 44.9%, 34.2%, 14.3% and 4.5% of the patients, respectively. ADRs, adverse events (AEs), Grade ≥3 AEs, and serious AEs were reported in 627 (36.9%), 959 (56.4%), 165 (9.7%), and 102 (6.0%) patients, respectively. AEs of special interests occurred in 59 (3.5%) patients, with 41 (2.4%) and 19 (1.1%) reporting QTc prolongation and interstitial lung disease/pneumonitis-like events, respectively. The safety profiles in patients ≥65 years old and those usually not included in randomized clinical trials were similar to that in the total population.\n\nCONCLUSION: This largest real-world safety study of osimertinib in China demonstrated that osimertinib was well-tolerated in a broad NSCLC population, including patients usually not included in randomized clinical trials, without new safety signals identified.\n\nCLINICAL TRIAL REGISTRATION: NCT03485326 (www.clinicaltrials.gov)."
    },
    {
      "pmid": "41330054",
      "doi": "10.1016/j.ejca.2025.116153",
      "title": "Garsorasib in patients with KRAS G12C-mutated non-small-cell lung cancer: A pooled analysis of phase 1/2 study.",
      "journal": "European journal of cancer (Oxford, England : 1990)",
      "pubdate": "2025-11-29T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41330054/",
      "url_doi": "https://doi.org/10.1016/j.ejca.2025.116153",
      "abstract": "INTRODUCTION: Garsorasib, a KRAS G12C inhibitor, has previously demonstrated its efficacy and safety in patients with KRAS G12C-mutated non-small-cell lung cancer (NSCLC). Here, we present long-term follow-up data from a pooled analysis of the phase 1/2 study.\n\nMETHODS: This multicenter, open-label phase 1/2 study enrolled patients with KRAS G12C-mutated, locally advanced or metastatic NSCLC. The primary endpoints for phase 1 were safety and tolerability and for phase 2 objective response rate (ORR) by a blinded independent review committee per RECIST version 1.1. Data was pooled from patients who received garsorasib 600 mg twice daily.\n\nRESULTS: This pooled dataset included 189 patients (N = 66 in phase 1 and N = 123 in phase 2). The median pooled follow-up time was 13.0 months (IQR: 6.7-17.5). The objective response rate was 48.1 % (95 %CI: 40.8-55.5), and disease control rate was 87.8 % (95 %CI: 82.3-92.1). The median duration of response was 12.45 months (95 % CI: 8.31, 14.49), the median progression-free survival was 9.07 months (95 %CI: 7.39-9.76), and the median overall survival was 14.19 months (95 %CI: 13.08-17.54). Treatment-related adverse events of any grade occurred in 96.3 % of patients, with grade ≥ 3 in 49.2 % of patients. No new safety findings were observed, and most of the adverse events were controllable.\n\nCONCLUSION: This pooled analysis confirmed the robust efficacy and manageable safety of garsorasib in KRAS G12C-mutated NSCLC.\n\nGOV IDENTIFIER: NCT05383898."
    }
  ]
}