{
  "generated": "2025-11-09T05:15:57.924271Z",
  "items": [
    {
      "pmid": "41201442",
      "doi": "10.1158/0008-5472.CAN-25-0995",
      "title": "Characterization of Drug-Tolerant Persister Cells in Triple-Negative Breast Cancer Identifies a Shared Persistence Program across Treatments and Patients.",
      "journal": "Cancer research",
      "pubdate": "2025-11-06T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": "SJR",
      "metric_value": 3.879,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41201442/",
      "url_doi": "https://doi.org/10.1158/0008-5472.CAN-25-0995",
      "abstract": "UNLABELLED: Acquisition of resistance to anticancer therapies is a multistep process initiated by the survival of drug-tolerant persister cells. Accessibility of drug-tolerant persister cells in patients is limited, which has hindered understanding the mechanisms driving their emergence. In this study, using multiple patient-derived models to isolate persister cells, we showed that these cells are transcriptionally plastic in vivo and return to a common treatment naïve-like state upon relapse, regardless of treatment. Hallmarks of the persister state in triple-negative breast cancer (TNBC) across treatment modalities included high expression of basal keratins together with activation of stress response and inflammation pathways. These hallmarks were also activated in HER2+ breast and lung cancer cells in response to targeted therapies. Analysis of gene regulatory networks identified AP-1, NF-κB, and IRF/STAT as the key drivers of this hallmark persister state. Functionally, FOSL1, an AP-1 member, drove cells to the persister state by binding enhancers and reprogramming the transcriptome of cancer cells. On the contrary, cancer cells without FOSL1 had a decreased ability to reach the persister state. By defining hallmarks of TNBC persistence on multiple therapies, this study provides a resource to design effective combination therapeutic strategies that limit resistance.\n\nSIGNIFICANCE: Elucidation of the features of the drug-tolerant persister state in triple-negative breast cancer reveals shared programs across patients and treatments that offer opportunities to prevent persistence and delay tumor recurrence."
    },
    {
      "pmid": "41196054",
      "doi": "10.1158/0008-5472.CAN-25-3502",
      "title": "Enozertinib is a Selective, Brain-penetrant EGFR inhibitor for Treating Non-small Cell Lung Cancers with EGFR Exon 20 and Atypical Mutations.",
      "journal": "Cancer research",
      "pubdate": "2025-11-06T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": "SJR",
      "metric_value": 3.879,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41196054/",
      "url_doi": "https://doi.org/10.1158/0008-5472.CAN-25-3502",
      "abstract": "EGFR mutations are common oncogenic drivers in non-small cell lung cancer (NSCLC), and around one-third of patients develop brain metastases over the course of their disease. Patients with non-classical EGFR mutations, such as insertions in exon 20, are a high unmet need with a worse prognosis compared to patients with classical EGFR mutations. Here, we describe the discovery and development of enozertinib (formerly ORIC-114), a highly brain-penetrant, orally bioavailable, irreversible inhibitor that targets EGFR exon 20 mutations with unparalleled kinome selectivity. Preclinical studies revealed strong potency and tumor regressions driven by enozertinib across a broad range of atypical EGFR mutant models. In a phase I clinical trial of enozertinib in patients with advanced NSCLC bearing atypical mutations in EGFR, a patient with harboring an EGFR exon 20 insertion experienced sustained complete response of all systemic and brain metastases. Together, these findings identify enozertinib as a promising investigational inhibitor to meet the unmet need for brain-penetrant therapies for NSCLC with EGFR exon 20 insertions or other atypical mutations."
    },
    {
      "pmid": "40189749",
      "doi": "10.1080/2162402X.2025.2484880",
      "title": "Surrogate markers of intestinal dysfunction associated with survival in advanced cancers.",
      "journal": "Oncoimmunology",
      "pubdate": "2025-12-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://doi.org/10.1080/2162402x.2025.2484880",
      "metric_name": "SJR",
      "metric_value": 2.542,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40189749/",
      "url_doi": "https://doi.org/10.1080/2162402X.2025.2484880",
      "abstract": "Deviations in the diversity and composition of the gut microbiota are called \"gut dysbiosis\". They have been linked to various chronic diseases including cancers and resistance to immunotherapy. Stool shotgun based-metagenomics informs on the ecological composition of the gut microbiota and the prevalence of homeostatic bacteria such as"
    },
    {
      "pmid": "41194587",
      "doi": "10.1002/1878-0261.70155",
      "title": "Dual targeting of RET and SRC synergizes in RET fusion-positive cancer cells.",
      "journal": "Molecular oncology",
      "pubdate": "2025-11-05T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://onlinelibrary.wiley.com/doi/pdfdirect/10.1002/1878-0261.70155",
      "metric_name": "SJR",
      "metric_value": 1.957,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41194587/",
      "url_doi": "https://doi.org/10.1002/1878-0261.70155",
      "abstract": "Rearranged during transfection (RET) fusions drive subsets of non-small cell lung cancer (NSCLC) and papillary thyroid carcinoma (PTC). Despite new selective RET tyrosine kinase inhibitors (TKIs), resistance usually occurs and is often driven by RET-independent bypass mechanisms. Previous studies have implied crosstalk between RET and proto-oncogene tyrosine-protein kinase SRC, but the anticancer effects of targeting SRC combined with selective RET TKIs, and the underlying molecular mechanisms involved, are not fully understood. Our results show that the multitargeted SRC TKI dasatinib significantly enhanced the efficacy of RET TKIs in RET fusion-positive (RET"
    },
    {
      "pmid": "41184595",
      "doi": "10.1007/s11523-025-01182-0",
      "title": "Amivantamab-Chemotherapy in Non-Small Cell Lung Cancer with EGFR Exon 20 Insertions: Impact of Treatment Crossover and Other Endpoints from the Phase III PAPILLON Study.",
      "journal": "Targeted oncology",
      "pubdate": "2025-11-03T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": "Phase III",
      "study_class": "Prospective",
      "is_oa": true,
      "oa_url": "https://link.springer.com/content/pdf/10.1007/s11523-025-01182-0.pdf",
      "metric_name": "SJR",
      "metric_value": 1.645,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41184595/",
      "url_doi": "https://doi.org/10.1007/s11523-025-01182-0",
      "abstract": "BACKGROUND: In the PAPILLON study, first-line amivantamab-chemotherapy in epidermal growth factor receptor (EGFR) exon 20 insertion-mutated non-small cell lung cancer demonstrated significantly prolonged progression-free survival and favorable overall survival over chemotherapy; a consistent benefit was also observed across some secondary endpoints. However, the complete clinical benefit of first-line amivantamab-chemotherapy is not fully understood, nor is the survival advantage in the presence of per-protocol crossover from chemotherapy to amivantamab after progression.\n\nOBJECTIVE: We aimed to assess time to treatment discontinuation (TTD) and time to subsequent therapy (TTST), at the time of primary analysis for progression-free survival, and the effect of the crossover design on overall survival at the time of interim analysis.\n\nMETHODS: In the phase III PAPILLON study, 308 participants were randomized (amivantamab-chemotherapy, n = 153; chemotherapy, n = 155). Intravenous amivantamab was administered every 3 weeks. Chemotherapy was administered as carboplatin for four cycles and pemetrexed until disease progression. TTD and TTST were evaluated using Kaplan-Meier and Cox proportional hazards models. Crossover-adjusted survival estimates were generated using three established statistical methods.\n\nRESULTS: At a median follow-up of 14.9 months, median TTD was 13.2 versus 7.5 months for amivantamab-chemotherapy versus chemotherapy (hazard ratio [HR] 0.38 [95% confidence interval 0.28-0.51]; nominal p < 0.0001). Median TTST was 17.7 versus 9.9 months (HR 0.35 [95% confidence interval 0.25-0.49]; nominal p < 0.0001). A total of 65/155 participants crossed over from chemotherapy to amivantamab after progression. The crossover-adjusted overall survival continued to demonstrate a favorable survival benefit for amivantamab-chemotherapy versus chemotherapy with HRs of 0.52-0.60, which is more pronounced than the planned interim intention-to-treat overall survival (HR of 0.67; 95% confidence interval 0.42-1.09).\n\nCONCLUSIONS: In PAPILLON, TTD and TTST were substantially longer for amivantamab-chemotherapy versus chemotherapy at primary analysis (cut-off on 3 May 2023). Crossover-adjusted analyses of the planned interim overall survival demonstrated a greater benefit for amivantamab-chemotherapy versus chemotherapy, further supporting amivantamab-chemotherapy as the first-line standard of care in EGFR exon 20 insertion-mutated non-small cell lung cancer.\n\nCLINICAL TRIAL REGISTRATION: ClinicalTrials.gov Identifier: NCT04538664."
    },
    {
      "pmid": "41198454",
      "doi": "10.1016/j.cllc.2025.10.007",
      "title": "Association Between Lung Volume Reduction and Symptomatic Radiation Pneumonitis in Lung Cancer Patients Undergoing Definitive Concurrent Chemoradiotherapy.",
      "journal": "Clinical lung cancer",
      "pubdate": "2025-11-05T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": "SJR",
      "metric_value": 1.515,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41198454/",
      "url_doi": "https://doi.org/10.1016/j.cllc.2025.10.007",
      "abstract": "PURPOSE: This study assessed lung volume alterations during radiotherapy (RT) and their predictive value for symptomatic radiation pneumonitis (RP) in lung cancer patients undergoing definitive concurrent chemoradiotherapy (CCRT) MATERIALS AND METHODS: This retrospective study included 49 patients who underwent re-simulation four-dimensional (4D) computed tomography (CT) during RT. Lung volume was measured on the 30% phase of 4D CT at initial and re-simulation scans. Associations between volume changes and symptomatic RP were analyzed using the Mann-Whitney U test. To determine the optimal cut-off value, ROC analysis and the Youden index were utilized. RP was graded based on CTCAE v5.0.\n\nRESULTS: Among the 49 patients, seven (14.3%) developed symptomatic RP. Dosimetric parameters did not differ significantly between patients with and without RP. However, changes in ipsilateral lung volume were significantly associated with symptomatic RP. A volume decrease >130 cm³ or a relative reduction <-7% was predictive of RP (P = .001). The area under the ROC curve for absolute change and relative change of ipsilateral lung volume were 0.905 and 0.883, respectively.\n\nCONCLUSION: Ipsilateral lung volume reduction during RT may serve as an early predictor of symptomatic RP, independent of traditional dosimetric factors. Monitoring volume changes with re-simulation CT could enhance RP risk assessment and guide adaptive RT planning."
    },
    {
      "pmid": "41197523",
      "doi": "10.4143/crt.2025.971",
      "title": "Real World Efficacy and Safety of First Line Chemo Immunotherapy in Extensive Stage Small Cell Lung Cancer and its association with molecular subtype.",
      "journal": "Cancer research and treatment",
      "pubdate": "2025-11-05T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "SCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://www.e-crt.org/upload/pdf/crt-2025-971.pdf",
      "metric_name": "SJR",
      "metric_value": 1.434,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41197523/",
      "url_doi": "https://doi.org/10.4143/crt.2025.971",
      "abstract": "PURPOSE: Small cell lung cancer (SCLC) is an aggressive malignancy with poor outcomes. IMpower133 and CASPIAN established platinum-etoposide plus anti-PD-L1 antibody as standard first-line therapy for extensive-stage SCLC (ES-SCLC). Real-world data in Korean patients are scarce. We evaluated the effectiveness and safety of first-line chemo-immunotherapy in ES-SCLC and compared outcomes with pivotal trials.\n\nMATERIALS AND METHODS: We retrospectively reviewed patients diagnosed with ES-SCLC between 2018 and 2021. Overall survival (OS), progression-free survival (PFS), and time to next treatment (TTNT) were analyzed using Kaplan-Meier methods. Multivariate Cox regression identified prognostic factors. Objective response rate (ORR) was assessed by RECIST v1.1, and histological subtypes evaluated.\n\nRESULTS: Among 177 patients, median age was 66 years (range, 42-91), with 63.8% aged ≥65; most were male (92.7%) and ECOG 0-1 (91.5%). Smoking history was present in 80.8%. Baseline brain and liver metastases occurred in 27.7% and 26%. Median follow-up was 27.2 months (range, 3.9-43.2). ORR was 74.5% (95% CI, 67.1-81.1). Median OS, PFS, and TTNT were 12.4 (95% CI, 11.6-14.9), 5.3 (95% CI, 5.1-5.87), and 5.6 months (95% CI, 1.43-38.27). In 49 patients with brain metastases, ORR was 63.2%, with no difference in efficacy. Local therapy for brain metastases improved OS (HR 0.42; p=0.012), while PFS was not different. Treatment-related adverse events occurred in 90%, primarily grade ≥2 cytopenias; the most common immune-related event was grade 1 rash.\n\nCONCLUSION: In this real-world Korean cohort, first-line chemo-immunotherapy achieved outcomes comparable to pivotal trials, supporting its role as standard care for ES-SCLC in clinical practice."
    },
    {
      "pmid": "40912643",
      "doi": "10.1016/j.avsg.2025.08.029",
      "title": "Temporal Patterns and Risk Factors for Pulmonary Embolism Associated with Antitumor Therapies in Patients with Lung Cancer.",
      "journal": "Annals of vascular surgery",
      "pubdate": "2025-12-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": "SJR",
      "metric_value": 0.707,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40912643/",
      "url_doi": "https://doi.org/10.1016/j.avsg.2025.08.029",
      "abstract": "BACKGROUND: This study aimed to characterize the association between pulmonary embolism (PE) onset time and various antitumor therapeutic approaches in patients with lung cancer, with the goal of identifying potential high-risk populations.\n\nMETHODS: A retrospective analysis was conducted on clinical records from 2019 to 2025, among the 84,000 inpatients with lung cancer, 106 patients developed PE during hospitalization for antitumor treatment, who were confirmed using spiral computed tomography or pulmonary angiography per Chinese Thoracic Society (2018) and The New England Journal of Medicine (2010) criteria. Data were collected on patient demographics, cancer staging, treatment type, and time to PE onset.\n\nRESULTS: Among patients who developed PE during lung cancer treatment, the mean age was 66.82 ± 10.50 years. Females comprised 64.04% of cases, adenocarcinoma was identified in 60.38%, and stage IV lung cancer was present in 56.60%. First-line therapy was administered in 63.21% of cases, and 66.04% exhibited enlarged mediastinal lymph nodes. The mean D-dimer level among this cohort was 3.559 μg/mL, indicating a heightened thrombotic risk. Temporally, 50.95% of PE cases occurred within 6 months of lung cancer diagnosis. Onset within 3 months following therapy initiation was observed across multiple modalities: 46.15% for chemotherapy, 34.78% for targeted therapy, and 77.78% following surgical intervention. Notably, 16.98% of PE events occurred during the initial chemotherapy cycle. The mean time to PE onset was 1.81 ± 2.51 months for patients undergoing surgery alone, compared to 15.52 ± 12.88 months for those receiving surgery combined with other treatments (P < 0.05). Surgical intervention was identified as an independent risk factor for PE. In early-stage lung cancer, the mean time to PE onset was significantly shorter, with a mean time of 16.38 ± 21.07 months (P < 0.05).\n\nCONCLUSION: The timing and incidence of PE vary according to the type of antitumor therapy administered in lung cancer treatment. These findings underscore the importance of vigilant monitoring, personalized risk assessment, and targeted anticoagulation strategies throughout the therapeutic course."
    },
    {
      "pmid": "41104928",
      "doi": "10.1056/NEJMoa2511065",
      "title": "Sevabertinib in Advanced HER2-Mutant Non-Small-Cell Lung Cancer.",
      "journal": "The New England journal of medicine",
      "pubdate": "2025-11-06T00:00:00+00:00",
      "pubtypes": [
        "Journal Article",
        "Multicenter Study"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41104928/",
      "url_doi": "https://doi.org/10.1056/NEJMoa2511065",
      "abstract": "METHODS: We conducted an open-label, multicenter, multicohort, phase 1-2 study to evaluate sevabertinib at a twice-daily dose of 20 mg in patients with locally advanced or metastatic\n\nRESULTS: A total of 209 patients received sevabertinib (as of June 27, 2025, the data-cutoff date); the median duration of follow-up was 13.8 months in cohort D, 11.7 months in cohort E, and 9.9 months in cohort F. Among 81 patients in cohort D, an objective response was observed in 64% (95% confidence interval [CI], 53 to 75); the median duration of response was 9.2 months (95% CI, 6.3 to 13.5), and the median progression-free survival was 8.3 months (95% CI, 6.9 to 12.3). Among 55 patients in cohort E, an objective response was observed in 38% (95% CI, 25 to 52); the median duration of response was 8.5 months, and the median progression-free survival was 5.5 months. Among 73 patients in cohort F, an objective response was observed in 71% (95% CI, 59 to 81), and the median duration of response was 11.0 months; data on progression-free survival were immature. Grade 3 or higher drug-related adverse events occurred in 31% of the patients. The most common adverse event was diarrhea (in 84 to 91%), with diarrhea of grade 3 or higher occurring in 5 to 23%. Treatment was discontinued by 3% of the patients owing to drug-related adverse events.\n\nCONCLUSIONS: Sevabertinib showed antitumor activity in patients with locally advanced or metastatic"
    },
    {
      "pmid": "41193800",
      "doi": "10.1038/s41586-025-09710-8",
      "title": "Targeting FSP1 triggers ferroptosis in lung cancer.",
      "journal": "Nature",
      "pubdate": "2025-11-05T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://www.nature.com/articles/s41586-025-09710-8.pdf",
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41193800/",
      "url_doi": "https://doi.org/10.1038/s41586-025-09710-8",
      "abstract": "Emerging evidence indicates that cancer cells are susceptible to ferroptosis, a form of cell death that is triggered by uncontrolled lipid peroxidation"
    },
    {
      "pmid": "41202699",
      "doi": "10.1016/j.lungcan.2025.108817",
      "title": "The immune desert tumor microenvironment in Thoracic SMARCA4-deficient undifferentiated tumors: spatial distribution characteristics and prognostic significance.",
      "journal": "Lung cancer (Amsterdam, Netherlands)",
      "pubdate": "2025-11-04T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41202699/",
      "url_doi": "https://doi.org/10.1016/j.lungcan.2025.108817",
      "abstract": "INTRODUCTION: Thoracic SMARCA4-Deficient Undifferentiated Tumors (SMARCA4-UT) are highly aggressive malignancies with poor prognosis. There is currently no standardized treatment strategy. We aimed to investigate the characteristics of the tumor immune microenvironment (TIME) in SMARCA4-UT, and evaluate the impact of TIME on treatment efficacy and prognosis.\n\nMETHODS: Multiplex immunofluorescence staining was performed on tumor tissue specimens from 29 SMARCA4-UT cases and 25 SMARCA4-intact non-small cell lung cancer (SMARCA4-iNSCLC) cases to quantify the density, proportion, and spatial proximity of CD8\n\nRESULTS: Lower infiltration of CD8\n\nCONCLUSION: The TIME of SMARCA4-UT is characterized by an immune-desert phenotype, and higher CD8"
    },
    {
      "pmid": "41202700",
      "doi": "10.1016/j.lungcan.2025.108815",
      "title": "Factors associated with lung cancer-specific mortality in lung cancer screening programs.",
      "journal": "Lung cancer (Amsterdam, Netherlands)",
      "pubdate": "2025-11-03T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41202700/",
      "url_doi": "https://doi.org/10.1016/j.lungcan.2025.108815",
      "abstract": "OBJECTIVES: Two major clinical trials have proven lung cancer screening (LCS) to be effective in reducing lung cancer-specific mortality. However, mortality reduction in the trials was only 20%. Our objective is to identify the causes contributing to lung cancer-specific death in our screening population.\n\nMETHODS: This retrospective study reviewed all patients who were enrolled in our healthcare system's lung cancer screening program between January 2015 and June 2023. Chart reviews were performed of all patients who died after lung cancer diagnosis to first determine whether the death was attributed to lung cancer. We then performed a chart review to identify contributing factors to death, including: advanced stage at initial diagnosis; non-compliance; missed nodules; aggressive cancers; recurrence; and treatment complications.\n\nRESULTS: During study period, 15,762 patients were screened, 694 were diagnosed with lung cancer, and 112 deaths were attributed directly to lung cancer. Potentially modifiable factors contributing to lung cancer-specific death accounted for the majority of causes (66/112; 59%), with advanced stage at initial diagnosis being the leading factor (28/112; 25%) followed by non-compliance (26/112; 23%) and missed nodules on CT (12/112; 11%). Non-modifiable contributing factors included development of an aggressive lung cancer (16/112; 14%), cancer recurrence after early stage (14/112; 13%), development of a second lung cancer (10/112; 9%), and treatment complications (6/112; 5%).\n\nCONCLUSION: Potentially modifiable factors contributed to the majority of lung cancer-related deaths in our screening program. Interventions to improve uptake of screening and follow-up may be able to improve the efficacy of lung cancer screening programs."
    },
    {
      "pmid": "41197381",
      "doi": "10.1016/j.lungcan.2025.108812",
      "title": "Systematic review and network meta-analysis: evaluation of systemic therapies for platinum refractory or resistant small cell lung cancer.",
      "journal": "Lung cancer (Amsterdam, Netherlands)",
      "pubdate": "2025-11-03T00:00:00+00:00",
      "pubtypes": [
        "Journal Article",
        "Review"
      ],
      "entity": "SCLC",
      "trial_type": "Review/Meta",
      "study_class": "Review",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41197381/",
      "url_doi": "https://doi.org/10.1016/j.lungcan.2025.108812",
      "abstract": "BACKGROUND: Platinum-refractory/resistant (r/r) small cell lung cancer (SCLC) is associated with poor prognosis and limited treatment options. While chemotherapy has been the standard, recent randomized controlled trials (RCTs) have investigated immunotherapy and targeted therapies. In 2025, the DeLLphi-304 trial showed tarlatamab significantly improved overall survival (OS) and progression-free survival (PFS) versus standard chemotherapy (SC). However, no network meta-analysis (NMA) has compared systemic therapies in this setting.\n\nMETHODS: We systematically searched major databases through June 2025 for phase III RCTs evaluating systemic therapies in platinum r/r SCLC. Extracted outcomes included OS, PFS, quality-of-life (QoL), overall response rate (ORR), and treatment-related adverse events (AEs). Indirect comparisons were performed using Markov Chain Monte Carlo methods, with treatment rankings assessed via SUCRA probabilities.\n\nRESULTS: Six phase III RCTs were identified. Tarlatamab and nivolumab improved OS over other treatments, with tarlatamab ranking highest (SUCRA 0.96) and demonstrating superior safety.\n\nCONCLUSIONS: Tarlatamab provides the most favorable outcomes, supporting its consideration as a preferred therapy for platinum r/r SCLC."
    },
    {
      "pmid": "41192095",
      "doi": "10.1016/j.lungcan.2025.108807",
      "title": "Recommendations for radiotherapy in patients with lung cancer and interstitial lung disease: A Delphi consensus process of the Italian association of radiotherapy and clinical oncology (AIRO).",
      "journal": "Lung cancer (Amsterdam, Netherlands)",
      "pubdate": "2025-11-03T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41192095/",
      "url_doi": "https://doi.org/10.1016/j.lungcan.2025.108807",
      "abstract": "AIM: Interstitial lung diseases (ILD) are a group of disorders affecting the lung parenchyma. ILD patients have a higher risk of lung cancer and worse prognosis, with increased susceptibility to radiotherapy (RT)-related toxicities due to ILD exacerbations. There are no clear guidelines for managing lung cancer patients with ILD undergoing RT, alone or with systemic therapies. This work aims to establish a consensus on ILD assessment, patient selection, risk/benefit analysis, and clinical management for those eligible for thoracic RT.\n\nMETHODS: Using the Estimate-Talk-Estimate method, a board of experts (4 radiation oncologists, 2 pneumologists, 1 radiologist, 1 medical oncologist) identified key items. Each expert drafted statements for these items, and an extended panel of 24 experts (12 radiation oncologists, 6 pneumologists, 3 radiologists, 3 medical oncologists) rated the statements on a 9-point scale. Consensus was defined as a median score ≥ 7.\n\nRESULTS: Sixteen statements from 10 items reached consensus. The consensus points reached concern the clinical, radiological and functional assesment of patients with ILD, the role of the multidisciplinary team, the accurate evaluation of toxicity predictors, the prevention of complications and the risk/benefit ratio in different clinical scenarios in which radiotherapy is administered alone or in combination with antineoplastic drugs. Conclusion This multidisciplinary consensus on thoracic RT for lung cancer patients with ILD provides valuable guidance for clinicians managing this complex scenario."
    },
    {
      "pmid": "41192094",
      "doi": "10.1016/j.lungcan.2025.108816",
      "title": "Clinical characteristics and outcomes in participants with screen-detected clinical stage I lung cancer in the Yorkshire lung screening trial: A comparison of surgery versus stereotactic ablative radiotherapy.",
      "journal": "Lung cancer (Amsterdam, Netherlands)",
      "pubdate": "2025-11-03T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://www.lungcancerjournal.info/article/S0169-5002(25)00708-1/pdf",
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41192094/",
      "url_doi": "https://doi.org/10.1016/j.lungcan.2025.108816",
      "abstract": "BACKGROUND: Lung cancer screening with low-dose computed tomography (LDCT) saves lives by detecting early-stage curable cancer and estimates of overdiagnosis in the previous randomised studies were generally low. Screening selection criteria vary, with some programmes only recommending screening for people who are surgical candidates, whereas others make no reference to fitness for surgery. Here we report clinical characteristics and outcomes for participants in the Yorkshire Lung Screening Trial with screen-detected clinical stage I lung cancer according to treatment modality.\n\nMETHODS: Consecutive participants with screen-detected clinical stage I lung cancer were stratified according to curative treatment modality into surgical and SABR cohorts. Factors associated with overall survival and cancer-specific survival were assessed with a median follow-up of 3.6 years.\n\nRESULTS: Of 190 patients with stage I lung cancer studied, 31 % (n = 58) received SABR and 69 % (n = 132) surgery (55 lobectomy, 77 sub-lobar resection). Patients treated with SABR were older with worse performance status and fitness parameters. Cancer-specific survival was similar between the SABR and surgery cohorts (HR for death 1.19, 95 % CI 0.45-3.14, p = 0.72) but overall survival was worse following SABR compared to surgery (HR for death 2.61 95 % CI 1.45-4.69, p = 0.001), indicating that the worse overall survival was due to non-cancer deaths. In the SABR cohort 17 patients (29.3 %) died from non-cancer causes during the study follow-up period compared with 9 (6.8 %) in the surgery cohort. Three-year survival was 69.4 % in the SABR cohort and 92.4 % in the surgical cohort (p < 0.001).\n\nCONCLUSIONS: Cancer-specific survival was similar between the two groups, but overall survival following SABR for screen-detected stage I lung cancer is worse than surgery due to higher rates of non-cancer death within 5 years of treatment. Lung cancer sojourn time has been estimated at around 5 years, so it is likely that rates of overdiagnosis are higher in patients treated with SABR compared to surgery. Further research may be needed to optimise inclusion and exclusion criteria for lung cancer screening."
    }
  ]
}