{
  "generated": "2025-12-27T05:20:18.130956Z",
  "items": [
    {
      "pmid": "41452617",
      "doi": "10.1001/jamaoncol.2025.5672",
      "title": "Enhancement of Patient-Centered Lung Cancer Screening: The MyLungHealth Randomized Clinical Trial.",
      "journal": "JAMA oncology",
      "pubdate": "2025-12-26T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": "SJR",
      "metric_value": 8.377,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41452617/",
      "url_doi": "https://doi.org/10.1001/jamaoncol.2025.5672",
      "abstract": "IMPORTANCE: Lung cancer screening (LCS) with low-dose computed tomography (CT) remains underused in the US, partly because of incomplete smoking history documentation in electronic health records (EHRs) and limited time for shared decision-making in primary care.\n\nOBJECTIVE: To determine whether a patient-facing, EHR-integrated tool combined with clinician-facing clinical decision support improves the identification of LCS-eligible patients and the ordering of low-dose CT compared with clinician-facing tools alone.\n\nDESIGN, SETTING, AND PARTICIPANTS: This pragmatic, unstratified, randomized clinical trial with parallel groups was conducted from March 29, 2024, to March 28, 2025, at primary care clinics at University of Utah Health and New York University Langone Health. Adults aged 50 to 79 years with a documented smoking history, an active patient portal account, and a primary care visit in the preceding year were included. Study 1 enrolled patients with uncertain LCS eligibility (10 to 19 pack-years, unknown pack-years, or missing quit date); study 2 enrolled patients with documented eligibility (20 or more pack-years and currently smoking or quit smoking within 15 years).\n\nINTERVENTIONS: The control included the clinician-facing Decision Precision+ tool (preventive care reminders and a shared decision-making tool). The intervention included the Decision Precision+ tool as well as the MyLungHealth tool, which collected detailed smoking history (study 1) and delivered personalized education and risk/benefit information (studies 1 and 2) via the patient portal in English and Spanish.\n\nMAIN OUTCOMES AND MEASURES: The primary outcomes were the proportion of patients newly identified as eligible for LCS (study 1) and low-dose CT ordering rates (study 2) over 12 months. Analyses used intention-to-treat mixed-effects logistic regression.\n\nRESULTS: There were 31 303 randomized participants, including 26 729 in study 1 (13 144 [49.2%] female; 13 580 [50.8%] male; median [IQR] age, 62 [55-69] years) and 4574 in study 2 (2230 [48.8%] female; 2344 [51.2%] male; median [IQR] age, 63 [56-69] years). In study 1, the MyLungHealth tool increased new LCS eligibility identification (635 of 13 412 [4.7%] vs 308 of 13 317 [2.3%]; adjusted odds ratio, 2.19; 95% CI, 1.99-2.42; P < .001). In study 2, low-dose CT ordering was higher in the intervention arm (474 of 2312 [20.5%] vs 434 of 2262 [19.2%]; adjusted odds ratio, 1.16; 95% CI, 1.04-1.30; P = .008).\n\nCONCLUSIONS AND RELEVANCE: In this randomized clinical trial, integrating a patient-centered tool into primary care EHR workflows increased the identification of patients eligible for LCS and the ordering of low-dose CTs. The relative increases in these primary outcomes were substantial, but absolute increases were more modest. Research on more intensive interventions is warranted to evaluate their ability to further improve LCS screening.\n\nTRIAL REGISTRATION: ClinicalTrials.gov Identifier: NCT06338592."
    },
    {
      "pmid": "41423267",
      "doi": "10.1136/jitc-2025-012205",
      "title": "Multi-omics analysis reveals differential benefits of immunotherapy±chemotherapy based on detailed smoking history in advanced non-small cell lung cancer.",
      "journal": "Journal for immunotherapy of cancer",
      "pubdate": "2025-12-21T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://doi.org/10.1136/jitc-2025-012205",
      "metric_name": "SJR",
      "metric_value": 4.22,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41423267/",
      "url_doi": "https://doi.org/10.1136/jitc-2025-012205",
      "abstract": "BACKGROUND: Despite immunotherapy±chemotherapy has transformed the therapeutic landscape for patients with non-small cell lung cancer (NSCLC), critical questions remain regarding how detailed smoking history affects the evolving treatment options and the underlying molecular mechanisms driving these effects.\n\nMETHODS: We analyzed 4157 patients with advanced NSCLC who were treated with immunotherapy monotherapy (IO alone) (n=2768) or chemoimmunotherapy (chemo-IO) (n=1389) at the Dana-Farber Cancer Institute and Memorial Sloan Kettering Cancer Center (2010-2023). Associations between detailed smoking history (status and cumulative pack-years) and clinical outcomes were assessed using multivariable analyses. First-line chemo-IO versus IO alone was compared in programmed death receptor ligand 1 (PD-L1) Tumor Proportion Score (TPS) of ≥50%\n\nRESULTS: In patients receiving IO alone, both smoking status and intensity showed dose-dependent associations with improved response and survival outcomes. In contrast, among patients receiving chemo-IO, smoking history did not affect initial response but patients with active (HR=0.73, 95% CI 0.57 to 0.94, p=0.01) and heavy tobacco use (HR=0.76, 95% CI 0.62 to 0.93, p=0.001) showed improved progression-free survival (PFS), and a trend toward improved overall survival (OS). Importantly, these associations remained independent of\n\nCONCLUSIONS: Detailed smoking history provides crucial insights for optimizing IO selection in advanced NSCLC through mechanistic alterations in both the tumor microenvironment and systemic plasma protein profiles."
    },
    {
      "pmid": "41442233",
      "doi": "10.1002/cncr.70217",
      "title": "Patterns of lung cancer incidence in adults diagnosed under age 50 in the United States, 2000-2021.",
      "journal": "Cancer",
      "pubdate": "2026-01-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": "SJR",
      "metric_value": 2.947,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41442233/",
      "url_doi": "https://doi.org/10.1002/cncr.70217",
      "abstract": "BACKGROUND: Although the incidence of several cancers diagnosed before age 50 years has increased, contemporary trends in early-onset lung cancer remain poorly defined, particularly across histologic and sociodemographic subgroups.\n\nMETHODS: A population-based cohort study was conducted via Surveillance, Epidemiology, and End Results 22 Program registries of 81,568 individuals diagnosed with lung cancer at age 20-49 years from 2000 to 2021. Age-adjusted incidence rates and annual percent change (APC) were estimated via National Cancer Institute Joinpoint regression. Overall trends were stratified by histology, sex, race/ethnicity, and state-level smoking prevalence.\n\nRESULTS: From 2000 to 2021, early-onset lung cancer incidence declined overall (average APC, -3.81%; 95% CI, -4.01% to -3.64%; p < .0001), which contrasts with rising early-onset colorectal and female breast cancers. Declines among females occurred later but were steeper for lung adenocarcinoma (LUAD; -5.14% vs. -2.82%), whereas males declined faster for non-small cell lung cancer (NSCLC) and overall. Female declines were slower relative to males in Hispanic and non-Hispanic (NH) Black individuals (2.3- and 1.08-fold difference, respectively), whereas NH White females declined 1.3-fold faster than males. Among Asian females, NSCLC incidence did not decline, and LUAD increased through 2017 (+2.45%) and remained stable in Hispanic females. In high-smoking states, male rates declined steadily (-4.32%), whereas female rates were stable until 2010, then dropped sharply, and converged with males by 2021. In low-smoking states, male rates declined 48.75% faster than female rates (-4.76% vs. -3.20%).\n\nCONCLUSIONS: Early-onset lung cancer incidence declined overall from 2000 to 2021, except for persistent or rising LUAD among Asian and Hispanic females, which implicates emerging non-tobacco risk factors and highlights the need for targeted prevention."
    },
    {
      "pmid": "41427516",
      "doi": "10.1002/cpt.70146",
      "title": "Risk of Malignancies and Major Adverse Cardiovascular Events Related to JAK Inhibitors in Rheumatoid Arthritis: A Meta-Analysis.",
      "journal": "Clinical pharmacology and therapeutics",
      "pubdate": "2025-12-22T00:00:00+00:00",
      "pubtypes": [
        "Journal Article",
        "Review"
      ],
      "entity": "Other",
      "trial_type": "Review/Meta",
      "study_class": "Review",
      "is_oa": false,
      "oa_url": null,
      "metric_name": "SJR",
      "metric_value": 2.127,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41427516/",
      "url_doi": "https://doi.org/10.1002/cpt.70146",
      "abstract": "This meta-analysis evaluated the risk of malignancies and major adverse cardiovascular events (MACE) associated with the use of JAK inhibitors in patients with RA through a comprehensive meta-analysis of available clinical trials. A systematic search was conducted in PubMed, EMBASE, and Web of Science from inception to February 7, 2025, to identify relevant clinical trials. Data on malignancies and MACE incidence were extracted, and pooled risk ratios (RR) were calculated using a random-effects model. A total of 18 studies (N = 111,260) met the inclusion criteria. JAK inhibitors were associated with a significantly increased risk of malignancies excluding NMSC (RR = 1.30, 95%CI: 1.05, 1.60; P = 0.016), NMSC (RR = 1.54, 95%CI: 1.23, 1.93; P < 0.01), overall malignancies (RR = 1.53, 95%CI: 1.18, 2.00; P = 0.002), lung cancer (RR = 1.52, 95%CI: 1.11, 2.08; P = 0.009), lymphoma (RR = 3.69, 95%CI: 1.19, 11.42; P = 0.024), non-small cell lung cancer (RR = 1.70, 95%CI: 1.01, 2.86; P = 0.047), cutaneous squamous cell carcinoma (RR = 2.30, 95%CI: 1.44, 3.65; P < 0.01), and thyroid cancer (RR = 7.51, 95%CI: 1.39, 40.74; P = 0.019). In contrast, JAK inhibitors did not significantly alter the risk of MACE (RR = 0.75, 95%CI: 0.38, 1.45; P = 0.390), venous thromboembolism (VTE) (RR = 1.52, 95%CI: 0.90, 2.56; P = 0.117), or deep vein thrombosis (DVT) (RR = 1.77, 95%CI: 0.84, 3.34; P = 0.079). Trial sequential analysis (TSA) confirmed data adequacy, and meta-regression indicated that sample size, treatment duration, and patient age did not influence outcomes. JAK inhibitors are associated with an elevated risk of malignancies but do not significantly affect MACE, VTE, or DVT risk in RA patients. Further large-scale post-marketing surveillance is warranted to refine the safety profile of JAK inhibitors in RA management."
    },
    {
      "pmid": "41439364",
      "doi": "10.1002/jbt.70657",
      "title": "Comparative Toxicovigilance of Capmatinib and Tepotinib in NSCLC: Respiratory Signal Detection and Adverse Event Profiling via FAERS.",
      "journal": "Journal of biochemical and molecular toxicology",
      "pubdate": "2026-01-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Preclinical",
      "is_oa": false,
      "oa_url": null,
      "metric_name": "SJR",
      "metric_value": 0.772,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41439364/",
      "url_doi": "https://doi.org/10.1002/jbt.70657",
      "abstract": "Capmatinib and tepotinib are selective MET inhibitors for MET exon 14 skipping non-small cell lung cancer (NSCLC), yet comprehensive real-world safety profiles, particularly concerning respiratory and rare adverse events (AEs), remain limited. We conducted a disproportionality analysis of the FDA AE Reporting System (FAERS) database, utilizing four algorithms (ROR, PRR, BCPNN, MGPS) to identify AE signals from 1771 cases for capmatinib and 470 for tepotinib, standardized with MedDRA v26.0. Both inhibitors shared signals for systemic AEs, such as peripheral oedema and gastrointestinal disorders. However, their respiratory AE profiles diverged: capmatinib was associated with pleural effusion and pulmonary oedema, whereas tepotinib was linked to infectious complications, including interstitial lung disease and infectious pleural effusion. Importantly, we identified significant novel signals beyond current drug labels: sensory disturbances, and thrombosis for capmatinib; and fluid imbalance-related events for tepotinib. These distinct AE profiles highlight an infection-driven pulmonary risk for tepotinib requiring close monitoring, while capmatinib's association with sensory disorders warrants specific patient management considerations. Our findings underscore the need for individualized safety monitoring based on the unique AE profiles of each MET inhibitor."
    },
    {
      "pmid": "41192526",
      "doi": "10.1016/j.cellsig.2025.112211",
      "title": "RIPK2/STAT3 signaling axis drives lung cancer metastasis through SNAIL activation: Molecular mechanisms and clinical implications.",
      "journal": "Cellular signalling",
      "pubdate": "2026-02-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41192526/",
      "url_doi": "https://doi.org/10.1016/j.cellsig.2025.112211",
      "abstract": "BACKGROUND: Lung adenocarcinoma is the most common histological subtype of lung cancer with high metastatic propensity. Epithelial-mesenchymal transition (EMT) plays a crucial role in tumor metastasis, but the molecular mechanisms remain incompletely elucidated. This study investigates the role of RIPK2 in EMT and metastasis of lung adenocarcinoma.\n\nMETHODS: TCGA database analysis determined RIPK2 expression and clinical significance. RNA interference, overexpression, qRT-PCR, Western blot, co-immunoprecipitation, and immunofluorescence were employed in A549 and PC-9 cell lines. Transwell, EdU, colony formation assays, and cytoskeletal staining assessed cell invasion, proliferation, and EMT changes. Nuclear localization signal (NLS) and nuclear export signal (NES) fusion proteins investigated subcellular localization effects. Tail vein injection in nude mice validated in vivo effects.\n\nRESULTS: RIPK2 was highly expressed in lung adenocarcinoma tissues and associated with poor prognosis. RIPK2 knockdown inhibited while overexpression promoted EMT, invasion, and metastasis. Co-immunoprecipitation and immunofluorescence confirmed direct RIPK2-STAT3 interaction. RIPK2 specifically upregulated EMT transcription factor SNAIL expression. Co-expression of RIPK2 and SNAIL correlated with shorter patient survival. STAT3 or SNAIL knockdown inhibited RIPK2-induced EMT and metastasis. Nuclear-localized RIPK2 completely restored cellular EMT, invasion, and metastatic capabilities while enhancing cisplatin resistance.\n\nCONCLUSION: RIPK2 translocates to the nucleus, interacts with STAT3, and synergistically upregulates SNAIL expression, promoting EMT, invasion, metastasis, and chemotherapy resistance in lung adenocarcinoma. The RIPK2-STAT3-SNAIL signaling axis represents a potential therapeutic target."
    },
    {
      "pmid": "41325571",
      "doi": "10.1200/JCO-24-02835",
      "title": "Amivantamab Plus Lazertinib in Atypical EGFR-Mutated Advanced Non-Small Cell Lung Cancer: Results From CHRYSALIS-2.",
      "journal": "Journal of clinical oncology : official journal of the American Society of Clinical Oncology",
      "pubdate": "2026-01-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article",
        "Multicenter Study"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://doi.org/10.1200/jco-24-02835",
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41325571/",
      "url_doi": "https://doi.org/10.1200/JCO-24-02835",
      "abstract": "PURPOSE: For patients with advanced non-small cell lung cancer (NSCLC) harboring atypical epidermal growth factor receptor (\n\nPATIENTS AND METHODS: CHRYSALIS-2 Cohort C enrolled participants with NSCLC harboring atypical\n\nRESULTS: As of January 12, 2024, 105 participants received amivantamab-lazertinib. Most common atypical mutations were G719X (56%), L861X (26%), and S768I (23%), including single and compound mutations. In the overall population (median follow-up: 16.1 months), the ORR was 52% (95% CI, 42 to 62). The median duration of response (mDoR) was 14.1 months (95% CI, 9.5 to 26.2). The median progression-free survival (mPFS) was 11.1 months (95% CI, 7.8 to 17.8); median overall survival (mOS) was not estimable (NE; 95% CI, 22.8 to NE). Adverse events were consistent with previous studies and primarily grade 1 and 2. Among treatment-naïve participants, the ORR was 57% (95% CI, 42 to 71). The mPFS was 19.5 months (95% CI, 11.2 to NE), the mDoR was 20.7 months (95% CI, 9.9 to NE), and mOS was NE (95% CI, 26.3 to NE). Solitary or compound\n\nCONCLUSION: In participants with atypical"
    },
    {
      "pmid": "41365311",
      "doi": "10.1016/S1470-2045(25)00594-7",
      "title": "Vebreltinib in MET amplification-driven advanced non-small-cell lung cancer (KUNPENG): a single-arm, multi-cohort, multicentre, phase 2 study.",
      "journal": "The Lancet. Oncology",
      "pubdate": "2026-01-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article",
        "Multicenter Study"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41365311/",
      "url_doi": "https://doi.org/10.1016/S1470-2045(25)00594-7",
      "abstract": "BACKGROUND: MET amplification is recognised as a de novo driver alteration in non-small-cell lung cancer (NSCLC) but treatment responses with existing MET inhibitors remain largely unsatisfactory. We aimed to investigate the antitumour activity and safety of vebreltinib, a potent and highly selective MET inhibitor, in patients with MET amplification-driven NSCLC.\n\nMETHODS: KUNPENG was a multicentre, multi-cohort, single-arm, phase 2 trial conducted across 17 hospitals in China, in patients with locally advanced or metastatic NSCLC with MET dysregulation. Patients were eligible if they were MET inhibitor-naive, aged 18 years or older with MET amplification-driven NSCLC (gene copy number of six or higher), and progressed after previous standard chemotherapy or were ineligible for chemotherapy (cohort 2) or refused chemotherapy (cohort 3). Patients received 200 mg vebreltinib orally twice daily until disease progression or intolerable toxicity. The primary endpoint was the objective response rate, assessed by a masked independent review committee in the full analysis set. The study was amended to merge cohorts 2 and 3 due to slow accrual and was closed to enrolment on Nov 14, 2023. This trial is registered with ClinicalTrials.gov (NCT04258033).\n\nFINDINGS: Between Jan 17, 2020, and Nov 14, 2023, 145 patients were enrolled; of these, 86 patients (30 chemotherapy-treated and 56 untreated) from cohorts 2 and 3 were included in the current analysis. The median age was 65 years (range 48-82; IQR 59-71), 77 (90%) patients were male, and nine (10%) were female. All patients were Chinese. 42 patients had partial response, resulting in an objective response rate of 48·8% (42 of 86; 95% CI 38·3-59·4) per masked independent review committee. The median follow-up was 18·6 months (IQR 15·7-37·3). The incidence of grade 3 or worse treatment-related adverse events was 31% (27 of 86), predominantly abnormal liver function terms reported by the investigators (eight [9%]). Serious adverse events related to treatment were reported by 16 (19%) patients. 11 treatment-emergent adverse events leading to death occurred, of which one patient died of abnormal liver function, which was possibly related to vebreltinib treatment.\n\nINTERPRETATION: Vebreltinib showed antitumour activity in patients with MET amplification-driven advanced NSCLC who had previously received chemotherapy or were chemotherapy-naive. Further research is needed to validate these findings.\n\nFUNDING: Beijing Pearl Biotechnology and Avistone Biotechnology."
    },
    {
      "pmid": "41219394",
      "doi": "10.1038/s41571-025-01085-z",
      "title": "Navigating the landscape of EGFR TKI resistance in EGFR-mutant NSCLC - mechanisms and evolving treatment approaches.",
      "journal": "Nature reviews. Clinical oncology",
      "pubdate": "2026-01-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article",
        "Review"
      ],
      "entity": "NSCLC",
      "trial_type": "Review/Meta",
      "study_class": "Review",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41219394/",
      "url_doi": "https://doi.org/10.1038/s41571-025-01085-z",
      "abstract": "Resistance to EGFR tyrosine kinase inhibitors (TKIs) remains a major obstacle in the clinical management of EGFR-mutant non-small-cell lung cancer (NSCLC). Despite the transformative therapeutic activity of the multiple iterations of EGFR TKIs, spanning from first-generation reversible inhibitors such as erlotinib and gefitinib to the current standard-of-care third-generation covalent inhibitor osimertinib, primary or acquired resistance to these agents inevitably emerges via diverse mechanisms. The advent of combination therapies that incorporate chemotherapy, anti-angiogenic agents, bispecific antibodies or antibody-drug conjugates has increased clinical benefit but introduced new resistance phenotypes, underscoring the dynamic plasticity and complexity of tumour evolution under therapeutic pressure. In this Review, we provide a comprehensive synthesis of the molecular mechanisms that underlie resistance to third-generation EGFR TKIs, describe biomarker-guided and biomarker-unselected therapeutic strategies to overcome these mechanisms, and discuss emerging approaches to pre-empt resistance through early application of combination therapies. We highlight the paradigm shift from radiological to molecular monitoring of resistance to therapy and explore how advances in circulating tumour DNA analysis, artificial intelligence and multi-omics might facilitate adaptive treatment strategies. As the therapeutic landscape evolves, a more complete mechanistic understanding of resistance will be essential to guide rational treatment sequencing, inform trial design and improve long-term outcomes for patients with EGFR-mutant NSCLC."
    },
    {
      "pmid": "41176132",
      "doi": "10.1016/j.taap.2025.117625",
      "title": "An intestinal matrix-based human lung cancer model reflects clinical data from gefitinib on dosage-dependent efficacy.",
      "journal": "Toxicology and applied pharmacology",
      "pubdate": "2026-01-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://doi.org/10.1016/j.taap.2025.117625",
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41176132/",
      "url_doi": "https://doi.org/10.1016/j.taap.2025.117625",
      "abstract": "Lung cancer is the leading cause for cancer related death worldwide. One treatment option for patients with pulmonary adenocarcinoma is the targeted therapy gefitinib (Iressa®, ZD1839). As with other promising targeted therapies, desired in vivo effects of gefitinib came short to in vitro expectations, as preclinical testing is hampered by an inaccuracy of existing models and resistances develop frequently. We analysed the pharmacodynamics of gefitinib in a 3D tissue engineered human lung cancer model of HCC827 cells, as well as a resistant subpopulation of HCCres A2 cells. In 2D cell culture, a cell viability of 50 % was reached after treatment with 0.01-0.05 μM gefitinib. In the 3D model administering higher doses of gefitinib did not lead to a further reduction in viability and proliferation, or an increase in apoptosis. This shows that the pharmacodynamic effect of promising new therapies can often be overestimated in 2D versus 3D models. The results we obtained for gefitinib testing in the 3D models reflect astonishing well the efficacy of priorly published clinical data, suggesting that our 3D tumor models can display in vivo conditions more accurately, bridging the gap to living organisms. To mimic the clinical setting further, the lung cancer cells were cultivated under dynamic conditions in a bioreactor. The exploration of a resistant subpopulation confirmed an epithelial-mesenchymal transition. The described 3D lung cancer model can be used as a refined, preclinical testing platform for targeted therapies and with clinically relevant pharmacodynamic properties as shown exemplary for gefitinib."
    },
    {
      "pmid": "41068447",
      "doi": "10.1038/s41571-025-01080-4",
      "title": "Unresectable stage III non-small-cell lung cancer: state of the art and challenges.",
      "journal": "Nature reviews. Clinical oncology",
      "pubdate": "2026-01-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article",
        "Review"
      ],
      "entity": "Thoracic-other",
      "trial_type": "Review/Meta",
      "study_class": "Review",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41068447/",
      "url_doi": "https://doi.org/10.1038/s41571-025-01080-4",
      "abstract": "Despite advances in immunotherapy, unresectable stage III non-small-cell lung cancer (NSCLC) remains a highly challenging disease, with only around one-third of patients remaining disease-free at 5 years. The PACIFIC trial established consolidation with the anti-PD-L1 antibody durvalumab after concurrent chemoradiotherapy as the standard-of-care approach. Furthermore, the LAURA trial has redefined the treatment of patients with stage III unresectable EGFR-mutant NSCLC, demonstrating unprecedented progression-free survival durations with osimertinib consolidation. Despite these advances, novel approaches are urgently needed. Circulating tumour DNA-based monitoring of minimal residual disease is emerging as a personalized method of tailoring treatment duration and escalation strategies. Novel radiotherapy techniques have the potential to provide synergy with immunotherapy while minimizing toxicities. Additionally, ongoing trials evaluating chemoimmunotherapy combinations adapted from the neoadjuvant setting with the potential for conversion to resectable disease might, in the near future, redefine the boundary of surgical resectability. In this Review, we describe the rapidly evolving field of unresectable stage III NSCLC, providing a state-of-the-art overview that includes challenging topics such as biomarkers, personalization of therapy and the role of immunotherapy rechallenge."
    },
    {
      "pmid": "41205892",
      "doi": "10.1016/j.envpol.2025.127348",
      "title": "Association of radon exposure with lung cancer: serum biomarkers and computed tomography evidence from male miners.",
      "journal": "Environmental pollution (Barking, Essex : 1987)",
      "pubdate": "2026-01-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://doi.org/10.1016/j.envpol.2025.127348",
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41205892/",
      "url_doi": "https://doi.org/10.1016/j.envpol.2025.127348",
      "abstract": "The objective of this research is to investigate the association between occupational radon exposure and pulmonary health outcomes in male miners from Chongqing, China. Between June 2022 and December 2023, 110 miners were enrolled in this cross-sectional study. Personal radon exposure levels were measured using passive cumulative dosimeters, with pulmonary health assessed through radiologist-interpreted low-dose computed tomography (CT) scans and serum biomarker analysis (CEA, CYFRA21-1, NSE, and CA125) via ELISA. Multivariable analyses revealed strong dose-response relationships between radon exposure and both serum biomarkers and CT abnormalities. high radon exposure predicted substantial biomarker elevations including a 2.45-fold increase in CYFRA21-1 (β = 0.39, 95 % CI 0.25-0.54, p < 0.001), 1.60-fold increase in CEA (β = 0.20, 0.05-0.35, p = 0.008), and 3.58-fold increased CT abnormality risk (OR = 3.58, p = 0.023). Mediation analysis identified CYFRA21-1 as accounting for 69 % (p = 0.024) and CEA for 24.7 % (p = 0.036) of radon's effect on CT abnormalities. These findings demonstrate that occupational radon exposure contributes to pulmonary damage through both direct effects and biomarker-mediated pathways, with CYFRA21-1 and CEA emerging as potential early indicators of lung cancer in radon-exposed populations."
    },
    {
      "pmid": "41125209",
      "doi": "10.1016/j.annonc.2025.09.140",
      "title": "The evolving landscape of leptomeningeal metastases from NSCLC: an international, contemporary, multicenter cohort study.",
      "journal": "Annals of oncology : official journal of the European Society for Medical Oncology",
      "pubdate": "2026-01-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article",
        "Multicenter Study"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://www.annalsofoncology.org/article/S0923-7534(25)04931-2/pdf",
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41125209/",
      "url_doi": "https://doi.org/10.1016/j.annonc.2025.09.140",
      "abstract": "BACKGROUND: Leptomeningeal metastatic disease (LMD) represents a devastating complication of non-small-cell lung cancer (NSCLC) with a poor prognosis. Our understanding of LMD is limited in the era of molecular testing and emerging therapeutic options for lung cancer.\n\nPATIENTS AND METHODS: We conducted an international, multicenter, retrospective study involving eight institutions across Asia, United States, and Europe. Patients diagnosed with LMD from advanced NSCLC were identified (2007-2024). Clinicopathological characteristics, treatment patterns, and outcomes were analyzed. The primary endpoint was overall survival from the LMD diagnosis (LMOS).\n\nRESULTS: A total of 2052 patients with NSCLC and LMD were included and analyzed by molecular subtypes: epidermal growth factor receptor (EGFR) (n = 1610), ALK (n = 141), other actionable genomic alterations (other AGA; n = 137), and non-AGA (n = 164). The cumulative prevalence of LMD by molecular subgroups was EGFR, 11.1%; ALK, 11.2%; ROS1, 16%; ERBB2, 12.3%, non-AGA, 3.6%. A higher proportion of LMD was diagnosed >3 years after initial metastatic diagnosis. By the European Association of Neuro-Oncology (EANO)-European Society for Medical Oncology (ESMO) diagnostic criteria, type I (cerebrospinal fluid cytology positive) had significantly shorter LMOS than type II (magnetic resonance imaging and/or symptom positive). Median LMOS was 10.9 months [95% confidence interval (CI) 10.0-11.8 months] in all patients. Compared with historical cohorts, patients demonstrated improved LMOS in contemporary cohorts (7.3 versus 11.5 months, P < 0.0001), across all molecular subtypes. In AGA NSCLC, tyrosine kinase inhibitors (TKIs) were associated with improved LMOS [hazard ratio (HR) 0.39, 95% CI 0.31-0.48, P < 0.0001]. Immune checkpoint inhibitors (ICIs) conferred survival benefit in non-AGA patients (HR 0.45, 95% CI 0.25-0.84, P = 0.012). For the EGFR-mutated cohort, central nervous system (CNS)-penetrant TKI usage delayed LMD onset (P < 0.0001). Continued CNS-penetrant TKIs after LMD diagnosis were associated with longer LMOS (12.4 versus 6.0 months, P < 0.0001).\n\nCONCLUSIONS: The prevalence of LMD is rising, largely due to prolonged survival in advanced NSCLC. Contemporary systemic treatments, including TKIs and ICIs, were the main contributors to delayed LMD onset and improved LMD survival."
    },
    {
      "pmid": "41442468",
      "doi": "10.1093/oncolo/oyaf428",
      "title": "Adjuvant atezolizumab in surgically resected NSCLC patients with PD-L1 expression ≥50%: real-world data from the italian ATLAS registry.",
      "journal": "The oncologist",
      "pubdate": "2025-12-24T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://doi.org/10.1093/oncolo/oyaf428",
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41442468/",
      "url_doi": "https://doi.org/10.1093/oncolo/oyaf428",
      "abstract": "BACKGROUND: This study describes clinical characteristics, treatment patterns as well as safety outcomes of NSCLC patients harboring PD-L1 ≥ 50% who received adjuvant atezolizumab within the Italian real-world scenario.\n\nMETHODS: Patients with surgically resected NSCLC harboring EGFR/ALK wild type disease and PD-L1 TPS ≥ 50%, who received at least one cycle of adjuvant atezolizumab were included. Clinical-pathological and molecular data, safety and efficacy outcomes were collected from the Italian ATLAS real-world registry.\n\nRESULTS: A total of 132 patients were included across 45 Italian centers between July 2022 and August 2024. Lobectomy was performed in 81.1% of cases, with 8.3% pathological stage IIA, 40.2% stage IIB, 43.9% stage IIIA, and 7.6% stage IIIB, according to the 8th TNM staging edition. The median number of atezolizumab cycles was 12.5 (range: 1-20). Treatment related adverse events (TRAEs) during atezolizumab were reported in 44 patients (33.3%), including 11 (8.3%) who experienced multiple TRAEs. Grade ≥3 TRAEs were reported in 21 cases (15.9%), leading to treatment discontinuation in 18 (13.6%). The median time to the first onset of TRAEs was 89 days (range: 3-390 days). 15 patients experienced a disease recurrence, including 6 locoregional-only and 9 distant relapses, with a median time since surgery of 13.3 months.\n\nCONCLUSION: This study showed that the safety profile of adjuvant atezolizumab outside of a clinical trial context was comparable to the IMPower-010 study, highlighting the value of the Italian ATLAS registry as source of real-word evidence to optimize the clinical management of NSCLC patients."
    },
    {
      "pmid": "41378732",
      "doi": "10.1021/acs.nanolett.5c04269",
      "title": "PBAE-PEG/Lipid Nanoparticle Delivery of RNA for the Creation of Genetically Engineered Lung Cancer Mouse Models.",
      "journal": "Nano letters",
      "pubdate": "2025-12-24T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Preclinical",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41378732/",
      "url_doi": "https://doi.org/10.1021/acs.nanolett.5c04269",
      "abstract": "We have recently developed polymer/lipid nanoparticles PBAE-PEG/4A3-SC8/DOPE/Cholesterol/DOTAP (hereafter, PBAE-PEG/LNP) that can deliver mRNA into lung cells. Here, using PBAE-PEG/LNP, we delivered"
    },
    {
      "pmid": "41448488",
      "doi": "10.1016/j.jtho.2025.12.080",
      "title": "Trastuzumab Deruxtecan in Patients with HER2-Overexpressing Non-Small Cell Lung Cancer: Results From Part 1 of the Open-label, Multicenter, Phase 1b DESTINY-Lung03 Trial.",
      "journal": "Journal of thoracic oncology : official publication of the International Association for the Study of Lung Cancer",
      "pubdate": "2025-12-23T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://doi.org/10.1016/j.jtho.2025.12.080",
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41448488/",
      "url_doi": "https://doi.org/10.1016/j.jtho.2025.12.080",
      "abstract": "INTRODUCTION: HER2-directed treatments for HER2-overexpressing (HER2-OE; immunohistochemistry [IHC] 3+/2+) non-small cell lung cancer (NSCLC) are needed.\n\nMETHODS: DESTINY-Lung03 is an open-label, multi-arm, phase 1b study. Part 1 evaluated trastuzumab deruxtecan (T-DXd, 4.4 or 5.4 mg/kg) plus durvalumab (1120 mg) and cisplatin (60 or 75 mg/m\n\nPRIMARY ENDPOINTS: dose-limiting toxicities (DLTs) and adverse events (AEs: Arms 1A and 1B). Secondary endpoints: safety (Arm 1D) and efficacy (all arms).\n\nRESULTS: At data cutoff (April 1, 2024), 11, 24, and 36 patients received treatment in Arms 1A, 1B, and 1D, respectively. DLTs reported in Arm 1A: febrile neutropenia (n=1; Grade [G] 5; 4.4 mg/kg / 1120 mg / 60 mg/m\n\nCONCLUSIONS: Data confirm activity of T-DXd monotherapy in pretreated HER2-OE NSCLC, but do not support T-DXd plus durvalumab and platinum chemotherapy use in this population."
    },
    {
      "pmid": "41433419",
      "doi": "10.1126/scisignal.ads7662",
      "title": "Cancer-associated fibroblasts confer ALK inhibitor resistance in EML4-ALK-driven lung cancer by concurrent integrin and MET signaling.",
      "journal": "Science signaling",
      "pubdate": "2025-12-23T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41433419/",
      "url_doi": "https://doi.org/10.1126/scisignal.ads7662",
      "abstract": "Cancer-associated fibroblasts (CAFs) are associated with tumor progression and drug resistance. Here, we investigated the mechanisms underlying the cross-talk between CAFs and tumor cells in non-small cell lung cancer (NSCLC). In NSCLC cell lines with"
    },
    {
      "pmid": "41448094",
      "doi": "10.1016/j.lungcan.2025.108885",
      "title": "Cost-effectiveness of adjuvant alectinib in the treatment of patients with resected stage IB-IIIA ALK-positive non-small lung cancer in France, based on the ALINA study.",
      "journal": "Lung cancer (Amsterdam, Netherlands)",
      "pubdate": "2025-12-23T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41448094/",
      "url_doi": "https://doi.org/10.1016/j.lungcan.2025.108885",
      "abstract": "BACKGROUND AND OBJECTIVE: Alectinib has demonstrated significant disease-free survival (DFS) benefits as adjuvant therapy for resected stage IB-IIIA ALK-positive non-small-cell lung cancer (NSCLC) in the ALINA study. This study aimed to assess the cost-effectiveness of introducing adjuvant alectinib into routine clinical practice in France compared with standard adjuvant platinum-based chemotherapy.\n\nMETHODS: A cohort-based semi-Markov model was developed to simulate long-term health and economic outcomes for patients from the ALINA intention-to-treat population over a 40-year time horizon. Eight mutually exclusive health states were included, capturing DFS, non-metastatic recurrence, metastatic recurrence (first and second line), and death. Clinical inputs were sourced primarily from ALINA, while recurrence treatment patterns, cure assumptions, utilities, and costs reflected French clinical practice and French thoracic oncologists' opinion. Costs (2024 euros) and outcomes were discounted following French HTA guidelines. Deterministic, probabilistic, and scenario analyses were conducted.\n\nRESULTS: Adjuvant alectinib would yield 17.6 life-years (LYs) and 15.4 quality-adjusted life-years (QALYs) per patient versus 12.4 LYs and 10.4 QALYs with chemotherapy, corresponding to incremental gains of 5.2 LYs and 5.0 QALYs. Total lifetime costs were estimated at €180,561 with alectinib and €237,011 with chemotherapy, resulting in a cost saving of €56,449. Higher upfront treatment costs with alectinib were offset by substantial reductions in recurrence-related expenditures. Across all deterministic, probabilistic, and scenario analyses, alectinib remained both more effective and less costly.\n\nCONCLUSIONS: Adjuvant alectinib would provide substantial clinical benefits for patients with resected ALK-positive NSCLC and represent a dominant strategy over platinum-based chemotherapy in the French healthcare setting, improving outcomes while reducing overall costs."
    },
    {
      "pmid": "41448093",
      "doi": "10.1016/j.lungcan.2025.108887",
      "title": "Optimizing communication for ultrafast lung cancer biomarker testing: the UTOPIA pilot study.",
      "journal": "Lung cancer (Amsterdam, Netherlands)",
      "pubdate": "2025-12-23T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://doi.org/10.1016/j.lungcan.2025.108887",
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41448093/",
      "url_doi": "https://doi.org/10.1016/j.lungcan.2025.108887",
      "abstract": "BACKGROUND: Non-small cell lung carcinoma (NSCLC) is a leading example of precision oncology, with a growing number of actionable targets. However, long turnaround times (TAT) for biomarker results can delay optimal treatment decisions. We evaluated whether a streamlined workflow could deliver comprehensive molecular reports within 72 h.\n\nMETHODS: In this prospective cohort study (UTOPIA protocol), 96 patients with early-stage or advanced NSCLC at Hospital Universitario 12 de Octubre underwent molecular tumor board (MTB)-centered triage, automated NGS processing, and integrated data review. TAT was defined (in working days) from MTB triage to electronic report validation. Communication was supported by daily operational huddles and intralaboratory pre-MTB meetings using a standardized checklist.\n\nRESULTS: All 96 NGS reports met the 72-hour TAT target (100%). The NGS failure rate was 1%. Potentially actionable genomic alterations were identified in 45.8% of patients, most frequently EGFR (24%) and KRAS G12C (8.3%). Other targetable alterations included six ALK fusions (6.3%), four MET exon 14 skipping mutations (4.2%), two BRAF V600E mutations (2.1%), and one RET fusion (1%).\n\nCONCLUSION: An ultrafast biomarker testing workflow for lung cancer, enabled by MTB-driven triage and structured team communication, can reliably generate comprehensive molecular reports within 72 h. This approach may reduce TAT-related treatment delays and support timely biomarker-guided therapy for patients with NSCLC."
    },
    {
      "pmid": "41428442",
      "doi": "10.1093/ejcts/ezaf467",
      "title": "Impact of lymph node metastasis patterns on long-term survival in upper lobe non-small cell lung cancer.",
      "journal": "European journal of cardio-thoracic surgery : official journal of the European Association for Cardio-thoracic Surgery",
      "pubdate": "2025-12-22T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41428442/",
      "url_doi": "https://doi.org/10.1093/ejcts/ezaf467",
      "abstract": "OBJECTIVES: While treatment strategies for non-small cell lung cancer (NSCLC) continue to evolve, the prognostic implications of lymph node metastasis patterns in upper lobe tumors remain inadequately defined. This study investigated whether tumour laterality and specific nodal stations involved in N2a disease correlate with long-term survival in patients undergoing surgical resection for upper lobe NSCLC.\n\nMETHODS: This retrospective single-center study included patients with stage I-IIIB upper lobe NSCLC who underwent anatomical resection with systematic lymph node dissection from January 2010 to December 2022. Patients were stratified by tumour laterality and nodal involvement, with specific analysis of N2a subgroups based on lymph node station. Propensity score matching, Kaplan-Meier survival analysis, and log-rank testing were used to compare survival outcomes.\n\nRESULTS: Of 3,313 patients considered, 2,028 met the prespecified inclusion criteria (right: n = 1,212; left: n = 816). Mean age was 65.7 ± 9.4 years; 61.7% were male. Median overall survival (OS) was similar for right- and left-sided N0 and N1 tumors. Significant differences emerged among N2a subgroups: Patients with left-sided skip metastases to LN5/6 had markedly improved OS (66.2 ± 14.9 months) versus right-sided LN2/4 (35.3 ± 8.5 months; p = 0.047). Outcomes of left-sided N2a1 LN5/6 were also more favorable than LN7-9 (37.7 ± 15.2 months; p = 0.023) and showed better OS than left-sided N1 disease (47.6 ± 4.2 months; p = 0.284).\n\nCONCLUSIONS: Positive nodal station and tumour laterality significantly impact survival in upper lobe NSCLC. Skip metastases to LN5/6 in left-sided tumors were linked to more favorable prognosis and may warrant inclusion in future TNM classification refinements."
    },
    {
      "pmid": "41443465",
      "doi": "10.1016/j.jtcvs.2025.12.018",
      "title": "Extent of Resection for STAS-positive Stage IA1-2 Non-Small Cell Lung Cancer.",
      "journal": "The Journal of thoracic and cardiovascular surgery",
      "pubdate": "2025-12-22T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41443465/",
      "url_doi": "https://doi.org/10.1016/j.jtcvs.2025.12.018",
      "abstract": "OBJECTIVES: Sublobar resection has demonstrated non-inferiority to lobectomy in unselected stage IA NSCLC; but the optimal surgical approach in tumors with spread-through-airspaces (STAS) remains unclear. This study examines how extent of resection influences clinical outcomes in patients with STAS-positive stage IA1-2 NSCLC.\n\nMETHODS: Patients who underwent lung resection for primary pathologic stage IA1-2 NSCLC between February 2018 and January 2022 at a tertiary academic institution were included. In the STAS-positive cohort, multivariable competing risk models were used to assess cumulative incidence of recurrence and lung cancer-related death following lobectomy versus sublobar resection, and propensity score matched analysis was performed for overall survival and recurrence-free survival. Exploratory analysis was performed to evaluate outcomes after specific resection type (lobectomy, segmentectomy, wedge) in the STAS-positive cohort.\n\nRESULTS: A total of 445 patients met inclusion criteria, of whom 158 (35.9%) were STAS-positive. Within the STAS-positive cohort, recurrence was significantly more frequent after sublobar resection (SHR=7.60, 95% CI 1.85-31.33, p=0.005), and lung cancer-specific mortality was higher (SHR=5.12; 95% CI 1.03-25.62; p=0.047). Propensity-score matching yielded 40 well-balanced pairs. Overall survival was similar between lobectomy and sublobar resection (5-year OS: lobectomy 91.5% vs sublobar 80.3%, p=0.18). In contrast, recurrence-free survival was significantly worse after sublobar resection (5-year RFS: lobectomy 88.8% vs sublobar 66.1%, p=0.042). On exploratory analysis, inferior RFS was observed for wedge resection (p=0.024) but not for segmentectomy (p=0.324) when compared with lobectomy.\n\nCONCLUSIONS: Sublobar resection, particularly wedge resection, is associated with worse recurrence-free survival for STAS-positive stage IA1-2 NSCLC."
    }
  ]
}