{
  "generated": "2026-01-15T05:24:44.184224Z",
  "items": [
    {
      "pmid": "41532856",
      "doi": "10.1158/2159-8290.CD-25-1483",
      "title": "Circulating Tumor Cells Predict Response to the DLL3-targeting Bispecific Antibody Tarlatamab.",
      "journal": "Cancer discovery",
      "pubdate": "2026-01-14T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": "SJR",
      "metric_value": 7.283,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41532856/",
      "url_doi": "https://doi.org/10.1158/2159-8290.CD-25-1483",
      "abstract": "The bispecific antibody tarlatamab recruits T cells to cancers expressing the neuroendocrine epitope DLL3. Tarlatamab is effective in small cell lung cancer (SCLC), but clinical outcomes vary, and no biomarkers enable patient selection. Single-cell RNA sequencing of SCLC biopsies identifies heterogeneity in DLL3 expression, and analysis of circulating tumor cells (CTCs) distinguishes individual patients as predominantly DLL3Pos or DLL3Low. In a prospective cohort of 20 patients, pretreatment DLL3 expression on CTCs predicts tarlatamab clinical benefit (85% sensitivity, 100% specificity). Necrotic CTC clusters in blood accompany treatment-induced tumor lysis. Acquired resistance to tarlatamab is associated in some cases with loss of DLL3 expression, but persistence of other targetable neuro-endocrine epitopes; in other patients, DLL3 is retained on CTCs, but accompanied by systemic markers of T cell dysfunction. Quantitation of DLL3-positive CTCs identifies patients likely to benefit from tarlatamab, and longitudinal monitoring may guide therapeutic decision-making at the time of acquired resistance."
    },
    {
      "pmid": "41525686",
      "doi": "10.1158/2159-8290.CD-25-1222",
      "title": "PD1 blockade-induced DKK1 expression by CD8+ T cells promotes blood-brain barrier permeabilization.",
      "journal": "Cancer discovery",
      "pubdate": "2026-01-13T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://doi.org/10.1158/2159-8290.cd-25-1222",
      "metric_name": "SJR",
      "metric_value": 7.283,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41525686/",
      "url_doi": "https://doi.org/10.1158/2159-8290.CD-25-1222",
      "abstract": "Anti-PD1 therapy benefits a subset of brain metastasis (BrM) patients; however, heterogeneous responses imply an incomplete understanding of the brain-immune ecosystem. To elucidate host-driven determinants of this variability, we performed single-cell RNA sequencing to characterize the brain microenvironment. While anti-PD1 induced robust anti-tumor immune activation, it uniquely, among all ICIs tested, compromised blood-brain barrier (BBB) integrity. This permeabilization was mediated by DKK1-expressing activated CD8⁺ T cells through the induction of β-catenin/TCF and FOXM1 pathways, contributing to endothelial cell destabilization. Depleting plasma-DKK1 restored BBB integrity and reduced experimental BrM formation. Clinically, lung cancer patients receiving anti-PD1 exhibited increased MRI contrast enhancement in the brain, suggestive of BBB perturbations, and increasing plasma DKK1 levels correlated with higher BrM incidence in non-responders. Sequencing anti-PD1 followed by cisplatin improved intracranial cisplatin delivery and therapeutic efficacy in ICI-resistant BrM. These findings identify anti-PD1-induced BBB modulation as a tractable vulnerability in BrM management."
    },
    {
      "pmid": "41521774",
      "doi": "10.1158/2159-8290.CD-25-1836",
      "title": "Testing Nature's Defenses: Inducing Cancer in the Naked Mole Rat.",
      "journal": "Cancer discovery",
      "pubdate": "2026-01-12T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Other",
      "trial_type": null,
      "study_class": "Preclinical",
      "is_oa": false,
      "oa_url": null,
      "metric_name": "SJR",
      "metric_value": 7.283,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41521774/",
      "url_doi": "https://doi.org/10.1158/2159-8290.CD-25-1836",
      "abstract": "Although mice develop lung cancer from a single Eml4-Alk driver fusion, Shepard, Lester, and colleagues show that naked mole rats require three simultaneous oncogenic events: Eml4-Alk, Tp53 loss, and Rb1 loss, achieving only 30% tumor penetrance. This inducible cancer model in naked mole rats offers a unique platform for uncovering mechanisms of cancer resistance and modeling rare pleomorphic lung carcinomas. See related article by Shepard et al., p. 35."
    },
    {
      "pmid": "41405207",
      "doi": "10.1158/2159-8290.CD-NW2025-0107",
      "title": "ADC for SCLC Clears Phase I.",
      "journal": "Cancer discovery",
      "pubdate": "2026-01-12T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "SCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": "SJR",
      "metric_value": 7.283,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41405207/",
      "url_doi": "https://doi.org/10.1158/2159-8290.CD-NW2025-0107",
      "abstract": "ZL-1310, an antibody-drug conjugate that targets DLL3-expressing small cell lung cancer cells, led to responses in nearly half of patients in a phase I study. These results provide further evidence that targeting DLL3 may be a promising approach for treating this cancer."
    },
    {
      "pmid": "41512290",
      "doi": "10.1093/jnci/djag008",
      "title": "Targeting common EGFR mutations in NSCLC-review of global phase III trials of third-generation inhibitors.",
      "journal": "Journal of the National Cancer Institute",
      "pubdate": "2026-01-09T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": "Phase III",
      "study_class": "Prospective",
      "is_oa": false,
      "oa_url": null,
      "metric_name": "SJR",
      "metric_value": 5.703,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41512290/",
      "url_doi": "https://doi.org/10.1093/jnci/djag008",
      "abstract": "Mutations of the epidermal growth factor receptor (EGFR) are frequent oncogenic drivers in non-small cell lung cancer (NSCLC). Third-generation EGFR-tyrosine kinase inhibitors (EGFR-TKIs), which target common EGFR mutations and the acquired T790M resistance mutation, offer improved inhibitory potency and selectivity. Our review critically assesses the evolving role of these agents for management of NSCLC harboring common EGFR mutations. Multiple global phase III trials have recently evaluated third-generation EGFR-TKIs in NSCLC patients with common EGFR mutations. The addition of osimertinib to curative-intent strategies have demonstrated improvements in disease-free survival and overall survival (OS) as adjuvant therapy in resected stage IB-IIIa patients, major pathological responses compared to chemotherapy when used as neoadjuvant therapy, and progression-free survival (PFS) compared to placebo when used as consolidation therapy in unresectable stage III patients. Furthermore, third-generation EGFR-TKI monotherapy improved PFS compared to first-generation EGFR-TKIs in the first-line treatment of advanced disease. Intensification strategies, such as the addition of chemotherapy or a bi-specific antibody have further enhanced both PFS and OS outcomes. Several new therapeutic options are emerging for patients previously treated with third-generation EGFR-TKIs. Currently, subsequent treatment recommendations include chemotherapy or datopotamab deruxtecan following progression on a third-generation EGFR-TKI combination and amivantamab plus platinum-based chemotherapy following progression on monotherapy. The treatment landscape for NSCLC with common EGFR mutations is rapidly evolving and third-generation EGFR-TKIs play an integral role in both the curative-intent and palliative settings."
    },
    {
      "pmid": "41526018",
      "doi": "10.1136/bmjopen-2025-108080",
      "title": "Telehealth-delivered exercise and nutrition intervention to improve outcomes in patients with early stage non-small cell lung cancer: protocol for the multicentre STARLighT phase II (neoadjuvant) and phase III (adjuvant) trial.",
      "journal": "BMJ open",
      "pubdate": "2026-01-12T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": "Phase III",
      "study_class": "Prospective",
      "is_oa": true,
      "oa_url": "https://bmjopen.bmj.com/content/bmjopen/16/1/e108080.full.pdf",
      "metric_name": "SJR",
      "metric_value": 1.016,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41526018/",
      "url_doi": "https://doi.org/10.1136/bmjopen-2025-108080",
      "abstract": "INTRODUCTION: In early stage non-small cell lung cancer (NSCLC), recurrence is frequent despite surgery and systemic treatments. Observational studies suggest that physical exercise and nutrition could improve outcomes, such as survival and treatment tolerance; however, solid evidence is lacking. The STARLighT trial aims to assess the effects of a telehealth-delivered combined exercise and nutrition intervention on clinical, biological and patient-reported outcomes in early stage NSCLC.\n\nMETHODS AND ANALYSIS: STARLighT is a multicentre master protocol study conducted in Italy, comprising two cohorts of patients affected by early stage NSCLC (stages IB-IIIA)\n\nETHICS AND DISSEMINATION: The study is approved by the Ethics Committee of the University of Verona (Prot. No. 33979) and registered on ClinicalTrials.gov (NCT07042724). Findings will be disseminated through peer-reviewed journals, scientific meetings, public forums and guideline updates.\n\nTRIAL REGISTRATION NUMBER: Clinicaltrial.gov: NCT07042724."
    },
    {
      "pmid": "41192526",
      "doi": "10.1016/j.cellsig.2025.112211",
      "title": "RIPK2/STAT3 signaling axis drives lung cancer metastasis through SNAIL activation: Molecular mechanisms and clinical implications.",
      "journal": "Cellular signalling",
      "pubdate": "2026-02-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41192526/",
      "url_doi": "https://doi.org/10.1016/j.cellsig.2025.112211",
      "abstract": "BACKGROUND: Lung adenocarcinoma is the most common histological subtype of lung cancer with high metastatic propensity. Epithelial-mesenchymal transition (EMT) plays a crucial role in tumor metastasis, but the molecular mechanisms remain incompletely elucidated. This study investigates the role of RIPK2 in EMT and metastasis of lung adenocarcinoma.\n\nMETHODS: TCGA database analysis determined RIPK2 expression and clinical significance. RNA interference, overexpression, qRT-PCR, Western blot, co-immunoprecipitation, and immunofluorescence were employed in A549 and PC-9 cell lines. Transwell, EdU, colony formation assays, and cytoskeletal staining assessed cell invasion, proliferation, and EMT changes. Nuclear localization signal (NLS) and nuclear export signal (NES) fusion proteins investigated subcellular localization effects. Tail vein injection in nude mice validated in vivo effects.\n\nRESULTS: RIPK2 was highly expressed in lung adenocarcinoma tissues and associated with poor prognosis. RIPK2 knockdown inhibited while overexpression promoted EMT, invasion, and metastasis. Co-immunoprecipitation and immunofluorescence confirmed direct RIPK2-STAT3 interaction. RIPK2 specifically upregulated EMT transcription factor SNAIL expression. Co-expression of RIPK2 and SNAIL correlated with shorter patient survival. STAT3 or SNAIL knockdown inhibited RIPK2-induced EMT and metastasis. Nuclear-localized RIPK2 completely restored cellular EMT, invasion, and metastatic capabilities while enhancing cisplatin resistance.\n\nCONCLUSION: RIPK2 translocates to the nucleus, interacts with STAT3, and synergistically upregulates SNAIL expression, promoting EMT, invasion, metastasis, and chemotherapy resistance in lung adenocarcinoma. The RIPK2-STAT3-SNAIL signaling axis represents a potential therapeutic target."
    },
    {
      "pmid": "41389771",
      "doi": "10.1016/j.ejca.2025.116165",
      "title": "Long-term outcomes of preoperative nivolumab with or without relatlimab in patients with resectable non-small-cell lung cancer (NEOpredict-Lung).",
      "journal": "European journal of cancer (Oxford, England : 1990)",
      "pubdate": "2026-01-17T00:00:00+00:00",
      "pubtypes": [
        "Journal Article",
        "Randomized Controlled Trial"
      ],
      "entity": "Thoracic-other",
      "trial_type": "RCT",
      "study_class": "Prospective",
      "is_oa": true,
      "oa_url": "https://www.ejcancer.com/article/S0959-8049(25)01051-2/pdf",
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41389771/",
      "url_doi": "https://doi.org/10.1016/j.ejca.2025.116165",
      "abstract": "BACKGROUND: Preoperative immunotherapy targeting PD-1/-L1 with chemotherapy induces histopathological responses and improves survival in patients with resectable non-small cell lung cancer (NSCLC). NEOpredict-Lung (NCT04205552) established the feasibility of dual blockade of PD-1 and LAG-3 immune checkpoints prior to curatively intended resection. Here we report extended follow-up, postoperative treatments and patterns of response and recurrence.\n\nPATIENTS AND METHODS: Patients with resectable NSCLC (stages IB-IIIA) were randomized to receive two doses nivolumab (240 mg, arm A) with or without relatlimab (80 mg, arm B) every 2 weeks. Overall and disease-free survival (OS, DFS) rates, response and recurrence patterns and subsequent therapies were evaluated.\n\nRESULTS: 60 patients were enrolled from March 2020 to July 2022. The present analysis was conducted per December 2024 with a median follow-up of 37.4 months. 45 patients were alive without disease recurrence,15 patients recurred (4 locoregional and 11 metastatic), and 7 patients died. The 3-year OS and DFS rates were 88.4 % and 73.3 % in arm A and 88.9 % and 60.3 % in arm B. Patients achieving major pathological response (≤10 % viable tumor cells in resected NSCLC) trended towards better DFS (HR 0.35; 95 % CI, 0.1-1.19). Downstaging was confirmed in 53.3 % of patients in arm A and in 66.7 % of patients in arm B. Nodal downstaging occurred in 28.6 % of patients with nodal disease in arm A and in 66.7 % of patients in arm B.\n\nCONCLUSIONS: Short course preoperative nivolumab with or without relatlimab showed encouraging efficacy and survival outcomes, which compare favorably with chemo-immunotherapy-based perioperative treatment regimens."
    },
    {
      "pmid": "41421886",
      "doi": "10.1016/j.ejca.2025.116069",
      "title": "Bridging the gap in lung cancer: A comprehensive global strategy for change.",
      "journal": "European journal of cancer (Oxford, England : 1990)",
      "pubdate": "2026-01-17T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Preclinical",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41421886/",
      "url_doi": "https://doi.org/10.1016/j.ejca.2025.116069",
      "abstract": "BACKGROUND: Unless greater awareness inspires action, lung cancer will become the next global public health emergency. Despite improvements in screening, diagnosis, and treatments, more must be done because global incidence continues to increase. Concerted action must address the burden both between and within countries. Inequalities result from the uneven distribution of resources while inequities result from differences in prevention, screening, diagnosis, and treatment.\n\nMETHOD: Participants in the 9th International Lung Cancer Network conference (Athens, June 2023) received an advanced draft of the declaration with a confidentiality notice by email upon completion of online registration. They were invited to provide comments and suggestions up to seven days before the meeting. All contributions were reviewed by the authors and incorporated into the final version circulated the day before the meeting began. Although not a formal Delphi-style process, this approach prioritized inclusivity, transparency, and broad endorsement. Outreach extended beyond onsite attendees, ensuring diverse perspectives and representation. This process complements methodological consensus approaches by uniting stakeholders around shared policy goals.\n\nRESULTS: At the 9th International Lung Cancer Network conference, participants were invited to sign the final declaration, and 785 did so. Since then, 20 organizations worldwide have formally endorsed the Consensus Statement, and support continues to grow. The inclusive design has fostered broad and sustained backing, underscoring the value of the Statement as a unifying policy declaration advancing shared principles.\n\nCONCLUSION: The Consensus Statement, Bridging the Gap in the Diagnosis and Management of Lung Cancer, reinforces five unifying principles: improve and expand prevention; focus on early detection; ensure equitable and sustainable access to treatment; build partnerships and promote investment; and, combat stigma, recognizing it as a social determinant of public health."
    },
    {
      "pmid": "41529222",
      "doi": "10.1200/JCO-25-01828",
      "title": "Adjuvant Durvalumab in Completely Resected Early-Stage Non-Small Cell Lung Cancer.",
      "journal": "Journal of clinical oncology : official journal of the American Society of Clinical Oncology",
      "pubdate": "2026-01-13T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41529222/",
      "url_doi": "https://doi.org/10.1200/JCO-25-01828",
      "abstract": "PURPOSE: Adjuvant immunotherapy improved patient outcomes in two trials in completely resected non-small cell lung cancer (NSCLC), but with conflicting primary end point results. The Canadian Cancer Trials Group BR.31 trial evaluated adjuvant durvalumab in completely resected early-stage NSCLC.\n\nMETHODS: Following resection of stage IB (≥4 cm) to IIIA NSCLC (American Joint Committee on Cancer 7th Edition) and optional adjuvant chemotherapy, patients were randomly assigned 2:1 to durvalumab 20 mg/kg or placebo 20 mg/kg once every 4 weeks for 12 cycles. Random assignment was stratified by stage, extent of nodal dissection, tumor cell (TC) PD-L1 expression, adjuvant chemotherapy use, and center. The primary end point was investigator-assessed disease-free survival (DFS). Secondary outcomes included overall survival (OS), adverse events, and quality of life. The primary analysis was in the subgroup with cancers that had a PD-L1 TC expression ≥25%, no common activating\n\nRESULTS: Of 1,415 patients randomly assigned, 1,219 (86%) had\n\nCONCLUSION: Adjuvant durvalumab following complete resection was not associated with improvement in DFS compared with placebo in"
    },
    {
      "pmid": "41529214",
      "doi": "10.1200/JCO-25-01569",
      "title": "Chemoradiation ± Atezolizumab in Limited-Stage Small Cell Lung Cancer: Results of NRG Oncology/Alliance LU005.",
      "journal": "Journal of clinical oncology : official journal of the American Society of Clinical Oncology",
      "pubdate": "2026-01-13T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "SCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41529214/",
      "url_doi": "https://doi.org/10.1200/JCO-25-01569",
      "abstract": "PURPOSE: NRG Oncology/Alliance LU005 (ClinicalTrials.gov identifier: NCT03811002) tested the addition of atezolizumab to concurrent chemoradiation (CRT) in this open-label, phase III international trial.\n\nMETHODS: Patients with limited-stage small cell lung cancer (LS-SCLC), stage Tx-IV, N0-3, and M0 with Eastern Cooperative Group performance status (PS) 0-2 received one cycle of chemotherapy (platinum/etoposide) before study registration and were randomly assigned to CRT alone versus CRT plus concurrent and adjuvant atezolizumab, 1,200 mg once daily, every 3 weeks until investigator-assessed progression or intolerable side effects for a maximum of 17 cycles. Patients were stratified by choice of chemotherapy (cisplatin\n\nRESULTS: patients were randomly assigned from May 2019 to December 2023. The median OS was 36.1 months (95% CI, 28.1 to 42.5) for the CRT-alone arm and 31.1 months (95% CI, 28.5 to 44.7) for the CRT + atezolizumab arm, respectively (hazard ratio [HR], 1.03 [95% CI, 0.80 to 1.32]). The median PFS was 11.4 months (95% CI, 10.3 to 13.2) for the CRT-alone arm and 12.1 months (95% CI, 10.9 to 15.2) for the CRT + atezolizumab arm, respectively (HR, 0.98 [95% CI, 0.79 to 1.22]). The median DMFS was 13.0 months (95% CI, 11.3 to 18.2) for the CRT-alone arm and 16.8 months (95% CI, 12.1 to 21.6) for the CRT + atezolizumab arm (HR, 0.96 [95% CI, 0.76 to 1.21]). No unexpected safety signals with concurrent atezolizumab were observed.\n\nCONCLUSION: Concurrent and adjuvant atezolizumab with chemoradiation did not improve survival in patients with LS-SCLC."
    },
    {
      "pmid": "41526205",
      "doi": "10.1016/j.lungcan.2026.108909",
      "title": "Corrigendum to \"Global trends in lung cancer incidence and mortality by age, gender and morphology and forecast: A bootstrap-based analysis\". [Lung Cancer 205 (2025) 108626].",
      "journal": "Lung cancer (Amsterdam, Netherlands)",
      "pubdate": "2026-01-11T00:00:00+00:00",
      "pubtypes": [
        "Published Erratum"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://www.lungcancerjournal.info/article/S0169-5002(26)00004-8/pdf",
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41526205/",
      "url_doi": "https://doi.org/10.1016/j.lungcan.2026.108909",
      "abstract": null
    }
  ]
}