{
  "generated": "2025-11-13T05:17:29.081942Z",
  "items": [
    {
      "pmid": "40975161",
      "doi": "10.1016/j.canlet.2025.218046",
      "title": "Hinokitiol preferentially suppresses metastatic lung adenocarcinoma via TMDD1-mediated ferroptosis induction and iron-sulfur cluster inhibition.",
      "journal": "Cancer letters",
      "pubdate": "2025-12-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": "SJR",
      "metric_value": 2.756,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40975161/",
      "url_doi": "https://doi.org/10.1016/j.canlet.2025.218046",
      "abstract": "Dysregulated ISC metabolism has been implicated in cancer progression, but its role in LUAD pathogenesis and therapeutic targeting remains poorly understood. Here, we demonstrate that ISC biogenesis is significantly upregulated in LUAD, driven by transcription factors KLF15 and ZNF384, which activate GLRX5, LYRM4, NFS1 and BOLA3 promoters. IL-1β promotes PCAF mitochondrial translocation, releasing EP300 to amplify KLF15/ZNF384-mediated transcriptional activation. The natural monoterpenoid Hinokitiol inhibits LUAD growth by disrupting EP300-KLF15/ZNF384 interactions, suppressing ISC biogenesis gene expression and inducing ferroptosis. Mechanistically, the membrane protein TMDD1, particularly its cytoplasmic domain, promotes Hinokitiol's anti-tumor effects by facilitating EP300-KLF15/ZNF384 dissociation and inhibiting ISC biogenesis. Remarkably, Hinokitiol exhibits stage-dependent efficacy, with superior suppression of metastatic (stage IV) tumors linked to heightened ferroptosis sensitivity. This study not only elucidates the transcriptional machinery governing ISC biogenesis in LUAD but also highlights Hinokitiol's dual mechanism as a promising stage-specific therapeutic agent, offering novel strategies for advanced disease management."
    },
    {
      "pmid": "40650354",
      "doi": "10.1002/ijc.70045",
      "title": "Stage- and histology-specific sensitivity for the detection of lung cancer of the NELSON screening protocol-A modeling study.",
      "journal": "International journal of cancer",
      "pubdate": "2025-12-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://onlinelibrary.wiley.com/doi/pdfdirect/10.1002/ijc.70045",
      "metric_name": "SJR",
      "metric_value": 2.252,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40650354/",
      "url_doi": "https://doi.org/10.1002/ijc.70045",
      "abstract": "The Dutch-Belgian lung cancer (LC) screening trial (Nederlands-Leuvens Longkanker Screenings Onderzoek [NELSON]) demonstrated low-dose computed tomography (CT) reduces LC mortality by 24% among men. The NELSON protocol differed from previous trials in the eligibility criteria, the use of volume-based nodule management, and increasing screening intervals. The early-stage sensitivity of the protocol is pivotal in determining the optimal screening strategy, such as the interval and age range. The MIcrosimulation SCreening ANalysis-Lung natural history model was used to reproduce LC incidence and mortality by detection method (clinical or screen-detected), sex, histology, and stage in the NELSON trial based on individual-level data. We evaluated screening effectiveness by stage and histology, accounting for population characteristics, trial design, and LC epidemiology. We find stage IA non-small cell LC (NSCLC) sensitivity of 24.6% (other NSCLC) to 41.0% (adenocarcinoma) at baseline screening. At repeat screening rounds, we find this increased to 70.9% for stage IA adenocarcinoma. For stage IB, the sensitivity by histology ranges from 26.4% to 77.1%; for stage II, 39.6%-81.9%. Upon detection, the probability of LC mortality prevention is estimated at 83% for stage IA. The sensitivity for detecting early-stage LC is found to depend on the histology of cancer and is increased for adenocarcinoma at repeat screenings. Despite a low rate of referral to follow-up screening in the NELSON trial, early-stage CT sensitivity and the probability of mortality prevention were similar to previous estimates from the National Lung cancer Screening Trial. Previously demonstrated screening effectiveness may be maintained when implementing new programs, while reducing unnecessary follow-up when considering NELSON evidence."
    },
    {
      "pmid": "41221490",
      "doi": "10.1177/17588359251370510",
      "title": "PI3K/mTORC2-RICTOR axis in early squamous non-small-cell lung cancer: genomics, molecular expression, and clinical relevance.",
      "journal": "Therapeutic advances in medical oncology",
      "pubdate": "2025-11-07T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://doi.org/10.1177/17588359251370510",
      "metric_name": "SJR",
      "metric_value": 1.549,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41221490/",
      "url_doi": "https://doi.org/10.1177/17588359251370510",
      "abstract": "BACKGROUND: Although considerable discoveries have been made in the genomic landscape of lung adenocarcinoma, to date, little is known regarding potential prognostic factors and altered pathways in resected squamous non-small-cell lung cancer (squamous-NSCLC).\n\nOBJECTIVE: We aimed to analyze the genomic background of prognostic outlier patients, selected based on a previously validated model, to assess differential genomics, and to investigate its relationship with prognosis.\n\nDESIGN: We conducted a retrospective study on three squamous-NSCLC cohorts, integrating next-generation sequencing (NGS)-based genomic profiling and NanoString expression analysis to identify molecular alterations associated with patient prognosis.\n\nMETHODS: NGS analysis of somatic mutations (SM) and copy number variations (CNV) was performed by applying a 409-gene Comprehensive Cancer panel in the training set (Cohort #1) and a 56-gene customized panel in the validation set (Cohort #2). Genomic expression (NanoString) was further evaluated on an additional cohort (Cohort #3).\n\nRESULTS: Sixty and thirty-seven (\n\nCONCLUSION: This integrated multi-step analysis identified potentially altered pathways with a biological impact on squamous-NSCLC oncogenesis, suggesting that the PI3KCA/mTOR pathway could affect the prognosis of resected SCC patients through both genomic aberrations and impaired expression."
    },
    {
      "pmid": "41218106",
      "doi": "10.1080/09273948.2025.2584590",
      "title": "Crizotinib-Associated Uveitis and Scleritis with Abscess Formation.",
      "journal": "Ocular immunology and inflammation",
      "pubdate": "2025-11-11T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": "SJR",
      "metric_value": 0.805,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41218106/",
      "url_doi": "https://doi.org/10.1080/09273948.2025.2584590",
      "abstract": "PURPOSE: To report a case series of uveitis and scleritis in patients receiving crizotinib for the treatment of lung cancer.\n\nMETHODS: Retrospective case series.\n\nRESULTS: Two female patients (aged 62 and 68 years) who had been on long-term crizotinib treatment (29 and 28 months, respectively) presented with a unique manifestation of unilateral panuveitis and scleritis accompanied by massive abscess formation. Despite extensive microbiologic and cytologic testing, all results were negative. The intraocular inflammation was refractory to systemic and intravitreal antibiotics, corticosteroids, immunosuppressive agents, and biologic therapy; however, both cases showed dramatic improvement after switching to alternative tyrosine kinase inhibitor.\n\nCONCLUSION: A vision-threatening or treatment-refractory form of uveitis and necrotizing scleritis with abscess formation can develop in patients receiving crizotinib. Clinicians should be aware of the possibility of crizotinib-associated ocular inflammation in lung cancer patients to avoid unnecessary diagnostic workups and inappropriate treatments."
    },
    {
      "pmid": "40912643",
      "doi": "10.1016/j.avsg.2025.08.029",
      "title": "Temporal Patterns and Risk Factors for Pulmonary Embolism Associated with Antitumor Therapies in Patients with Lung Cancer.",
      "journal": "Annals of vascular surgery",
      "pubdate": "2025-12-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": "SJR",
      "metric_value": 0.707,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40912643/",
      "url_doi": "https://doi.org/10.1016/j.avsg.2025.08.029",
      "abstract": "BACKGROUND: This study aimed to characterize the association between pulmonary embolism (PE) onset time and various antitumor therapeutic approaches in patients with lung cancer, with the goal of identifying potential high-risk populations.\n\nMETHODS: A retrospective analysis was conducted on clinical records from 2019 to 2025, among the 84,000 inpatients with lung cancer, 106 patients developed PE during hospitalization for antitumor treatment, who were confirmed using spiral computed tomography or pulmonary angiography per Chinese Thoracic Society (2018) and The New England Journal of Medicine (2010) criteria. Data were collected on patient demographics, cancer staging, treatment type, and time to PE onset.\n\nRESULTS: Among patients who developed PE during lung cancer treatment, the mean age was 66.82 ± 10.50 years. Females comprised 64.04% of cases, adenocarcinoma was identified in 60.38%, and stage IV lung cancer was present in 56.60%. First-line therapy was administered in 63.21% of cases, and 66.04% exhibited enlarged mediastinal lymph nodes. The mean D-dimer level among this cohort was 3.559 μg/mL, indicating a heightened thrombotic risk. Temporally, 50.95% of PE cases occurred within 6 months of lung cancer diagnosis. Onset within 3 months following therapy initiation was observed across multiple modalities: 46.15% for chemotherapy, 34.78% for targeted therapy, and 77.78% following surgical intervention. Notably, 16.98% of PE events occurred during the initial chemotherapy cycle. The mean time to PE onset was 1.81 ± 2.51 months for patients undergoing surgery alone, compared to 15.52 ± 12.88 months for those receiving surgery combined with other treatments (P < 0.05). Surgical intervention was identified as an independent risk factor for PE. In early-stage lung cancer, the mean time to PE onset was significantly shorter, with a mean time of 16.38 ± 21.07 months (P < 0.05).\n\nCONCLUSION: The timing and incidence of PE vary according to the type of antitumor therapy administered in lung cancer treatment. These findings underscore the importance of vigilant monitoring, personalized risk assessment, and targeted anticoagulation strategies throughout the therapeutic course."
    },
    {
      "pmid": "41217067",
      "doi": "10.1080/20565623.2025.2578145",
      "title": "Plain language summary of the ALINA study results: alectinib compared with chemotherapy after surgery in people with ALK-positive non-small cell lung cancer.",
      "journal": "Future science OA",
      "pubdate": "2025-12-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": "SJR",
      "metric_value": 0.536,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41217067/",
      "url_doi": "https://doi.org/10.1080/20565623.2025.2578145",
      "abstract": null
    },
    {
      "pmid": "41219394",
      "doi": "10.1038/s41571-025-01085-z",
      "title": "Navigating the landscape of EGFR TKI resistance in EGFR-mutant NSCLC - mechanisms and evolving treatment approaches.",
      "journal": "Nature reviews. Clinical oncology",
      "pubdate": "2025-11-11T00:00:00+00:00",
      "pubtypes": [
        "Journal Article",
        "Review"
      ],
      "entity": "NSCLC",
      "trial_type": "Review/Meta",
      "study_class": "Review",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41219394/",
      "url_doi": "https://doi.org/10.1038/s41571-025-01085-z",
      "abstract": "Resistance to EGFR tyrosine kinase inhibitors (TKIs) remains a major obstacle in the clinical management of EGFR-mutant non-small-cell lung cancer (NSCLC). Despite the transformative therapeutic activity of the multiple iterations of EGFR TKIs, spanning from first-generation reversible inhibitors such as erlotinib and gefitinib to the current standard-of-care third-generation covalent inhibitor osimertinib, primary or acquired resistance to these agents inevitably emerges via diverse mechanisms. The advent of combination therapies that incorporate chemotherapy, anti-angiogenic agents, bispecific antibodies or antibody-drug conjugates has increased clinical benefit but introduced new resistance phenotypes, underscoring the dynamic plasticity and complexity of tumour evolution under therapeutic pressure. In this Review, we provide a comprehensive synthesis of the molecular mechanisms that underlie resistance to third-generation EGFR TKIs, describe biomarker-guided and biomarker-unselected therapeutic strategies to overcome these mechanisms, and discuss emerging approaches to pre-empt resistance through early application of combination therapies. We highlight the paradigm shift from radiological to molecular monitoring of resistance to therapy and explore how advances in circulating tumour DNA analysis, artificial intelligence and multi-omics might facilitate adaptive treatment strategies. As the therapeutic landscape evolves, a more complete mechanistic understanding of resistance will be essential to guide rational treatment sequencing, inform trial design and improve long-term outcomes for patients with EGFR-mutant NSCLC."
    },
    {
      "pmid": "41219537",
      "doi": "10.1038/s44321-025-00326-z",
      "title": "The repressor Capicua is a barrier to lung tumor development driven by Kras/Trp53 mutations.",
      "journal": "EMBO molecular medicine",
      "pubdate": "2025-11-11T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41219537/",
      "url_doi": "https://doi.org/10.1038/s44321-025-00326-z",
      "abstract": "KRAS mutations are responsible for a quarter of all lung adenocarcinomas. However, the molecular mechanisms linking these mutations and their frequent secondary dosage amplification to tumor formation are still not fully understood. While ample evidence supports a crucial role for the MAPK pathway in tumor development, the primary effectors targeted by this pathway remain largely unexplored. Here we identify the transcriptional repressor Capicua (CIC) as a key target inactivated by KRAS/MAPK signaling in lung adenocarcinoma. We show that genetic loss of CIC recapitulates the phenotypic consequences of amplified KRAS signaling. Genetic disruption of CIC suppressed the requirement for Kras allelic imbalances and accelerated the transformation of bronchiolar Club cells. We also demonstrate that restoring CIC repressor activity impaired proliferation of CIC-deficient tumor cells and reverted resistance to MAPK pathway inhibitors. These results highlight the key role of CIC during lung tumor formation and suggest that selective pressure for effective CIC inactivation favors secondary amplification of KRAS/MAPK signaling in tumor cells."
    },
    {
      "pmid": "41052285",
      "doi": "10.1093/oncolo/oyaf332",
      "title": "Antibody drugs conjugates in small-cell lung cancer: present-day status and promises.",
      "journal": "The oncologist",
      "pubdate": "2025-11-11T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://academic.oup.com/oncolo/advance-article-pdf/doi/10.1093/oncolo/oyaf332/64521973/oyaf332.pdf",
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41052285/",
      "url_doi": "https://doi.org/10.1093/oncolo/oyaf332",
      "abstract": "INTRODUCTION: Small-cell lung cancer (SCLC) accounts for 15% of lung cancers and is characterized by an aggressive disease course and historically poor prognosis. Although tumors in most patients respond to initial chemotherapy, relapse is nearly universal and treatment options remain limited. Antibody-drug conjugates (ADCs) have emerged as a novel therapeutic class with the potential to address this unmet need.\n\nMETHODS: ClinicalTrials.gov, PubMed, and their associated references and press releases were queried for the search terms \"antibody-drug -conjugates\" and \"SCLC.\" Only English-language sources were included.\n\nRESULTS: Multiple ADCs targeting diverse antigens have been evaluated in relapsed or refractory SCLC. Topoisomerase I inhibitor payloads have generated the most consistent activity across delta-like protein 3, TROP2, B7-H3, and SEZ6 targets, while microtubule and pyrrolobenzodiazepine-based constructs have not demonstrated durable benefit. Despite encouraging response rates, progression-free survival has remained short, reflecting intrinsic resistance, antigen heterogeneity, and toxicity-related dose limitations.\n\nCONCLUSION: While ADCs have generated encouraging response rates in SCLC, durability has remained limited. Future development will require optimization of payloads, linkers, and trial design to determine whether ADCs can achieve a sustained role in this disease."
    },
    {
      "pmid": "41218896",
      "doi": "10.3760/cma.j.cn112137-20250722-01823",
      "title": "[Clinical characteristics of central nervous system thrombotic events associated with Trousseau's syndrome and literature review].",
      "journal": "Zhonghua yi xue za zhi",
      "pubdate": "2025-11-11T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Other",
      "trial_type": null,
      "study_class": "Preclinical",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41218896/",
      "url_doi": "https://doi.org/10.3760/cma.j.cn112137-20250722-01823",
      "abstract": "A retrospective analysis was conducted on the clinical characteristics and imaging manifestations of 6 patients diagnosed with Trousseau's syndrome accompanied by central nervous system (CNS) thrombotic events at Beijing Tongren Hospital between December 2015 and December 2022. Additionally, a literature review was performed summarizing 86 cases of Trousseau syndrome retrieved from PubMed and CNKI from January 1, 2020 to January 1, 2025. Among the 6 included patients, 2 were male and 4 were female, with a median age ["
    },
    {
      "pmid": "41218560",
      "doi": "10.1016/j.lungcan.2025.108835",
      "title": "Long-term survival comparison of first-line pembrolizumab versus pembrolizumab plus chemotherapy for patients with advanced non-small cell lung cancer: A multicenter propensity-matched cohort study.",
      "journal": "Lung cancer (Amsterdam, Netherlands)",
      "pubdate": "2025-11-07T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://www.lungcancerjournal.info/article/S0169-5002(25)00727-5/pdf",
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41218560/",
      "url_doi": "https://doi.org/10.1016/j.lungcan.2025.108835",
      "abstract": "BACKGROUND: Pembrolizumab is currently used as a first-line therapy for EGFR- and ALK-negative advanced non-small cell lung cancer (NSCLC). However, whether pembrolizumab alone (P-mono) or combined with platinum chemotherapy (P-combo) provides superior long-term benefit remains unclear.\n\nMETHODS: We retrospectively analyzed 392 patients with PD-L1 TPS ≥ 1 % treated first-line with P-mono (n = 194) or P-combo (n = 198) between 2019 and 2021. Propensity-score matching across 13 baseline variables yielded two well-balanced cohorts of 97 patients each, with a median follow-ups of 42.8 and 44.1 months, respectively.\n\nRESULTS: P-combo prolonged overall survival (OS) (median 31.8 vs 20.7 months; hazard ratio [HR] 0.67, 95 % confidence interval [CI] 0.46-0.96) and progression-free survival (12.5 vs 7.0 months; HR 0.59, 95 %CI 0.43-0.81). The 3- and 4-year OS rates were 49.8 % and 42.7 %, respectively, with P-combo, compared with 28.1 % and 22.3 % with P-mono. The 48-month restricted mean survival time also favored P-combo (p = 0.039). Additionally, greater benefits were observed among patients aged < 75 years, with ECOG performance status 0-1, PD-L1 TPS 1-49 %, and those using proton-pump inhibitors. Grade ≥ 3 treatment-related adverse events (TRAEs) were more frequent with P-combo (35 % vs 20 %, p = 0.024). However, treatment-related deaths (2 % each) and pneumonitis incidence and severity were comparable; cumulative toxicity curves plateaued after 3 years.\n\nCONCLUSIONS: These findings suggest that P-combo showed a durable survival advantage over monotherapy and acceptable TRAEs in patients with PD-L1-positive NSCLC, identifying clinical subgroups most likely to benefit. Prospective randomized trials are warranted to validate these observations and guide optimal first-line treatment strategies."
    },
    {
      "pmid": "41207477",
      "doi": "10.1016/j.jtho.2025.11.001",
      "title": "Chromosome 15q15 Deletion Drives Brain Metastasis in Non-Small Cell Lung Cancer.",
      "journal": "Journal of thoracic oncology : official publication of the International Association for the Study of Lung Cancer",
      "pubdate": "2025-11-07T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41207477/",
      "url_doi": "https://doi.org/10.1016/j.jtho.2025.11.001",
      "abstract": "INTRODUCTION: Brain metastasis (BM) is a devastating complication of non-small cell lung cancer (NSCLC), particularly in NSCLC tumors harboring EGFR mutations. However, the genomic alterations driving BM remain poorly understood.\n\nMETHODS: We analyzed three independent cohorts of resected NSCLCs from Asian patients, including 1,081 primary tumor (PT) samples analyzed by whole-genome sequencing (WGS, discovery cohort, n=180) or whole-exome sequencing (WES, validation cohort, n=901), 8 BM samples, and 17 matched primary-BM pairs analyzed by WGS (BM cohort). Furthermore, RNA sequencing of the available 172 samples in the validation cohort and drug sensitivity profiling using NSCLC cell lines were performed.\n\nRESULTS: In the discovery cohort, deletions of the 15q15 chromosomal segment were more enriched in PTs from patients with BM than in those without this deletion (73% vs. 39%, P=0.004). Cumulative BM incidence was significantly higher in PTs with the 15q15 deletion (sub-distribution hazard ratio=3.9, P=0.008 [Fine-Gray competing risk analysis]), whereas metastases at other organ sites did not differ significantly. These findings were obtained using the validation cohort. The 15q15 deletions significantly co-occurred with EGFR mutations (P=2.8×10\n\nCONCLUSIONS: The 15q15 deletion promotes BM development through aberrant MYC signaling and the subsequent reprogramming of carbohydrate metabolism."
    },
    {
      "pmid": "41205598",
      "doi": "10.1016/j.cell.2025.10.020",
      "title": "Longitudinal ultrasensitive ctDNA monitoring for high-resolution lung cancer risk prediction.",
      "journal": "Cell",
      "pubdate": "2025-11-07T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41205598/",
      "url_doi": "https://doi.org/10.1016/j.cell.2025.10.020",
      "abstract": "Biomarkers accurately informing prognostic assessment and therapeutic strategy are critical for improving patient outcome in oncology. Here, we apply a whole-genome, tumor-informed circulating tumor DNA (ctDNA) detection approach to address this challenge, leveraging 1,800 variants across 2,994 plasma samples from 431 patients with non-small cell lung cancer (NSCLC) from the TRACERx study. We show that ultrasensitive ctDNA detection below 80 parts per million both pre- and postoperatively is highly prognostic, and combinatorial analysis of the pre- and postoperative ctDNA status identifies an intermediate risk group, improving disease stratification. ctDNA kinetics demonstrate clinical utility during adjuvant therapy, where patients that \"clear\" ctDNA during adjuvant therapy experience improved outcomes. Moreover, characterization of patterns in postoperative ctDNA kinetics reveals insights into the timing, risk, and anatomical pattern of relapses. By incorporating longitudinal ultrasensitive ctDNA detection, we propose a refined schema for guiding the stratification and treatment recommendations in early stage NSCLC."
    }
  ]
}