{
  "generated": "2025-11-29T05:16:46.973632Z",
  "items": [
    {
      "pmid": "41296331",
      "doi": "10.1001/jamaoncol.2025.5097",
      "title": "Lorlatinib in Tyrosine Kinase Inhibitor-Naive Advanced ROS1-Positive Non-Small Cell Lung Cancer: A Phase 2 Nonrandomized Clinical Trial.",
      "journal": "JAMA oncology",
      "pubdate": "2025-11-26T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": "SJR",
      "metric_value": 8.377,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41296331/",
      "url_doi": "https://doi.org/10.1001/jamaoncol.2025.5097",
      "abstract": "IMPORTANCE: ROS1 rearrangement is rare but is an attractive therapeutic target in advanced non-small cell lung cancer (NSCLC). Crizotinib, entrectinib, and repotrectinib have been approved by the US Food and Drug Administration for treatment of ROS1-positive NSCLC. Lorlatinib, a brain-penetrant, third-generation tyrosine kinase inhibitor (TKI), targets ROS1 and ALK; however, its efficacy and safety for patients with advanced ROS1-positive remains unknown.\n\nOBJECTIVE: To evaluate the efficacy and safety of lorlatinib for patients with advanced ROS1-positive NSCLC never treated with any TKI.\n\nDESIGN, SETTING, AND PARTICIPANTS: This multicenter phase 2 nonrandomized clinical trial enrolled patients with advanced ROS1-positive NSCLC who were TKI-naive with an Eastern Cooperative Oncology Group performance status of 2 or less, and 1 or no prior platinum-based chemotherapy. Participants were recruited from June 2019 to April 2023 and followed up through August 2024. Data analysis was performed from April 5 to August 30, 2025.\n\nINTERVENTIONS: Lorlatinib, 100 mg daily, was administered until disease progression, toxic effects, consent withdrawal, or death.\n\nMAIN OUTCOMES AND MEASURES: Objective response rate (ORR). Secondary end points were progression-free survival (PFS), overall survival, and safety.\n\nRESULTS: The analysis included 32 patients (mean [IQR] age, 59 [11] years; 20 female [63%] and 12 male [37%] individuals), all of whom had adenocarcinoma histologic findings. There were 21 patients (66%) who were treatment-naive, and 11 (34%) who had prior chemotherapy. The median (SD) follow-up duration was 22.1 (15.4-46.8) months; ORR was 73% (95% CI, 56%-86%; 22 of 30 patients), and disease control rate was 90% (95% CI, 74%-97%; 27 of 30 patients). Median (IQR) PFS was 53.6 (95% CI, 27.8-79.5) months, and overall survival was not reached. For treatment-naive vs previously treated patients, the ORR was 90% vs 60%, and PFS was not reached vs 35.8 months. Grade 3 to 4 adverse effects were hypertriglyceridemia (5 patients [16%]) and hypercholesterolemia (8 patients [25%]). No treatment-related deaths occurred.\n\nCONCLUSIONS AND RELEVANCE: In this nonrandomized clinical trial, lorlatinib demonstrated durable efficacy and manageable safety in TKI-naive advanced ROS1-positive NSCLC, supporting the potential for using lorlatinib in earlier treatment settings.\n\nTRIAL REGISTRATION: ClinicalTrials.gov Identifier: NCT03612154."
    },
    {
      "pmid": "41289566",
      "doi": "10.1158/0008-5472.CAN-25-0582",
      "title": "A Deep Learning Framework Integrating Tumor Microenvironmental Features Accurately Predicts Multiple Driver Gene Mutations in Lung Cancer Pathology Images.",
      "journal": "Cancer research",
      "pubdate": "2025-11-25T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Preclinical",
      "is_oa": false,
      "oa_url": null,
      "metric_name": "SJR",
      "metric_value": 3.879,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41289566/",
      "url_doi": "https://doi.org/10.1158/0008-5472.CAN-25-0582",
      "abstract": "Deep learning (DL) has the potential to enable the prediction of gene mutations directly from routine histopathology slides in lung cancer. However, existing approaches have largely been limited to mutation-level prediction and have not achieved precise identification of driver mutation subtypes or exonic variants, constraining the translation of DL into targeted therapy. In this study, we assembled a large multicenter dataset of paired pathology images and next-generation sequencing from 2573 lung cancer patients from four hospitals in China. Development of NAVF-Bio, an adaptive multi-view feature fusion framework based on multiple-instance learning, enabled integration of tumor microenvironment (TME) features from whole-slide images (WSIs) to predict driver mutations and tumor mutational burden (TMB). Benchmarking against 11 state-of-the-art DL methods indicated that NAVF-Bio consistently outperformed existing models in predicting driver mutations (TP53, EGFR, KRAS, ALK) and TMB status, achieving clinically relevant performance in external multicenter validation. Notably, NAVF-Bio accurately predicted the mutated driver gene exons across centers, while interpretability analyses using WSI visualization and TME quantification further demonstrated the ability of NAVF-Bio to elucidate pathologically relevant tumor features. Finally, a multi-gene mutation prediction platform for lung cancer was generated to facilitate the screening of driver gene mutations. Overall, NAVF-Bio mimics the workflow of pathologists when examining slides by observing multi-scale features of WSIs and TME characteristics to predict driver gene mutations in lung cancer, which could guide the selection of targeted therapies for patients."
    },
    {
      "pmid": "40975161",
      "doi": "10.1016/j.canlet.2025.218046",
      "title": "Hinokitiol preferentially suppresses metastatic lung adenocarcinoma via TMDD1-mediated ferroptosis induction and iron-sulfur cluster inhibition.",
      "journal": "Cancer letters",
      "pubdate": "2025-12-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": "SJR",
      "metric_value": 2.756,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40975161/",
      "url_doi": "https://doi.org/10.1016/j.canlet.2025.218046",
      "abstract": "Dysregulated ISC metabolism has been implicated in cancer progression, but its role in LUAD pathogenesis and therapeutic targeting remains poorly understood. Here, we demonstrate that ISC biogenesis is significantly upregulated in LUAD, driven by transcription factors KLF15 and ZNF384, which activate GLRX5, LYRM4, NFS1 and BOLA3 promoters. IL-1β promotes PCAF mitochondrial translocation, releasing EP300 to amplify KLF15/ZNF384-mediated transcriptional activation. The natural monoterpenoid Hinokitiol inhibits LUAD growth by disrupting EP300-KLF15/ZNF384 interactions, suppressing ISC biogenesis gene expression and inducing ferroptosis. Mechanistically, the membrane protein TMDD1, particularly its cytoplasmic domain, promotes Hinokitiol's anti-tumor effects by facilitating EP300-KLF15/ZNF384 dissociation and inhibiting ISC biogenesis. Remarkably, Hinokitiol exhibits stage-dependent efficacy, with superior suppression of metastatic (stage IV) tumors linked to heightened ferroptosis sensitivity. This study not only elucidates the transcriptional machinery governing ISC biogenesis in LUAD but also highlights Hinokitiol's dual mechanism as a promising stage-specific therapeutic agent, offering novel strategies for advanced disease management."
    },
    {
      "pmid": "40189749",
      "doi": "10.1080/2162402X.2025.2484880",
      "title": "Surrogate markers of intestinal dysfunction associated with survival in advanced cancers.",
      "journal": "Oncoimmunology",
      "pubdate": "2025-12-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://doi.org/10.1080/2162402x.2025.2484880",
      "metric_name": "SJR",
      "metric_value": 2.542,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40189749/",
      "url_doi": "https://doi.org/10.1080/2162402X.2025.2484880",
      "abstract": "Deviations in the diversity and composition of the gut microbiota are called \"gut dysbiosis\". They have been linked to various chronic diseases including cancers and resistance to immunotherapy. Stool shotgun based-metagenomics informs on the ecological composition of the gut microbiota and the prevalence of homeostatic bacteria such as"
    },
    {
      "pmid": "40650354",
      "doi": "10.1002/ijc.70045",
      "title": "Stage- and histology-specific sensitivity for the detection of lung cancer of the NELSON screening protocol-A modeling study.",
      "journal": "International journal of cancer",
      "pubdate": "2025-12-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://onlinelibrary.wiley.com/doi/pdfdirect/10.1002/ijc.70045",
      "metric_name": "SJR",
      "metric_value": 2.252,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40650354/",
      "url_doi": "https://doi.org/10.1002/ijc.70045",
      "abstract": "The Dutch-Belgian lung cancer (LC) screening trial (Nederlands-Leuvens Longkanker Screenings Onderzoek [NELSON]) demonstrated low-dose computed tomography (CT) reduces LC mortality by 24% among men. The NELSON protocol differed from previous trials in the eligibility criteria, the use of volume-based nodule management, and increasing screening intervals. The early-stage sensitivity of the protocol is pivotal in determining the optimal screening strategy, such as the interval and age range. The MIcrosimulation SCreening ANalysis-Lung natural history model was used to reproduce LC incidence and mortality by detection method (clinical or screen-detected), sex, histology, and stage in the NELSON trial based on individual-level data. We evaluated screening effectiveness by stage and histology, accounting for population characteristics, trial design, and LC epidemiology. We find stage IA non-small cell LC (NSCLC) sensitivity of 24.6% (other NSCLC) to 41.0% (adenocarcinoma) at baseline screening. At repeat screening rounds, we find this increased to 70.9% for stage IA adenocarcinoma. For stage IB, the sensitivity by histology ranges from 26.4% to 77.1%; for stage II, 39.6%-81.9%. Upon detection, the probability of LC mortality prevention is estimated at 83% for stage IA. The sensitivity for detecting early-stage LC is found to depend on the histology of cancer and is increased for adenocarcinoma at repeat screenings. Despite a low rate of referral to follow-up screening in the NELSON trial, early-stage CT sensitivity and the probability of mortality prevention were similar to previous estimates from the National Lung cancer Screening Trial. Previously demonstrated screening effectiveness may be maintained when implementing new programs, while reducing unnecessary follow-up when considering NELSON evidence."
    },
    {
      "pmid": "41130887",
      "doi": "10.1016/j.cllc.2025.09.013",
      "title": "Tumor-Agnostic Circulating Tumor DNA Analysis as a Comprehensive Predictive Biomarker of Recurrence after Ablative Radiotherapy for Early-Stage Non-Small Cell Lung Cancer.",
      "journal": "Clinical lung cancer",
      "pubdate": "2025-12-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": "SJR",
      "metric_value": 1.515,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41130887/",
      "url_doi": "https://doi.org/10.1016/j.cllc.2025.09.013",
      "abstract": "PURPOSE: This study aimed to evaluate whether pretreatment circulating tumor DNA (ctDNA) is a predictive biomarker for recurrence in patients with early-stage non-small cell lung cancer (ES-NSCLC), including those with pathologically unproven (PU) who received ablative radiotherapy.\n\nMATERIALS AND METHODS: Patients clinically diagnosed with cT1-2N0M0 NSCLC treated with radiotherapy alone at a single institute were included. Pretreatment plasma and matched white blood cell samples were subjected to targeted sequencing to detect ctDNA. The association between ctDNA detection and prognosis was evaluated. Integrated analysis including non-squamous cell carcinoma (SQ) cohort and enhancement of recurrence prediction with radiographic features were also evaluated.\n\nRESULTS: Of the 19 patients (10 SQ, and 9 PU) who met the sequence quality criteria, ctDNA was detected in 6. At the median follow-up of 60 months, detectable ctDNA was significantly associated with inferior progression-free survival (PFS) in both the SQ and PU cohorts (P = .01 and .02). In an analysis of 62 patients combined with the non-SQ cohort, ctDNA detection was the only significant factor for PFS. The combination of ctDNA and a high positron emission tomography maximum standardized uptake value provided a better recurrence risk model than ctDNA alone (the C-index improved from 0.63 to 0.72).\n\nCONCLUSION: These results suggest that pretreatment ctDNA detection can predict recurrence in patients with cT1-2N0M0 NSCLC, including those with PU tumors treated with ablative radiotherapy."
    },
    {
      "pmid": "41067998",
      "doi": "10.1016/j.cllc.2025.08.007",
      "title": "Central Nervous System Outcomes of Lazertinib Treatment in EGFR-Mutated Advanced NSCLC: Pooled Analysis From LASER201 and LASER301.",
      "journal": "Clinical lung cancer",
      "pubdate": "2025-12-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://doi.org/10.1016/j.cllc.2025.08.007",
      "metric_name": "SJR",
      "metric_value": 1.515,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41067998/",
      "url_doi": "https://doi.org/10.1016/j.cllc.2025.08.007",
      "abstract": "BACKGROUND: Lazertinib, a brain-penetrant, third-generation epidermal growth factor receptor (EGFR) tyrosine kinase inhibitor (TKI), significantly improved efficacy in patients with treatment-naïve, EGFR-mutated advanced non-small cell lung cancer (NSCLC) in the clinical trials, LASER201 and LASER301. This analysis evaluated the efficacy and safety of lazertinib in patients with EGFR-mutated NSCLC and CNS metastases using pooled data from LASER201 and LASER301.\n\nPATIENTS AND METHODS: Patients with treatment-naïve, EGFR-mutated advanced NSCLC and stable CNS metastases who were treated with lazertinib in a cohort of LASER201 and LASER301 were included. Intracranial progression-free survival (iPFS), intracranial objective response rate (iORR), intracranial disease control rate (iDCR), intracranial duration of response (iDoR), and treatment-emergent adverse events (TEAEs) were assessed.\n\nRESULTS: A total of 64 patients were included in the intracranial full analysis set (iFAS); 24 patients had at least 1 measurable CNS lesion at baseline. The median iPFS was 27.7 months (95% CI: 15.7-32.8) in the iFAS population. For patients with at least 1 measurable CNS lesion at baseline, iORR was 92% and iDCR was 96%. The median iDoR was 26.5 months (95% CI: 8.3-30.1). TEAEs were reported in 98% of patients in the iFAS population, with grade ≥3 TEAEs occurring in 55% of patients. The most common TEAEs were paresthesia (47%), rash (41%), and pruritus (36%).\n\nCONCLUSION: In this pooled analysis of LASER201 and LASER301, lazertinib demonstrated a clinically meaningful treatment benefit and consistent safety profile in patients with EGFR-mutated advanced NSCLC and CNS metastases."
    },
    {
      "pmid": "40973606",
      "doi": "10.1016/j.cllc.2025.08.012",
      "title": "A Phase 2 Study of Osimertinib in Combination With Platinum-Pemetrexed in Patients With Uncommon Epidermal Growth Factor Receptor-Mutated Advanced Non-Small Cell Lung Cancer (NEJ067/OPAL2).",
      "journal": "Clinical lung cancer",
      "pubdate": "2025-12-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": "SJR",
      "metric_value": 1.515,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40973606/",
      "url_doi": "https://doi.org/10.1016/j.cllc.2025.08.012",
      "abstract": "BACKGROUND: In treatment-naïve advanced non-small cell lung cancer (NSCLC) patients with epidermal growth factor receptor (EGFR) mutations, approximately 10% to 15% correspond to uncommon mutations. For patients with EGFR uncommon mutations, monotherapy with either a second-generation EGFR tyrosine kinase inhibitor (TKI), afatinib, or a third-generation EGFR-TKI, osimertinib, is recommended as the initial therapy. However, needs remain unmet for patients with central nervous system (CNS) metastases and those who do not respond adequately to single-agent TKI therapy for EGFR uncommon mutations. The recently published FLAURA2 trial showed that osimertinib in combination with platinum-pemetrexed significantly prolonged progression-free survival (PFS) and provided high disease control compared with osimertinib monotherapy for common mutations. Therefore, we planned this phase II study to evaluate the efficacy and safety of osimertinib in combination with platinum-pemetrexed in treatment-naïve NSCLC patients with EGFR uncommon mutations.\n\nPATIENTS AND METHODS: Forty patients will be enrolled in the study. The primary endpoint is the objective response rate, and the secondary endpoints include safety, PFS and overall survival in overall patients, patients with and without CNS lesions at baseline and according to mutation subtype.\n\nCONCLUSIONS: In this study, we will explore the efficacy and safety of osimertinib in combination with platinum-pemetrexed in treatment-naïve NSCLC patients with EGFR uncommon mutations. Our findings may provide treatment options for patients with EGFR uncommon mutations, especially those with CNS metastases or those requiring more intensive treatment."
    },
    {
      "pmid": "40887341",
      "doi": "10.1016/j.cllc.2025.08.001",
      "title": "Durvalumab Plus Platinum-Etoposide in Extensive-Stage Small-Cell Lung Cancer: Outcomes in Age, Sex, and Platinum Subgroups From the Phase 3 CASPIAN Study.",
      "journal": "Clinical lung cancer",
      "pubdate": "2025-12-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article",
        "Randomized Controlled Trial",
        "Multicenter Study"
      ],
      "entity": "Thoracic-other",
      "trial_type": "RCT",
      "study_class": "Prospective",
      "is_oa": true,
      "oa_url": "https://www.clinical-lung-cancer.com/article/S1525-7304(25)00164-0/pdf",
      "metric_name": "SJR",
      "metric_value": 1.515,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40887341/",
      "url_doi": "https://doi.org/10.1016/j.cllc.2025.08.001",
      "abstract": "INTRODUCTION: In the phase 3 CASPIAN study, first-line durvalumab plus etoposide combined with either carboplatin or cisplatin (EP) significantly improved overall survival (OS) versus EP alone in treatment-naïve extensive-stage small-cell lung cancer (ES-SCLC). We report exploratory subgroup analyses from CASPIAN.\n\nMETHODS: Patients with untreated ES-SCLC were randomized to durvalumab plus EP or EP alone. We analyzed OS and safety in subgroups defined by age, sex, and planned platinum agent, and patient-reported outcomes (PROs) by age.\n\nRESULTS: Of 537 patients (durvalumab plus EP: n = 268; EP alone: n = 269), 80.6% versus 19.4% were aged <70 versus ≥70 years; 69.6% versus 30.4% were male versus female; and planned platinum was cisplatin versus carboplatin in 25.1% versus 74.9%. The OS HRs for durvalumab plus EP versus EP were 0.71 (95% CI, 0.58-0.88) versus 0.74 (95% CI, 0.49-1.11) for patients aged <70 versus ≥70 years; 0.76 (95% CI, 0.62-0.95) versus 0.60 (95% CI, 0.42-0.84) for males versus females; and 0.65 (95% CI, 0.45-0.94) versus 0.74 (95% CI, 0.60-0.91) for planned cisplatin versus carboplatin. With durvalumab plus EP, rates of grade 3/4 adverse events (AEs) were similar across subgroups; serious AEs were more frequent in patients aged ≥70 versus <70 years; and immune-mediated AEs were more common in females versus males. Adding durvalumab to EP had no detrimental effect on PROs in either age subgroup.\n\nCONCLUSIONS: These findings support the use of durvalumab plus EP as first-line standard of care for ES-SCLC. Additional trials focused on elderly populations would be informative."
    },
    {
      "pmid": "40946254",
      "doi": "10.1007/s40487-025-00378-8",
      "title": "First-Line Tislelizumab Plus Chemotherapy in Advanced Non-Squamous Non-Small Cell Lung Cancer: PD-L1 ≥ 50% Subgroup Analysis from the RATIONALE-304 Trial.",
      "journal": "Oncology and therapy",
      "pubdate": "2025-12-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Preclinical",
      "is_oa": true,
      "oa_url": "https://doi.org/10.1007/s40487-025-00378-8",
      "metric_name": "SJR",
      "metric_value": 1.33,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40946254/",
      "url_doi": "https://doi.org/10.1007/s40487-025-00378-8",
      "abstract": "INTRODUCTION: RATIONALE-304 compared first-line tislelizumab (a programmed cell death protein 1 inhibitor) plus chemotherapy versus chemotherapy in advanced non-squamous non-small cell lung cancer (nsq-NSCLC). This exploratory analysis focused on patients with tumor cell programmed death ligand 1 (PD-L1) expression ≥ 50%.\n\nMETHODS: Patients with stage IIIB/IV nsq-NSCLC were randomized (2:1) to tislelizumab plus platinum-based chemotherapy and pemetrexed every 3 weeks, followed by maintenance tislelizumab and pemetrexed, or platinum-based chemotherapy and pemetrexed followed by maintenance pemetrexed. The primary endpoint was independent review committee (IRC)-assessed progression-free survival (PFS); secondary endpoints included overall survival (OS), IRC-assessed objective response rates, and safety.\n\nRESULTS: The PD-L1 ≥ 50% population included 110 patients (tislelizumab plus chemotherapy, n = 74; chemotherapy, n = 36); 71.8% (n = 79) were male and 28.2% (n = 31) were female. Consistent with the final analysis (median follow-up 16.5 months), the 4-year follow-up data (median follow-up 23.4 months) continued to show an improvement in median PFS (17.2 vs. 4.6 months; stratified HR 0.29, 95% CI 0.17-0.50) and median OS (41.9 vs. 13.1 months; stratified HR 0.38, 95% CI 0.23-0.62) for patients who received tislelizumab plus chemotherapy versus chemotherapy. An additional post hoc analysis showed no significant differences in PFS or OS between PD-L1 50-89% and ≥ 90% subgroups in the tislelizumab plus chemotherapy arm. The safety profile of tislelizumab plus chemotherapy was manageable and consistent with previous analyses.\n\nCONCLUSIONS: In patients with advanced nsq-NSCLC and PD-L1 tumor cell expression ≥ 50%, first-line tislelizumab plus chemotherapy demonstrated clinically meaningful improvement in PFS and OS versus chemotherapy. Efficacy was consistent across subgroups of patients with high PD-L1 tumor cell expression levels (50-89% and ≥ 90%).\n\nTRIAL REGISTRATION: Clinical Trials.gov NCT03663205."
    },
    {
      "pmid": "40908346",
      "doi": "10.1007/s40487-025-00372-0",
      "title": "Asian Subgroup Analysis of Patients in the Phase 2 DeLLphi-301 Study of Tarlatamab for Previously Treated Small Cell Lung Cancer.",
      "journal": "Oncology and therapy",
      "pubdate": "2025-12-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "SCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://link.springer.com/content/pdf/10.1007/s40487-025-00372-0.pdf",
      "metric_name": "SJR",
      "metric_value": 1.33,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40908346/",
      "url_doi": "https://doi.org/10.1007/s40487-025-00372-0",
      "abstract": "INTRODUCTION: Tarlatamab is a bispecific T-cell engager (BiTE\n\nMETHODS: Patients with previously treated, advanced SCLC received 10 mg tarlatamab every 2 weeks. The primary endpoint was objective response rate (ORR) by blinded independent central review (RECIST version 1.1). Key secondary endpoints included duration of response (DOR), progression-free survival (PFS), overall survival (OS) and safety. The present analysis includes patients enrolled at sites in Asia.\n\nRESULTS: A total of 43 patients were enrolled at sites in Asia. ORR was 46.3% (95% confidence interval [CI], 30.7-62.6) and median DOR was 7.2 months (95% CI 3.9 to not estimable). The median follow-up was 16.6 months for PFS and 21.2 months for OS. Median PFS was 5.4 months (95% CI 3.0-8.1) and median OS was 19.0 months (95% CI 11.4 to not estimable). The most common treatment-emergent adverse event (AE) was cytokine release syndrome (48.8%), and all such events were grade 1 or 2. There were no discontinuations due to treatment-related AEs.\n\nCONCLUSIONS: Tarlatamab demonstrated durable responses and promising survival outcomes with a manageable safety profile in this post hoc analysis of patients from Asia with previously treated SCLC.\n\nTRIAL REGISTRATION: ClinicalTrials.gov, NCT05060016."
    },
    {
      "pmid": "41296193",
      "doi": "10.1007/s40487-025-00402-x",
      "title": "Exploratory Analyses of Patient Preferences for Atezolizumab Subcutaneous Versus Intravenous from the IMscin002 Study in Patients with Non-Small Cell Lung Cancer.",
      "journal": "Oncology and therapy",
      "pubdate": "2025-11-26T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Preclinical",
      "is_oa": true,
      "oa_url": "https://link.springer.com/content/pdf/10.1007/s40487-025-00402-x.pdf",
      "metric_name": "SJR",
      "metric_value": 1.33,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41296193/",
      "url_doi": "https://doi.org/10.1007/s40487-025-00402-x",
      "abstract": "INTRODUCTION: The primary analysis of IMscin002 (NCT05171777) demonstrated that most patients preferred atezolizumab subcutaneous (SC) administration over intravenous (IV) administration; we report patient preference according to baseline characteristics, mean injection duration, and cumulative number of SC injections at each center from IMscin002.\n\nMETHODS: In this phase 2, randomized, open-label, crossover trial, patients aged ≥18 years, with EGFR/ALK wild-type tumors and either PD-L1+ (≥ 1%) resected non-small cell lung cancer (NSCLC) (stage 2, 3a, or selected 3b; AJCC 8th edition) with prior chemotherapy and no evidence of recurrence, or untreated PD-L1-high (≥ 50%) stage 4 NSCLC were eligible. Patients, randomized 1:1, received atezolizumab IV or SC for three cycles before switching to the alternative formulation for another three cycles. Patients chose a formulation for the continuation period after cycle 6.\n\nPRIMARY ENDPOINT: patient preference for atezolizumab SC/IV.\n\nRESULTS: Among 179 patients randomized, demographics and characteristics were generally balanced between arms. Overall, 87/123 patients (70.7%) preferred atezolizumab SC, of whom 86.2% had a very/fairly strong preference compared with 69.2% of patients who preferred IV (n = 26/123, 21.1%). Patient preference for atezolizumab SC was independent of baseline characteristics and mean injection duration. A higher proportion of preference was seen in patients aged > 74 years (87.5%). A trend for a greater number of patients preferring atezolizumab SC over IV was seen in patients at centers where a higher number of cumulative injections (> 47 to ≤ 164) were administered before preference disclosure.\n\nCONCLUSIONS: Most patients preferred atezolizumab SC regardless of baseline characteristics, mean injection duration, and cumulative number of SC injections. The trend for a stronger preference was higher among patients who preferred SC than those who preferred IV. Our findings suggest that the proportion of preference for atezolizumab SC over IV is highest in patients aged > 74 years, and that administrator's experience could be an important factor influencing patient preference.\n\nCLINICAL TRIAL REGISTRATION NUMBER: NCT05171777."
    },
    {
      "pmid": "41116141",
      "doi": "10.1007/s12325-025-03365-7",
      "title": "A Time and Motion Study Comparing Subcutaneous Pembrolizumab Versus Intravenous Pembrolizumab in Combination with Chemotherapy for the Treatment of Metastatic Non-small Cell Lung Cancer.",
      "journal": "Advances in therapy",
      "pubdate": "2025-12-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article",
        "Multicenter Study",
        "Randomized Controlled Trial"
      ],
      "entity": "NSCLC",
      "trial_type": "RCT",
      "study_class": "Prospective",
      "is_oa": true,
      "oa_url": "https://link.springer.com/content/pdf/10.1007/s12325-025-03365-7.pdf",
      "metric_name": "SJR",
      "metric_value": 1.236,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41116141/",
      "url_doi": "https://doi.org/10.1007/s12325-025-03365-7",
      "abstract": "INTRODUCTION: Subcutaneous (SC) formulations of oncology therapies could provide time-saving benefits for both patients and healthcare professionals (HCPs) compared with intravenous (IV) delivery. This prospective observational study, conducted alongside the MK-3475A-D77 phase 3, open-label randomized clinical trial, quantifies HCP and patient time with pembrolizumab SC versus pembrolizumab IV among patients with metastatic non-small cell lung cancer.\n\nMETHODS: Seventeen sites across eight countries in Europe (n = 4), South America (n = 3), and Asia (n = 1) were enrolled. Primary endpoints were active HCP time; patient time in the treatment chair, treatment room, and healthcare facility; and consumables usage. Descriptive statistics included weighted mean (WM), and a linear mixed model (LMM) was employed to explore differences in time measures between pembrolizumab SC and pembrolizumab IV per visit.\n\nRESULTS: Overall, 212 observations were analyzed (153 SC and 59 IV). Total active HCP time was reduced by 45.6% with SC versus IV (WM, 14.0 vs 25.8 min); HCPs spent 44.3% less time on the drug preparation process with SC versus IV (WM, 5.1 vs 9.1 min) and 46.3% less time on the drug administration process with SC versus IV (WM, 8.9 vs 16.7 min). Patient chair time was reduced by 49.6% with SC versus IV (WM, 59.0 vs 117.2 min). Patients receiving SC spent less time in the treatment room than those receiving IV (WM, 66.7 vs 126.9 min; difference - 47.4%). Exploratory LMM showed considerable between-group differences for active HCP time and patient time in the treatment chair and treatment room.\n\nCONCLUSION: Pembrolizumab SC substantially reduces active HCP time and patient chair time versus pembrolizumab IV. Time liberated for HCPs could be reallocated toward additional patient care activities, while optimized chair utilization could improve overall healthcare efficiency."
    },
    {
      "pmid": "41237754",
      "doi": "10.1016/j.thromres.2025.109525",
      "title": "Venous thrombosis in lung cancer compared with other tumors: results from the TESEO-SEOM registry.",
      "journal": "Thrombosis research",
      "pubdate": "2025-12-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article",
        "Multicenter Study"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": "SJR",
      "metric_value": 0.972,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41237754/",
      "url_doi": "https://doi.org/10.1016/j.thromres.2025.109525",
      "abstract": "BACKGROUND: Cancer-associated venous thromboembolism (VTE) is a major adverse prognostic factor with heterogeneous outcomes across tumor types. We aimed to describe the characteristics of lung cancer patients with VTE, compare outcomes across malignancies, and assess their association with complications, progression, and survival.\n\nMETHODS: We analyzed TESEO-SEOM, a prospective multicenter registry including patients with active cancer and VTE. Patients were stratified by tumor site, with lung as reference. Outcomes included recurrent VTE, bleeding, and survival. Analyses were stratified by tumor type and VTE presentation (clinically suspected, symptomatic/asymptomatic incidental). Complications were estimated using competing-risk methods.\n\nRESULTS: Among 3855 patients, the most frequent cancers were gastrointestinal (39.4 %), lung (22.2 %), and breast (10.4 %). Pulmonary embolism predominated (55 %), especially in lung cancer (69.8 %). Overall, 48.9 % of events were clinically suspected and 50.9 % incidental; suspected were more common in lung cancer (53.9 %), whereas incidental diagnoses predominated in gastrointestinal tumors (58.8 %). Complications occurred in 17.6 % (10.2 % bleeding, 7.4 % recurrent VTE). Recurrence was highest in gastrointestinal cancers (11.4 %, Gray's p = 0.022), while bleeding did not differ (p = 0.213). VTE-related mortality was low (1 %), while mixed-cause mortality was highest in lung cancer (17.2 %). Median PFS and OS were shortest in lung cancer (4.5 and 7.7 months, p < 0.0001). Incidental asymptomatic events conferred longer survival, particularly in lung cancer (OS 11.5 vs. 7.3 months for symptomatic incidental and 5.6 for suspected, p < 0.001).\n\nCONCLUSION: VTE in lung cancer is associated with more severe presentation, higher mixed-cause mortality, and worse survival than in other tumors. Incidental asymptomatic VTE predicts better outcomes, supporting risk stratification by tumor type and presentation."
    },
    {
      "pmid": "41288932",
      "doi": "10.1007/s10147-025-02929-5",
      "title": "Association of fat-free mass index and survival in patients with lung cancer: a multicenter cohort study.",
      "journal": "International journal of clinical oncology",
      "pubdate": "2025-11-25T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": "SJR",
      "metric_value": 0.936,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41288932/",
      "url_doi": "https://doi.org/10.1007/s10147-025-02929-5",
      "abstract": "BACKGROUND: Fat-free mass index (FFMI) is a prognostic influence in cancer patients. However, for the prognosis of Chinese lung cancer (LC) patients, the threshold and impact of FFMI are not known. The aim of the present study was to examine the association between FFMI and the prognosis of Chinese patients with LC.\n\nMETHODS: Totally 1,881 adult patients with LC were enrolled. During a median follow-up of 41.0 months (range 23.8-64.3), we reported 938 deaths. The optimal stratification method was used to determine the gender-specific optimal threshold for FFMI. Cox regression model and Kaplan-Meier curve were used to evaluate the relationship between FFMI and prognosis. Mediation analysis was used to determine the mediating effect of inflammation.\n\nRESULTS: The optimal cutoff points for low FFMI in males and females were 17.27 kg/m\n\nCONCLUSION: In this prospective study, low FFMI, as determined by cutoff values, was an independent prognostic factor for patients with LC in both males and females. The association between FFMI and LC prognosis was significantly mediated by NLR."
    },
    {
      "pmid": "41108995",
      "doi": "10.1016/j.suronc.2025.102309",
      "title": "Mediastinal staging with video-assisted mediastinoscopic lymphadenectomy after endobronchial ultrasound-guided transbronchial needle aspiration: real-world evidence in 228 patients.",
      "journal": "Surgical oncology",
      "pubdate": "2025-12-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Preclinical",
      "is_oa": false,
      "oa_url": null,
      "metric_name": "SJR",
      "metric_value": 0.792,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41108995/",
      "url_doi": "https://doi.org/10.1016/j.suronc.2025.102309",
      "abstract": "BACKGROUND: Accurate staging of mediastinal lymph nodes in patients with non-small-cell lung cancer (NSCLC) is essential to determine further management. Current guidelines recommend confirmatory mediastinoscopy for patients with suspicious mediastinal lymph node metastases in image-based staging but negative findings on endobronchial ultrasound-guided transbronchial needle aspiration (EBUS-TBNA). In clinical practice, adherence to these recommendations is low and many physicians omit invasive surgical staging. This study aimed to assess the results of subsequent video-assisted mediastinoscopic lymphadenectomy (VAMLA).\n\nMETHODS: Retrospective single-center cohort analysis of patients who underwent surgery between 2015 and 2019. All patients were diagnosed with potentially resectable lung cancer or FDG-avid pulmonary nodule suspicious for NSCLC and underwent VAMLA following N0-N2 EBUS-TBNA for mediastinal staging.\n\nRESULTS: VAMLA was performed in 228 patients. Nodal upstaging after EBUS-TBNA occurred in 17.5 % of the cases (n = 40). During EBUS-TBNA, 1.72 (±1.06) lymph node stations were sampled, compared to 5.59 (±1.1) resected stations in VAMLA (p < 0.001). Clinical nodal status staged by PET/CT was significantly correlated with the occurrence of nodal upstaging by VAMLA, with an odds ratio of 7.69 in cN2 and 5.88 in patients with cN3, compared to cN0. Complications occurred in 8 patients (3.59 %). VAMLA was false negative in 1 patient (0.4 %).\n\nCONCLUSION: Subsequent VAMLA enables the accurate staging of patients after negative EBUS-TBNA. Overall, 17.5 % of cases had nodal upstaging and would otherwise not have received guideline-compliant treatment for NSCLC. These results underline the role of surgical mediastinal staging after negative EBUS-TBNA in patients with suspicious radiologic findings."
    },
    {
      "pmid": "41217067",
      "doi": "10.1080/20565623.2025.2578145",
      "title": "Plain language summary of the ALINA study results: alectinib compared with chemotherapy after surgery in people with ALK-positive non-small cell lung cancer.",
      "journal": "Future science OA",
      "pubdate": "2025-12-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://doi.org/10.1080/20565623.2025.2578145",
      "metric_name": "SJR",
      "metric_value": 0.536,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41217067/",
      "url_doi": "https://doi.org/10.1080/20565623.2025.2578145",
      "abstract": null
    },
    {
      "pmid": "41205892",
      "doi": "10.1016/j.envpol.2025.127348",
      "title": "Association of radon exposure with lung cancer: serum biomarkers and computed tomography evidence from male miners.",
      "journal": "Environmental pollution (Barking, Essex : 1987)",
      "pubdate": "2026-01-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://doi.org/10.1016/j.envpol.2025.127348",
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41205892/",
      "url_doi": "https://doi.org/10.1016/j.envpol.2025.127348",
      "abstract": "The objective of this research is to investigate the association between occupational radon exposure and pulmonary health outcomes in male miners from Chongqing, China. Between June 2022 and December 2023, 110 miners were enrolled in this cross-sectional study. Personal radon exposure levels were measured using passive cumulative dosimeters, with pulmonary health assessed through radiologist-interpreted low-dose computed tomography (CT) scans and serum biomarker analysis (CEA, CYFRA21-1, NSE, and CA125) via ELISA. Multivariable analyses revealed strong dose-response relationships between radon exposure and both serum biomarkers and CT abnormalities. high radon exposure predicted substantial biomarker elevations including a 2.45-fold increase in CYFRA21-1 (β = 0.39, 95 % CI 0.25-0.54, p < 0.001), 1.60-fold increase in CEA (β = 0.20, 0.05-0.35, p = 0.008), and 3.58-fold increased CT abnormality risk (OR = 3.58, p = 0.023). Mediation analysis identified CYFRA21-1 as accounting for 69 % (p = 0.024) and CEA for 24.7 % (p = 0.036) of radon's effect on CT abnormalities. These findings demonstrate that occupational radon exposure contributes to pulmonary damage through both direct effects and biomarker-mediated pathways, with CYFRA21-1 and CEA emerging as potential early indicators of lung cancer in radon-exposed populations."
    },
    {
      "pmid": "41192233",
      "doi": "10.1016/j.ejca.2025.116059",
      "title": "EORTC 1417 - REACTION: A phase II study of etoposide and cis/carboplatin with or without pembrolizumab in untreated extensive small cell lung cancer.",
      "journal": "European journal of cancer (Oxford, England : 1990)",
      "pubdate": "2025-12-09T00:00:00+00:00",
      "pubtypes": [
        "Journal Article",
        "Randomized Controlled Trial",
        "Multicenter Study"
      ],
      "entity": "SCLC",
      "trial_type": "RCT",
      "study_class": "Prospective",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41192233/",
      "url_doi": "https://doi.org/10.1016/j.ejca.2025.116059",
      "abstract": "BACKGROUND: Anti-PD-L1 antibodies with platinum-etoposide extend overall survival (OS) of extensive disease Small Cell Lung Cancer (ED-SCLC) patients. We evaluated the benefit of first-line pembrolizumab with platinum-etoposide in chemo-sensitive ED-SCLC.\n\nMETHODS: REACTION is a multicenter, open-label, randomized phase II trial. Eligible patients (responders after 2 cycles of platinum-etoposide) were randomized 1:1 to experimental arm pembrolizumab in combination with 4 cycles of platinum-etoposide then pembrolizumab vs platinum-etoposide in the control arm. The primary endpoint was progression free survival (PFS). Circulating tumour cells (CTCs) were enumerated and their association with PFS and OS was investigated.\n\nRESULTS: Between Feb 7, 2018 and Oct 31, 2019, 125 patients were recruited (61 vs 64 experimental and control arms respectively) with 119 (58 vs 61) eligible and receiving at least one dose of treatment. Baseline characteristics were median age 65 vs 63.5 years, PS 1 (62 vs 60 %), and brain metastases (8 vs 11 %), in the experimental and control arms respectively. Amongst 124 patients who started treatment, 46 (37 %) experienced adverse events grade ≥ 3 for pembrolizumab arm vs 26 % in the control arm. Response rate was 61 % (67 vs 56 %). Median PFS (95 % CI) was 4.7 months (4.2, 5.6) vs 5.4 (4.7, 5.6), HR (80 % CI) = 0.84 (0.65, 1.09) and 1-sided p = 0.194. Median OS (95 % CI) was 12.3 months (8.9, 14.8) vs 10.4 (8.2, 12.2), HR (80 % CI) = 0.73 (0.54, 1.0) and 1-sided p = 0.097. CTC count per 7.5 ml blood at randomization was associated significantly with both PFS and OS regardless of treatment arms.\n\nCONCLUSIONS: Pembrolizumab added to platinum-etoposide did not improve PFS over platinum-etoposide alone in chemo-sensitive patients with ED."
    },
    {
      "pmid": "41232543",
      "doi": "10.1016/S1470-2045(25)00537-6",
      "title": "Defining eligibility for lung cancer screening based on individual risk.",
      "journal": "The Lancet. Oncology",
      "pubdate": "2025-12-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41232543/",
      "url_doi": "https://doi.org/10.1016/S1470-2045(25)00537-6",
      "abstract": null
    },
    {
      "pmid": "41232542",
      "doi": "10.1016/S1470-2045(25)00490-5",
      "title": "Effectiveness of NELSON versus PLCOm2012 lung cancer screening eligibility criteria in Germany (HANSE): a prospective cohort study.",
      "journal": "The Lancet. Oncology",
      "pubdate": "2025-12-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article",
        "Multicenter Study"
      ],
      "entity": "Thoracic-other",
      "trial_type": "Prospective (non-RCT)",
      "study_class": "Prospective",
      "is_oa": true,
      "oa_url": "https://doi.org/10.1016/s1470-2045(25)00490-5",
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41232542/",
      "url_doi": "https://doi.org/10.1016/S1470-2045(25)00490-5",
      "abstract": "BACKGROUND: Low-dose chest CT screening can reduce lung cancer mortality through early diagnosis. Several studies suggest that risk prediction models are more efficient than categorical age and smoking criteria for participant selection, but there are still reservations from policy makers about their implementation. We aimed to compare the effectiveness of a predefined PLCOm2012 model threshold with the categorical NELSON risk criteria.\n\nMETHODS: In this ongoing prospective cohort study, current or former smokers aged 55-79 years who met either NELSON risk criteria or had a PLCOm2012 6-year risk of at least 1·58% were recruited from three certified German lung cancer centres in Großhansdorf, Hannover, and Lübeck, and received low-dose CT at baseline and 1-year follow-up screening rounds, including all downstream follow-up procedures. The PLCOm2012 cutoff point of at least 1·58% was predefined and estimated to result in an equal group size as with the NELSON inclusion criteria. The primary outcome was the comparison of the positive predictive values for lung cancers detected in PLCOm2012-selected versus NELSON-selected groups. Here, we report the final results of the primary analysis. This study is registered with ClinicalTrials.gov, NCT04913155.\n\nFINDINGS: Between July 23, 2021, and Aug 19, 2022 (end of recruitment), 5191 participants (2208 [43·5%] female, 2983 [57·5%] male, and 5076 [97·8%] of European White ethnicity) who met either one or both high-risk criteria were enrolled (4167 PLCOm2012-selected vs 3916 NELSON-selected participants) and underwent the baseline low-dose CT scan. In the observation period between the two low-dose CT screening rounds (mean volume CT dose index 1·15 mGy [SD 0·15]) with a median time interval of 1·05 years (IQR 0·95-1·08), 111 lung cancers were detected. The positive predictive value (lung cancer detection rate) in the PLCOm2012-selected group was 108 of 4167 participants (2·59% [95% CI 2·13-3·12]) compared with 85 of 3916 participants (2·17% [1·74-2·68]) in the NELSON-selected group (p=0·0016), resulting in a lower number needed to screen (38·6 [32·1-46·9] vs 46·1 [37·3-57·5]).\n\nINTERPRETATION: Participant selection using the PLCOm2012 risk prediction model with a 6-year risk of at least 1·58% cutoff is more efficient and effective in detecting lung cancer than the NELSON criteria and should therefore be implemented in lung cancer screening programmes.\n\nFUNDING: Federal Ministry of Education and Research (German Center for Lung Research) and AstraZeneca."
    },
    {
      "pmid": "41033335",
      "doi": "10.1016/S2213-2600(25)00240-1",
      "title": "Durvalumab, carboplatin, and etoposide in patients who are treatment-naive with extensive-stage small-cell lung cancer and poor performance status (NEJ045A): a single-arm phase 2 trial.",
      "journal": "The Lancet. Respiratory medicine",
      "pubdate": "2025-12-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41033335/",
      "url_doi": "https://doi.org/10.1016/S2213-2600(25)00240-1",
      "abstract": "BACKGROUND: Treating patients with extensive-stage small-cell lung cancer (SCLC) with poor performance status poses considerable challenges. We aimed to evaluate the combination of an immune checkpoint inhibitor with platinum-based therapy in this population.\n\nMETHODS: This open-label, single-arm phase 2 NEJ045A trial enrolled untreated patients with extensive-stage SCLC with performance status 2 or 3. Participants received four cycles of durvalumab, carboplatin, and etoposide, followed by durvalumab maintenance. A dose adjustment strategy was used, with initial reductions in carboplatin-etoposide dosages, subsequently adjusted based on adverse events, allowing for potential escalation. The primary endpoint was tolerability, assessed by the proportion of patients completing induction therapy. A key secondary endpoint was 1-year survival rate. This trial is registered at the Japan Registry of Clinical Trials (jRCTs031200319) and has been completed.\n\nFINDINGS: Between April 8, 2021, and Oct 3, 2023, 57 patients (performance status 2 n=43 and performance status 3 n=14) were enrolled with a median age of 73·5 years (IQR 69·0-77·5), 44 (79%) of 56 were male. 26 (67%; 80% CI 55·2-76·7; p<0·0001) of 39 patients with performance status 2 and five (50%; 26·7-73·3; p=0·0088) of ten with performance status 3 completed induction therapy, exceeding the pre-specified threshold. Grade 3 or higher adverse events occurred in 52 (93%) of 56 patients, and 12 (21%) of 56 discontinued due to adverse events. The 1-year survival rates were 43·4% (80% CI 34·1-53·1) overall (p<0·0001), 50·0% (39·1-60·9) in performance status 2 (p<0·0001), and 18·2% (5·0-41·5) in performance status 3.\n\nINTERPRETATION: Durvalumab, carboplatin, and etoposide showed tolerability and promising efficacy as a first-line treatment for patients with untreated extensive-stage SCLC with poor performance status, supporting the integration of immune checkpoint inhibitors in this therapeutically challenging population.\n\nFUNDING: AstraZeneca KK."
    },
    {
      "pmid": "40983066",
      "doi": "10.1016/S2213-2600(25)00209-7",
      "title": "Retifanlimab versus placebo in combination with platinum-based chemotherapy in patients with first-line non-squamous or squamous metastatic non-small-cell lung cancer (POD1UM-304): a phase 3, multiregional, placebo-controlled, double-blind, randomised study.",
      "journal": "The Lancet. Respiratory medicine",
      "pubdate": "2025-12-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article",
        "Randomized Controlled Trial",
        "Multicenter Study"
      ],
      "entity": "Thoracic-other",
      "trial_type": "RCT",
      "study_class": "Prospective",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40983066/",
      "url_doi": "https://doi.org/10.1016/S2213-2600(25)00209-7",
      "abstract": "BACKGROUND: Checkpoint inhibitors, including combinations with standard-of-care chemotherapy, have shown survival benefit in patients with metastatic non-small-cell lung cancer (NSCLC); however, access to these drugs varies. We aimed to evaluate the efficacy of the PD-1 inhibitor retifanlimab plus platinum-based chemotherapy as first-line treatment for non-squamous or squamous metastatic NSCLC.\n\nMETHODS: POD1UM-304 was a phase 3, multiregional, placebo-controlled, double-blind, randomised study conducted in approximately 124 hospitals and private clinical centres in 16 countries. Male and female adults aged 18 years or older with squamous or non-squamous stage IV NSCLC (staging by American Joint Committee on Cancer version 8) with Eastern Cooperative Oncology Group performance status 0 or 1 and no previous systemic therapy for metastatic NSCLC were eligible. Patients were randomly assigned (2:1) using interactive response technology to receive intravenous retifanlimab 375 mg or matching placebo on day 1 of each 21-day cycle plus standard platinum-based chemotherapy according to tumour histology for up to 2 years. Patients with non-squamous NSCLC received pemetrexed 500 mg/m\n\nFINDINGS: Between Sept 11, 2020, and March 14, 2023, 1388 patients were assessed for eligibility, 583 of whom were randomly assigned to retifanlimab plus chemotherapy (n=391) or placebo plus chemotherapy (n=192). 381 (65%) patients had non-squamous NSCLC and 202 (35%) had squamous NSCLC; 467 (80%) patients were male and 116 (20%) were female. Median age was 64 years (IQR 58-68). Median overall survival was longer in the retifanlimab plus chemotherapy group than in the placebo plus chemotherapy group (18·1 months [95% CI 16·2-21·0] vs 13·4 months [11·0-16·7]; hazard ratio 0·75 [95% CI 0·60-0·93]; p=0·0042). Overall, higher incidences of treatment-emergent adverse events that were serious (158 [41%] of 389 vs 57 [30%] of 190), grade 3 or worse (238 [61%] vs 103 [54%]), or led to retifanlimab or placebo dose delay (169 [43%] vs 67 [35%]) or discontinuation (33 [8%] vs nine [5%]) were observed in the retifanlimab plus chemotherapy group than in the placebo plus chemotherapy group. The proportions of fatal COVID-19-related treatment-emergent adverse events were similar in the retifanlimab plus chemotherapy group and the placebo plus chemotherapy group (four [1%] vs five [3%]).\n\nINTERPRETATION: Retifanlimab improved overall survival compared with placebo when added to platinum-based chemotherapy, with a safety profile that is representative of previous PD-1 and PD-L1 inhibitor-chemotherapy combinations. Adding retifanlimab to first-line chemotherapy could be a potential treatment option for patients with squamous or non-squamous metastatic NSCLC.\n\nFUNDING: Incyte."
    },
    {
      "pmid": "41307293",
      "doi": "10.1002/14651858.CD004143.pub6",
      "title": "Long-term hormone therapy for perimenopausal and postmenopausal women.",
      "journal": "The Cochrane database of systematic reviews",
      "pubdate": "2025-11-27T00:00:00+00:00",
      "pubtypes": [
        "Journal Article",
        "Meta-Analysis",
        "Review"
      ],
      "entity": "Other",
      "trial_type": "Review/Meta",
      "study_class": "Review",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41307293/",
      "url_doi": "https://doi.org/10.1002/14651858.CD004143.pub6",
      "abstract": "BACKGROUND: Hormone therapy is widely provided to control menopausal symptoms and has been used for the management and prevention of cardiovascular disease, osteoporosis and dementia in older women. This is an updated version of a Cochrane review first published in 2005.\n\nOBJECTIVES: To assess the long-term effects of prolonged use (at least one year) of hormone therapy on mortality, cardiovascular outcomes, cancer, gallbladder disease, fractures and cognition in perimenopausal and postmenopausal women.\n\nSEARCH METHODS: We used the Cochrane Gynaecology and Fertility Group Specialised Register, CENTRAL, MEDLINE, three other databases and two trial registers, together with reference checking, citation searching and contact with study authors to identify the studies included in the review. The latest search date was 26 September 2024.\n\nSELECTION CRITERIA: We included randomised, double-blind trials in which peri- or postmenopausal women took hormone therapy or placebo for at least one year. We included various oestrogen formulations, with or without progestogens. We focused on studies assessing hormone therapy's effects on long-term clinical outcomes, including death, coronary events and cancer. Hormone therapy's efficacy in managing menopausal symptoms was beyond the scope of this review, and is assessed in other Cochrane reviews.\n\nDATA COLLECTION AND ANALYSIS: Two review authors independently selected studies, assessed risk of bias and extracted data. We calculated risk ratios (RRs) for dichotomous data and mean differences (MDs) for continuous data, along with 95% confidence intervals (CIs). We assessed the certainty of the evidence using GRADE.\n\nMAIN RESULTS: We included 24 studies - with two newly added in this update - involving 45,660 participants. We derived nearly 70% of the data from two well-conducted studies: the Heart and Estrogen/progestin Replacement Study (HERS 1998) and the large, multi-component Women's Health Initiative research programme, which included two hormone therapy arms (WHI 1998). Across all the studies, most participants were postmenopausal American women with one or more comorbidities. The mean participant age in most studies was over 60 years. Only one included study focused on perimenopausal women. We present full results for all included studies with available data in the main review. The results presented below are drawn from WHI 1998, in which the combined hormone therapy arm and the oestrogen-only arm were run concurrently, with women assigned to the appropriate trial based on their uterus status. One study with 16,608 postmenopausal women with an intact uterus compared combined continuous hormone therapy (conjugated equine oestrogen and medroxyprogesterone acetate) to placebo, and measured outcomes at an average of 5.6 years of follow-up. Based on this study, combined continuous hormone therapy probably makes little to no difference to the risk of a coronary event (RR 1.17, 95% CI 0.95 to 1.44; moderate-certainty evidence). It may increase the risk of stroke (RR 1.39, 95% CI 1.09 to 2.09; low-certainty evidence) and venous thromboembolism (RR 2.03, 95% CI 1.55 to 6.64; low-certainty evidence). Compared to placebo, combined continuous hormone therapy probably increases the risk of breast cancer (RR 1.27, 95% CI 1.03 to 1.56; moderate-certainty evidence) and probably makes little to no difference to the risk of lung cancer (RR 1.06, 95% CI 0.77 to 1.46; moderate-certainty evidence). It may increase gallbladder disease requiring surgery (RR 1.64, 95% CI 1.30 to 2.06; 14,203 participants; low-certainty evidence), and probably reduces the risk of all clinical fractures (RR 0.78, 95% CI 0.71 to 0.86; moderate-certainty evidence). One study including 10,739 postmenopausal women who had undergone a hysterectomy compared oestrogen-only (conjugated equine oestrogen) hormone therapy to placebo, and measured outcomes at an average of seven years' follow-up. Based on this study, oestrogen-only hormone therapy probably makes little to no difference to the risk of coronary events (RR 0.94, 95% CI 0.78 to 1.13), venous thromboembolism (RR 1.32, 95% CI 1.00 to 1.74) and breast cancer (RR 0.79, 95% CI 0.61 to 1.01), all with moderate-certainty evidence. It may make little to no difference to the risk of lung cancer (RR 1.04, 95% CI 0.73 to 1.48; low-certainty evidence). Oestrogen-only hormone therapy probably increases the risk of stroke (RR 1.33, 95% CI 1.06 to 1.67) and gallbladder disease requiring surgery (RR 1.78, 95% CI 1.42 to 2.24), and probably reduces the risk of all clinical fractures (RR 0.73, 95% CI 0.65 to 0.80), all with moderate-certainty evidence. We judged most included studies to have a low risk of bias for most domains. The overall certainty of evidence for the main comparisons was moderate. The main limitation was that only about 30% of women were 50 to 59 years old at baseline, the age group most likely to consider hormone therapy for vasomotor symptoms.\n\nAUTHORS' CONCLUSIONS: Long-term follow-up of women using hormone therapy suggests that the risk profiles vary between combined hormone therapy and oestrogen-only therapy. Oestrogen-only hormone therapy probably makes little to no difference to coronary events, and probably increases the risk of stroke and gallbladder disease. It probably makes little to no difference in the risk of breast cancer, and probably reduces the risk of all fractures. Combined hormone therapy may increase the risk of thromboembolism and probably increases the risk of breast cancer. These results should be interpreted with caution as they are based on one study using oral hormone therapy, which may not represent the risks of the hormone therapy currently used in clinical practice."
    },
    {
      "pmid": "41286347",
      "doi": "10.1038/s41598-025-29214-9",
      "title": "Modeling the metastatic tumor microenvironment: a co-culture platform of lung cancer and blood vessel organoids for drug evaluation.",
      "journal": "Scientific reports",
      "pubdate": "2025-11-24T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Preclinical",
      "is_oa": true,
      "oa_url": "https://doi.org/10.1038/s41598-025-29214-9",
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41286347/",
      "url_doi": "https://doi.org/10.1038/s41598-025-29214-9",
      "abstract": "Tumor cell-vasculature interactions play a crucial role in lung cancer progression and metastasis; however, traditional cell culture models rarely capture these complex dynamics. We developed a vascularized lung cancer organoid (VLCO) model by coculturing lung cancer organoids (LCOs) with blood vessel organoids (BVOs) to recreate the tumor-vasculature niche in a three-dimensional in vitro system. During coculture, LCOs migrated along BVO-formed vascular networks and invaded vessel-like structures, mimicking intravasation. The organoid types interacted via secretory factors, including TGF-β and PDGF-BB, inducing epithelial-mesenchymal transition (EMT) in LCOs and pericyte-to-fibroblast transition in BVOs. We also developed a scalable drug response assay for vasculature-induced EMT, enabling targeted therapeutic screening. The VLCO model provides a robust platform for studying tumor-endothelial crosstalk and testing antimetastatic therapies targeting tumor-vasculature interactions."
    }
  ]
}