{
  "generated": "2026-02-10T06:12:22.701088Z",
  "items": [
    {
      "pmid": "41650973",
      "doi": "10.1016/j.ccell.2026.01.005",
      "title": "Male-biased Yap1-Cd276/B7-H3 axis for immune evasion in medulloblastoma.",
      "journal": "Cancer cell",
      "pubdate": "2026-02-05T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": "SJR",
      "metric_value": 19.027,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41650973/",
      "url_doi": "https://doi.org/10.1016/j.ccell.2026.01.005",
      "abstract": "Molecular mechanisms underlying sex-specific differences in cancer incidence and therapy responses are under intense investigation. Here, we report sex-biased functions of Yap1 in multiple cancer types in human and mouse. Through integrated multi-omics analyses, we demonstrate that Yap1 deletion significantly extends survival in male but not female Sonic Hedgehog (SHH) medulloblastomas (MB) models. While Yap1 is required to maintain stem-like cells in both sexes, Yap1 plays a more critical role in immune evasion in males. Mechanistically, YAP1 is essential for activating Cd276/B7-H3 expression to mediate CD8"
    },
    {
      "pmid": "41645709",
      "doi": "10.1158/2159-8290.CD-25-2046",
      "title": "Clinical Validation of a Cell-Free DNA Fragmentome Assay for Augmentation of Lung Cancer Early Detection-Reply.",
      "journal": "Cancer discovery",
      "pubdate": "2026-02-06T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": "SJR",
      "metric_value": 7.283,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41645709/",
      "url_doi": "https://doi.org/10.1158/2159-8290.CD-25-2046",
      "abstract": null
    },
    {
      "pmid": "41645707",
      "doi": "10.1158/2159-8290.CD-24-1132",
      "title": "Clinical Validation of a Cell-Free DNA Fragmentome Assay for Augmentation of Lung Cancer Early Detection-Letter.",
      "journal": "Cancer discovery",
      "pubdate": "2026-02-06T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": "SJR",
      "metric_value": 7.283,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41645707/",
      "url_doi": "https://doi.org/10.1158/2159-8290.CD-24-1132",
      "abstract": null
    },
    {
      "pmid": "41637136",
      "doi": "10.1158/2159-8290.CD-RW2026-018",
      "title": "High-Plasticity Cell State Drives Lung Cancer Progression and Drug Resistance.",
      "journal": "Cancer discovery",
      "pubdate": "2026-02-04T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": "SJR",
      "metric_value": 7.283,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41637136/",
      "url_doi": "https://doi.org/10.1158/2159-8290.CD-RW2026-018",
      "abstract": null
    },
    {
      "pmid": "41637523",
      "doi": "10.1126/scitranslmed.adq6647",
      "title": "Kras G12C- and G12D-driven lung cancers differ in oncogenic potency, immunogenicity, and relapse after Kras inhibition in mouse models.",
      "journal": "Science translational medicine",
      "pubdate": "2026-02-04T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Preclinical",
      "is_oa": false,
      "oa_url": null,
      "metric_name": "SJR",
      "metric_value": 6.722,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41637523/",
      "url_doi": "https://doi.org/10.1126/scitranslmed.adq6647",
      "abstract": "The development of allele-specific KRAS inhibitors underscores the importance of understanding the distinct tumor biology associated with common"
    },
    {
      "pmid": "41661652",
      "doi": "10.1158/0008-5472.CAN-25-2764",
      "title": "The farnesyl transferase inhibitor darlifarnib (KO-2806) re-sensitizes relapsing tumors to RAS inhibition.",
      "journal": "Cancer research",
      "pubdate": "2026-02-09T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": "SJR",
      "metric_value": 3.879,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41661652/",
      "url_doi": "https://doi.org/10.1158/0008-5472.CAN-25-2764",
      "abstract": "Resistance remains a key issue limiting the clinical benefit from RAS-targeting therapeutic agents and necessitates combination approaches. Here, we identified persistent mTORC1 activity in preclinical KRAS-mutant non-small cell lung cancer (NSCLC) and colorectal cancer (CRC) models as a frequent, nongenetic driver of inherent and adaptive resistance to RAS inhibition. This vulnerability was targetable with the farnesyl transferase inhibitor darlifarnib (KO-2806), which blocks mTORC1 activation via RHEB while sparing mTORC2 to limit associated toxicities. The addition of KO-2806 to NSCLC or CRC tumors progressing on mutant-selective RAS inhibitors led to rapid and durable tumor regression. In contrast, switching from mutant-selective to pan-RAS inhibitor monotherapy resulted in only stasis of NSCLC tumors and had no effect on CRC tumor progression. Further, the addition of KO-2806 rescued sensitivity of progressing tumors to the pan-RAS inhibitor RMC-6236. These results establish mTORC1 as an important mediator of escape from RAS inhibition and highlight KO-2806 as a promising RAS companion inhibitor in patients with prior RAS inhibitor exposure."
    },
    {
      "pmid": "41419100",
      "doi": "10.1016/j.canlet.2025.218223",
      "title": "Consensus on the diagnosis and treatment of unresectable stage III driver gene-positive non-small cell lung cancer.",
      "journal": "Cancer letters",
      "pubdate": "2026-02-28T00:00:00+00:00",
      "pubtypes": [
        "Journal Article",
        "Review"
      ],
      "entity": "NSCLC",
      "trial_type": "Review/Meta",
      "study_class": "Review",
      "is_oa": false,
      "oa_url": null,
      "metric_name": "SJR",
      "metric_value": 2.756,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41419100/",
      "url_doi": "https://doi.org/10.1016/j.canlet.2025.218223",
      "abstract": "Unresectable stage III non-small cell lung cancer (NSCLC) exhibits substantial heterogeneity and complexity. The landmark LAURA and POLESTAR studies have established a standard therapeutic model involving targeted consolidation therapy with osimertinib or aumolertinib after definitive chemoradiotherapy for NSCLC patients harboring EGFR-sensitive mutations. However, treatment strategies for patients with other driver gene mutations (e.g., ALK fusions, ROS1 rearrangement) still lack robust support from high-level evidence-based medical study. To enhance the standardization of diagnosis and treatment for unresectable stage III driver-positive NSCLC patients, the Radiotherapy Committee of the Chinese Society of Clinical Oncology convened an expert working group. This group identified common clinical practice issues and conducted an in-depth, problem-oriented analysis of domestic and international guidelines alongside evidence-based medical data. Through multiple rounds of comprehensive discussion and expert voting, this consensus was jointly developed. It provides evidence-based recommendations addressing frequently encountered clinical questions regarding unresectable stage III driver-positive NSCLC, aiming to serve as a key reference for clinical practice."
    },
    {
      "pmid": "41427516",
      "doi": "10.1002/cpt.70146",
      "title": "Risk of Malignancies and Major Adverse Cardiovascular Events Related to JAK Inhibitors in Rheumatoid Arthritis: A Meta-Analysis.",
      "journal": "Clinical pharmacology and therapeutics",
      "pubdate": "2026-03-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article",
        "Meta-Analysis",
        "Review"
      ],
      "entity": "Other",
      "trial_type": "Review/Meta",
      "study_class": "Review",
      "is_oa": false,
      "oa_url": null,
      "metric_name": "SJR",
      "metric_value": 2.127,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41427516/",
      "url_doi": "https://doi.org/10.1002/cpt.70146",
      "abstract": "This meta-analysis evaluated the risk of malignancies and major adverse cardiovascular events (MACE) associated with the use of JAK inhibitors in patients with RA through a comprehensive meta-analysis of available clinical trials. A systematic search was conducted in PubMed, EMBASE, and Web of Science from inception to February 7, 2025, to identify relevant clinical trials. Data on malignancies and MACE incidence were extracted, and pooled risk ratios (RR) were calculated using a random-effects model. A total of 18 studies (N = 111,260) met the inclusion criteria. JAK inhibitors were associated with a significantly increased risk of malignancies excluding NMSC (RR = 1.30, 95%CI: 1.05, 1.60; P = 0.016), NMSC (RR = 1.54, 95%CI: 1.23, 1.93; P < 0.01), overall malignancies (RR = 1.53, 95%CI: 1.18, 2.00; P = 0.002), lung cancer (RR = 1.52, 95%CI: 1.11, 2.08; P = 0.009), lymphoma (RR = 3.69, 95%CI: 1.19, 11.42; P = 0.024), non-small cell lung cancer (RR = 1.70, 95%CI: 1.01, 2.86; P = 0.047), cutaneous squamous cell carcinoma (RR = 2.30, 95%CI: 1.44, 3.65; P < 0.01), and thyroid cancer (RR = 7.51, 95%CI: 1.39, 40.74; P = 0.019). In contrast, JAK inhibitors did not significantly alter the risk of MACE (RR = 0.75, 95%CI: 0.38, 1.45; P = 0.390), venous thromboembolism (VTE) (RR = 1.52, 95%CI: 0.90, 2.56; P = 0.117), or deep vein thrombosis (DVT) (RR = 1.77, 95%CI: 0.84, 3.34; P = 0.079). Trial sequential analysis (TSA) confirmed data adequacy, and meta-regression indicated that sample size, treatment duration, and patient age did not influence outcomes. JAK inhibitors are associated with an elevated risk of malignancies but do not significantly affect MACE, VTE, or DVT risk in RA patients. Further large-scale post-marketing surveillance is warranted to refine the safety profile of JAK inhibitors in RA management."
    },
    {
      "pmid": "41654892",
      "doi": "10.1186/s12967-026-07778-y",
      "title": "Multi-omics dynamic profiling reveals predictive biomarkers for first-line immunochemotherapy in extensive-stage small-cell lung cancer.",
      "journal": "Journal of translational medicine",
      "pubdate": "2026-02-07T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": "SJR",
      "metric_value": 1.997,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41654892/",
      "url_doi": "https://doi.org/10.1186/s12967-026-07778-y",
      "abstract": null
    },
    {
      "pmid": "41616709",
      "doi": "10.1016/j.compbiomed.2026.111501",
      "title": "Influence of CT harmonization in longitudinal radiomics for NSCLC immunotherapy response prediction.",
      "journal": "Computers in biology and medicine",
      "pubdate": "2026-02-15T00:00:00+00:00",
      "pubtypes": [
        "Journal Article",
        "Multicenter Study"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": "SJR",
      "metric_value": 1.447,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41616709/",
      "url_doi": "https://doi.org/10.1016/j.compbiomed.2026.111501",
      "abstract": "This study investigates the variability of radiomic features in longitudinal CT scans from a multi-institutional NSCLC cohort and introduces a harmonization pipeline to improve predictive modeling of immunotherapy response. Baseline and follow-up CT scans from NSCLC patients treated with anti-PD-1/PD-L1 agents were analyzed, with two institutions combined for model training and internal testing, and a third institution serving as an external test set. To address variability from imaging parameters-such as scanner manufacturer, slice thickness, and noise-we applied image harmonization followed by feature harmonization using NestedComBat. This approach substantially reduced feature dependence on acquisition confounders (from 78.8% to 12.8%) and improved feature robustness across institutions. We further assessed the temporal consistency of radiomic features across longitudinal scans using the intraclass correlation coefficient (ICC). Image harmonization yielded the largest gains in stability (mean ΔICC = +0.021, p < 0.001), while the combined approach also enhanced longitudinal reliability (ΔICC = +0.014, p < 0.001). Finally, harmonization improved predictive performance for 6-month immunotherapy response, increasing the AUC from 0.695 to 0.768 in the internal test and from 0.692 to 0.802 in the external test. These results demonstrate that combining image- and feature-level harmonization enhances the robustness and temporal consistency of radiomic features, potentially supporting more reliable and generalizable predictive modeling across diverse datasets and clinical settings."
    },
    {
      "pmid": "41593906",
      "doi": "10.1080/07853890.2026.2620201",
      "title": "Clinicopathological characteristics and therapeutic outcomes in patients with non-small cell lung cancer harboring SMARCA4 mutations.",
      "journal": "Annals of medicine",
      "pubdate": "2026-12-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://doi.org/10.1080/07853890.2026.2620201",
      "metric_name": "SJR",
      "metric_value": 1.204,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41593906/",
      "url_doi": "https://doi.org/10.1080/07853890.2026.2620201",
      "abstract": "OBJECTIVE: To investigate the clinical characteristics and impact of\n\nMETHODS: A total of 2,821 patients with NSCLC who underwent next-generation sequencing were retrospectively included. The frequency and types of"
    },
    {
      "pmid": "41640088",
      "doi": "10.1080/14737140.2026.2623059",
      "title": "The role of zongertinib, a highly selective tyrosine kinase inhibitor, in targeting HER2-mutant NSCLC: a bench-to-bedside review.",
      "journal": "Expert review of anticancer therapy",
      "pubdate": "2026-02-04T00:00:00+00:00",
      "pubtypes": [
        "Journal Article",
        "Review"
      ],
      "entity": "NSCLC",
      "trial_type": "Review/Meta",
      "study_class": "Review",
      "is_oa": false,
      "oa_url": null,
      "metric_name": "SJR",
      "metric_value": 0.926,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41640088/",
      "url_doi": "https://doi.org/10.1080/14737140.2026.2623059",
      "abstract": "INTRODUCTION: HER2 is mutated in 2-4% of non-small cell lung cancers (NSCLC) and is associated with poor prognosis. Tyrosine kinase inhibitors (TKIs) targeting HER2 have historically been hampered by insufficient efficacy against exon 20 insertion mutations and lack of specificity, resulting in off-target adverse events. Zongertinib is an oral, irreversible HER2-selective TKI that spares wild-type EGFR, thereby minimizing associated toxicities. Zongertinib was recently approved in the United States (accelerated), China (conditional), and Japan for patients with previously treated advanced HER2-mutant NSCLC.\n\nAREAS COVERED: This article outlines the discovery and clinical development of zongertinib that led to these approvals. We discuss the first-in-human Beamion LUNG-1 trial (NCT04886804), in which zongertinib demonstrated encouraging and durable activity, with a manageable safety profile, in patients with HER2-mutant advanced NSCLC. Finally, we summarize ongoing clinical trials of zongertinib, including its assessment as first-line treatment for advanced HER2-mutant NSCLC.\n\nEXPERT OPINION: Zongertinib is the first oral TKI approved for HER2-mutant NSCLC and will provide patients with a convenient, tolerable and effective treatment option in an area of significant unmet need. Next steps include its potential transition to a first-line setting, identification of additional indications, and development of novel combination regimens."
    },
    {
      "pmid": "41499719",
      "doi": "10.1200/JCO-25-03012",
      "title": "Erratum: Simultaneous Durvalumab and Platinum-Based Chemoradiotherapy in Unresectable Stage III Non-Small Cell Lung Cancer: The Phase III PACIFIC-2 Study.",
      "journal": "Journal of clinical oncology : official journal of the American Society of Clinical Oncology",
      "pubdate": "2026-02-10T00:00:00+00:00",
      "pubtypes": [
        "Journal Article",
        "Published Erratum"
      ],
      "entity": "NSCLC",
      "trial_type": "Phase III",
      "study_class": "Prospective",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41499719/",
      "url_doi": "https://doi.org/10.1200/JCO-25-03012",
      "abstract": null
    },
    {
      "pmid": "41654519",
      "doi": "10.1038/s41467-026-69216-3",
      "title": "Pan-RAF inhibitor exarafenib targets BRAF class II/III NSCLC and reveals ARAF-KSR1 resistance and combination strategies.",
      "journal": "Nature communications",
      "pubdate": "2026-02-07T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Preclinical",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41654519/",
      "url_doi": "https://doi.org/10.1038/s41467-026-69216-3",
      "abstract": "Oncogenic BRAF mutations, including those in non-small cell lung cancer (NSCLC), are classified as Class I, II, or III. While approved therapies exist for BRAF Class I mutants, no approved therapies exist for Class II and III BRAF-mutated NSCLC. Analysis of a circulating tumor DNA database reveals Class II and III mutations comprise ~65% of BRAF-mutant NSCLC cases, with Class II patients showing worse outcomes than Class I. Exarafenib, a distinct pan-RAF inhibitor, demonstrates potent activity against BRAF Class II and III mutant preclinical models and initial clinical activity. Resistance studies reveal rewiring to an ARAF-mediated bypass pathway, characterized by RAS-mediated ARAF-KSR1 complexes maintaining MAPK signaling despite pan-RAF inhibitor treatment. RAS or MEK inhibition co-targeting is effective against this resistance mechanism. This study provides preclinical rationale for clinical testing of exarafenib in BRAF Class II/III cancers and unveils RAS-mediated ARAF-KSR1 complex formation as a resistance mechanism and rational co-therapy strategies."
    },
    {
      "pmid": "41649868",
      "doi": "10.1158/1078-0432.CCR-25-3720",
      "title": "JIN-A02, a Mutant-Selective Fourth-Generation EGFR inhibitor, Overcomes C797S-Mediated Resistance and Demonstrates Intracranial Activity in NSCLC.",
      "journal": "Clinical cancer research : an official journal of the American Association for Cancer Research",
      "pubdate": "2026-02-06T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Preclinical",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41649868/",
      "url_doi": "https://doi.org/10.1158/1078-0432.CCR-25-3720",
      "abstract": "PURPOSE: Epidermal growth factor receptor tyrosine kinase inhibitors (EGFR-TKIs) have revolutionized the treatment of non-small cell lung cancer (NSCLC) with activating EGFR mutations. However, acquired resistance-particularly the EGFR_C797S mutation-remains a major clinical challenge. As no approved targeted therapies are available following disease progression on the third-generation EGFR-TKI osimertinib, this study aimed to evaluate JIN-A02, a novel fourth-generation EGFR-TKI, as a therapeutic strategy to overcome C797S-mediated resistance.\n\nMETHODS: JIN-A02, a fourth-generation EGFR-TKI, was evaluated for its antitumor efficacy and blood-brain barrier penetration in in vitro and in vivo models of NSCLC harboring EGFR_C797S and T790M mutations.\n\nRESULTS: JIN-A02 demonstrated potent antiproliferative activity in preclinical NSCLC models harboring EGFR_C797S and T790M mutations, with superior inhibition of EGFR signaling compared to osimertinib. In both subcutaneous and orthotopic intracranial xenograft models, JIN-A02 elicited substantial tumor regression, indicating robust in vivo efficacy. The agent was well tolerated throughout the treatment period without notable toxicity. In line with preclinical data, early clinical trial data showed signs of efficacy including 3 patients showing partial response.\n\nCONCLUSION: These findings highlight JIN-A02 as a promising therapeutic strategy to overcome C797S- and T790M-mediated resistance in EGFR-mutant NSCLC, including intracranial disease, and support its further clinical development."
    },
    {
      "pmid": "41650357",
      "doi": "10.1200/JCO-26-00221",
      "title": "Erratum: BR.31 Trial: Adjuvant Durvalumab as the Third Contender in Resected Non-Small Cell Lung Cancer.",
      "journal": "Journal of clinical oncology : official journal of the American Society of Clinical Oncology",
      "pubdate": "2026-02-06T00:00:00+00:00",
      "pubtypes": [
        "Journal Article",
        "Published Erratum"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Preclinical",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41650357/",
      "url_doi": "https://doi.org/10.1200/JCO-26-00221",
      "abstract": null
    },
    {
      "pmid": "41637511",
      "doi": "10.1126/sciadv.adu0690",
      "title": "Discovery and preclinical evaluation of monoclonal antibodies and bispecific engagers targeting the NKG2A inhibitory receptor.",
      "journal": "Science advances",
      "pubdate": "2026-02-06T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Other",
      "trial_type": null,
      "study_class": "Preclinical",
      "is_oa": true,
      "oa_url": "https://doi.org/10.1126/sciadv.adu0690",
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41637511/",
      "url_doi": "https://doi.org/10.1126/sciadv.adu0690",
      "abstract": "NK and T cells are key effectors that eliminate cancer cells, but upregulation of the inhibitory receptor NKG2A on these cells attenuates antitumor immune responses. To counteract NKG2A inhibitory signaling, we identified two specific fully human monoclonal anti-NKG2A antibodies that block HLA-E ligand binding. These antibodies activated NK cells and enhanced antibody-dependent cellular cytotoxicity of tumor-targeting IgG1s both in vitro and in vivo. Bispecific engagers (BiNKs), generated by fusing NKG2A antibodies with tumor targeting binders, promoted immune synapse formation and directed cytotoxicity of NK and CD8"
    },
    {
      "pmid": "41639167",
      "doi": "10.1038/s41598-026-36712-x",
      "title": "Can evolutionary therapy be applied in non-small cell lung cancer?",
      "journal": "Scientific reports",
      "pubdate": "2026-02-05T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://www.nature.com/articles/s41598-026-36712-x_reference.pdf",
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41639167/",
      "url_doi": "https://doi.org/10.1038/s41598-026-36712-x",
      "abstract": "Evolutionary therapy (ET) applies principles of evolutionary biology to steer tumour dynamics and forestall or delay treatment resistance, typically guided by data-driven mathematical models. Our aim is to assess whether ET protocols, and specifically Zhang et al.'s protocol proposed for metastatic castrate-resistant prostate cancer, can be theoretically effective for fast-growing metastatic cancers such as stage IV non-small-cell lung cancer (NSCLC). Using longitudinal tumour-burden data from NSCLC patients treated with erlotinib, we systematically evaluate 26 two-population differential-equation models based on classical tumour-growth dynamics, with varying assumptions about density- and frequency-dependent interactions, pharmacokinetics, and treatment-induced death. Previous work by Yin et al. on the same dataset employed an exponential model that omitted density- and frequency-dependent interactions; although it provided a good fit to tumour-burden data, its structure would theoretically lead to poorer outcomes under ET protocols. In contrast, our analysis identifies the minimal model structure required to reproduce the resistance-driven regrowth observed in NSCLC, with the Gompertzian model featuring log-kill dynamics and both density- and frequency-dependent interactions providing the best fit. In this model, Zhang et al.'s protocol prolonged median time-to-progression to 42.3 months compared with 24.8 months under maximum tolerated dose. These results indicate that ET is theoretically a viable treatment strategy for NSCLC. This study offers a practical framework for assessing ET feasibility using clinical data and supports future clinical translation of ET in NSCLC."
    },
    {
      "pmid": "41475048",
      "doi": "10.1016/j.ejca.2025.116191",
      "title": "Braf-mutant metastatic non-small-cell lung cancer: Real world data from the Italian biomarker atlas database.",
      "journal": "European journal of cancer (Oxford, England : 1990)",
      "pubdate": "2026-02-05T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://doi.org/10.1016/j.ejca.2025.116191",
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41475048/",
      "url_doi": "https://doi.org/10.1016/j.ejca.2025.116191",
      "abstract": "BACKGROUND: BRAF mutations identify a small subgroup of patients (pts) with non-small cell lung cancer (NSCLC). Dabrafenib/trametinib (D/T) combination is associated with high response rates and durable anti-tumor activity in BRAF-V600-mutants. Several open questions still remain unanswered in clinical practice, including the efficacy of treatments based on clinical and molecular characteristics, the activity in patients with brain metastases, the optimal sequence with immunotherapy-based therapies. Here we present outcomes among advanced BRAF-mutant NSCLC patients from the Italian ATLAS registry.\n\nMETHODS: Patients with metastatic BRAF-mutated NSCLC were included. Clinical-pathological features, treatment effectiveness and safety outcomes were retrospectively collected from the Italian real-world ATLAS registry.\n\nRESULTS: A total of 244 BRAF-mutated NSCLC pts were enrolled, including 70 % V600E mutations. The median PFS of first line D/T was 19.8 months (95 % CI: 10.7-29.0), with a 2-year OS rate of 65.4 % and a PFS2 of 6.6 months (95 % CI: 0-14.3). The activity of D/T differs among sex (mPFS was 13.6 mos and 25.3 mos and 2-yr OS rate were 54.9 % and 72.3 % in males and females, respectively) and smoking status (mPFS was 18.4 mos, 25.6 mos and 24 mos in never, former and current smokers, respectively). Concomitant MET amplification was associated with a shorter median PFS (mPFS was 13.6 mos vs. 44.3 mos with and without MET amplification respectively) in pts treated with D/T as 1st line.\n\nCONCLUSIONS: These data confirm the efficacy and safety of first line D/T in BRAF V600E-mutated pts in the real-world setting consistently with prior studies, suggesting a differential activity among key clinical-molecular subgroups."
    }
  ]
}