{
  "generated": "2025-12-19T05:20:29.231234Z",
  "items": [
    {
      "pmid": "41411619",
      "doi": "10.1158/0008-5472.CAN-25-1483",
      "title": "Small Cell Lung Cancer Classification: Unraveling Heterogeneity to Enable Personalized Treatments.",
      "journal": "Cancer research",
      "pubdate": "2025-12-18T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "SCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": "SJR",
      "metric_value": 3.879,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41411619/",
      "url_doi": "https://doi.org/10.1158/0008-5472.CAN-25-1483",
      "abstract": "Small cell lung cancer (SCLC) is an aggressive thoracic disease characterized by rapid proliferation and early metastatic spread. The survival outcomes for SCLC patients remain notoriously poor, underlining that only modest improvements have been achieved in clinical settings to date. However, insights gained from human tumors and preclinical models in recent years have shed light on the heterogeneous molecular profile of SCLC. Numerous research groups have, therefore, begun to stratify SCLC into subgroups based on differential transcription factor expression, the tumor immune microenvironment, and other criteria. Since SCLC subtypes show major differences in their molecular landscape and biological behavior, they may offer unique therapeutic vulnerabilities and serve as a framework for future personalized clinical trials. Here, we summarize impactful classification attempts from the last ten years, highlighting discrepancies and connections between the nomenclature of each study, and expound upon relevant factors of SCLC biology influencing subtype composition and plasticity. This review delves into the implications of subgrouping for understanding and treating SCLC as well as potential future directions for SCLC research."
    },
    {
      "pmid": "41397256",
      "doi": "10.7326/ANNALS-25-00464",
      "title": "Eligibility and Prognostic Performance of Smoking Duration-Based Versus Pack-Year-Based U.S. National Lung Cancer Screening Criteria Across Racial and Ethnic Groups.",
      "journal": "Annals of internal medicine",
      "pubdate": "2025-12-16T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Preclinical",
      "is_oa": false,
      "oa_url": null,
      "metric_name": "SJR",
      "metric_value": 3.378,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41397256/",
      "url_doi": "https://doi.org/10.7326/ANNALS-25-00464",
      "abstract": "BACKGROUND: The U.S. Preventive Services Task Force expanded lung cancer (LC) screening eligibility in 2021 (USPSTF-2021) by decreasing the minimum number of smoking pack-years from 30 to 20. Underrepresented minorities still experience disparities in screening eligibility.\n\nOBJECTIVE: To evaluate screening eligibility and prognostic performance of alternative smoking duration-based criteria versus USPSTF-2021 (primary outcome) and risk-based screening using the recalibrated Prostate, Lung, Colorectal, and Ovarian Cancer Screening Trial 2012 (PLCOm2012\n\nDESIGN: Prospective, population-based Multiethnic Cohort linked to SEER (Surveillance, Epidemiology, and End Results) registries.\n\nSETTING: California and Hawai'i, with recruitment from 1993 to 1996.\n\nPARTICIPANTS: 105 261 adults aged 45 to 75 years with a history of smoking.\n\nMEASUREMENTS: Hypothetical eligibility and prognostic performance (sensitivity and specificity) in detecting 6-year LC.\n\nRESULTS: Under USPSTF-2021, 24.0% of the cohort would be eligible for screening; a 30-year smoking duration yielded the closest eligibility rate (27.5%). Compared with USPSTF-2021, the 30-year duration criteria would reduce eligibility gaps across all races relative to Whites, most notably in African Americans (30.4% vs. 28.8% for Whites under duration-based; 21.4% vs. 30.2% for Whites under USPSTF-2021) and Latinos (25.1% vs. 28.8% for Whites under duration-based; 15.7% vs. 30.2% for Whites under USPSTF-2021). Prognostic sensitivity to identify LC within 6 years increased across all races under the 30-year duration criteria, although specificity decreased commensurately. At matched overall eligibility (27.5%), a risk-based PLCOm2012\n\nLIMITATIONS: Cohort geography and enrollment period may limit generalizability. Overdiagnosis was not measured.\n\nCONCLUSION: Compared with USPSTF-2021, the 30-year duration-based criteria could reduce the eligibility gaps among African Americans and Latinos relative to Whites while improving 6-year LC detection sensitivity across all races.\n\nPRIMARY FUNDING SOURCE: National Institutes of Health."
    },
    {
      "pmid": "41404835",
      "doi": "10.1177/03008916251392738",
      "title": "LDCT-based lung cancer screening and small cell lung cancer: Limited but non-negligible impact on survival. A brief report.",
      "journal": "Tumori",
      "pubdate": "2025-12-17T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "SCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://doi.org/10.1177/03008916251392738",
      "metric_name": "SJR",
      "metric_value": 0.535,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41404835/",
      "url_doi": "https://doi.org/10.1177/03008916251392738",
      "abstract": "Low-dose computed tomography (LDCT)-based lung cancer screening (LCS) seems to have very limited impact on small cell lung cancer (SCLC) outcomes. This study aims at describing frequency and outcomes of SCLC in a large LCS population.Patients diagnosed with SCLC among the total population enrolled in three different trials (n = 7473) were selected for the present analysis. Demographic and clinical data were collected at the baseline and follow-up screening rounds, while the vital status and date of death were obtained through a dedicated national platform. Of the 396 diagnosed LCs, 28 (7.1%) were SCLCs; median survival time from the diagnosis was 1.5 years, and overall mortality was 71.4%. Screen-detected SCLCs were 20/28 (71.4%); 5/20 (25%) were prevalent cancers and 15/20 (75%) incident ones. Five-year mortality among the screen-detected and non-screen detected SCLCs was 70% and 62.5%, respectively.The frequency of SCLC was lower as compared to other trials. Although no significant differences in five-year mortality were observed between screen-detected and non-screen-detected SCLCs, the overall five-year mortality was substantially lower than that reported in non-LCS populations, suggesting that LDCT-based LCS has an impact on SCLC outcome, albeit limited."
    },
    {
      "pmid": "41192526",
      "doi": "10.1016/j.cellsig.2025.112211",
      "title": "RIPK2/STAT3 signaling axis drives lung cancer metastasis through SNAIL activation: Molecular mechanisms and clinical implications.",
      "journal": "Cellular signalling",
      "pubdate": "2026-02-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41192526/",
      "url_doi": "https://doi.org/10.1016/j.cellsig.2025.112211",
      "abstract": "BACKGROUND: Lung adenocarcinoma is the most common histological subtype of lung cancer with high metastatic propensity. Epithelial-mesenchymal transition (EMT) plays a crucial role in tumor metastasis, but the molecular mechanisms remain incompletely elucidated. This study investigates the role of RIPK2 in EMT and metastasis of lung adenocarcinoma.\n\nMETHODS: TCGA database analysis determined RIPK2 expression and clinical significance. RNA interference, overexpression, qRT-PCR, Western blot, co-immunoprecipitation, and immunofluorescence were employed in A549 and PC-9 cell lines. Transwell, EdU, colony formation assays, and cytoskeletal staining assessed cell invasion, proliferation, and EMT changes. Nuclear localization signal (NLS) and nuclear export signal (NES) fusion proteins investigated subcellular localization effects. Tail vein injection in nude mice validated in vivo effects.\n\nRESULTS: RIPK2 was highly expressed in lung adenocarcinoma tissues and associated with poor prognosis. RIPK2 knockdown inhibited while overexpression promoted EMT, invasion, and metastasis. Co-immunoprecipitation and immunofluorescence confirmed direct RIPK2-STAT3 interaction. RIPK2 specifically upregulated EMT transcription factor SNAIL expression. Co-expression of RIPK2 and SNAIL correlated with shorter patient survival. STAT3 or SNAIL knockdown inhibited RIPK2-induced EMT and metastasis. Nuclear-localized RIPK2 completely restored cellular EMT, invasion, and metastatic capabilities while enhancing cisplatin resistance.\n\nCONCLUSION: RIPK2 translocates to the nucleus, interacts with STAT3, and synergistically upregulates SNAIL expression, promoting EMT, invasion, metastasis, and chemotherapy resistance in lung adenocarcinoma. The RIPK2-STAT3-SNAIL signaling axis represents a potential therapeutic target."
    },
    {
      "pmid": "41219394",
      "doi": "10.1038/s41571-025-01085-z",
      "title": "Navigating the landscape of EGFR TKI resistance in EGFR-mutant NSCLC - mechanisms and evolving treatment approaches.",
      "journal": "Nature reviews. Clinical oncology",
      "pubdate": "2026-01-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article",
        "Review"
      ],
      "entity": "NSCLC",
      "trial_type": "Review/Meta",
      "study_class": "Review",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41219394/",
      "url_doi": "https://doi.org/10.1038/s41571-025-01085-z",
      "abstract": "Resistance to EGFR tyrosine kinase inhibitors (TKIs) remains a major obstacle in the clinical management of EGFR-mutant non-small-cell lung cancer (NSCLC). Despite the transformative therapeutic activity of the multiple iterations of EGFR TKIs, spanning from first-generation reversible inhibitors such as erlotinib and gefitinib to the current standard-of-care third-generation covalent inhibitor osimertinib, primary or acquired resistance to these agents inevitably emerges via diverse mechanisms. The advent of combination therapies that incorporate chemotherapy, anti-angiogenic agents, bispecific antibodies or antibody-drug conjugates has increased clinical benefit but introduced new resistance phenotypes, underscoring the dynamic plasticity and complexity of tumour evolution under therapeutic pressure. In this Review, we provide a comprehensive synthesis of the molecular mechanisms that underlie resistance to third-generation EGFR TKIs, describe biomarker-guided and biomarker-unselected therapeutic strategies to overcome these mechanisms, and discuss emerging approaches to pre-empt resistance through early application of combination therapies. We highlight the paradigm shift from radiological to molecular monitoring of resistance to therapy and explore how advances in circulating tumour DNA analysis, artificial intelligence and multi-omics might facilitate adaptive treatment strategies. As the therapeutic landscape evolves, a more complete mechanistic understanding of resistance will be essential to guide rational treatment sequencing, inform trial design and improve long-term outcomes for patients with EGFR-mutant NSCLC."
    },
    {
      "pmid": "41176132",
      "doi": "10.1016/j.taap.2025.117625",
      "title": "An intestinal matrix-based human lung cancer model reflects clinical data from gefitinib on dosage-dependent efficacy.",
      "journal": "Toxicology and applied pharmacology",
      "pubdate": "2026-01-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://doi.org/10.1016/j.taap.2025.117625",
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41176132/",
      "url_doi": "https://doi.org/10.1016/j.taap.2025.117625",
      "abstract": "Lung cancer is the leading cause for cancer related death worldwide. One treatment option for patients with pulmonary adenocarcinoma is the targeted therapy gefitinib (Iressa®, ZD1839). As with other promising targeted therapies, desired in vivo effects of gefitinib came short to in vitro expectations, as preclinical testing is hampered by an inaccuracy of existing models and resistances develop frequently. We analysed the pharmacodynamics of gefitinib in a 3D tissue engineered human lung cancer model of HCC827 cells, as well as a resistant subpopulation of HCCres A2 cells. In 2D cell culture, a cell viability of 50 % was reached after treatment with 0.01-0.05 μM gefitinib. In the 3D model administering higher doses of gefitinib did not lead to a further reduction in viability and proliferation, or an increase in apoptosis. This shows that the pharmacodynamic effect of promising new therapies can often be overestimated in 2D versus 3D models. The results we obtained for gefitinib testing in the 3D models reflect astonishing well the efficacy of priorly published clinical data, suggesting that our 3D tumor models can display in vivo conditions more accurately, bridging the gap to living organisms. To mimic the clinical setting further, the lung cancer cells were cultivated under dynamic conditions in a bioreactor. The exploration of a resistant subpopulation confirmed an epithelial-mesenchymal transition. The described 3D lung cancer model can be used as a refined, preclinical testing platform for targeted therapies and with clinically relevant pharmacodynamic properties as shown exemplary for gefitinib."
    },
    {
      "pmid": "41068447",
      "doi": "10.1038/s41571-025-01080-4",
      "title": "Unresectable stage III non-small-cell lung cancer: state of the art and challenges.",
      "journal": "Nature reviews. Clinical oncology",
      "pubdate": "2026-01-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article",
        "Review"
      ],
      "entity": "Thoracic-other",
      "trial_type": "Review/Meta",
      "study_class": "Review",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41068447/",
      "url_doi": "https://doi.org/10.1038/s41571-025-01080-4",
      "abstract": "Despite advances in immunotherapy, unresectable stage III non-small-cell lung cancer (NSCLC) remains a highly challenging disease, with only around one-third of patients remaining disease-free at 5 years. The PACIFIC trial established consolidation with the anti-PD-L1 antibody durvalumab after concurrent chemoradiotherapy as the standard-of-care approach. Furthermore, the LAURA trial has redefined the treatment of patients with stage III unresectable EGFR-mutant NSCLC, demonstrating unprecedented progression-free survival durations with osimertinib consolidation. Despite these advances, novel approaches are urgently needed. Circulating tumour DNA-based monitoring of minimal residual disease is emerging as a personalized method of tailoring treatment duration and escalation strategies. Novel radiotherapy techniques have the potential to provide synergy with immunotherapy while minimizing toxicities. Additionally, ongoing trials evaluating chemoimmunotherapy combinations adapted from the neoadjuvant setting with the potential for conversion to resectable disease might, in the near future, redefine the boundary of surgical resectability. In this Review, we describe the rapidly evolving field of unresectable stage III NSCLC, providing a state-of-the-art overview that includes challenging topics such as biomarkers, personalization of therapy and the role of immunotherapy rechallenge."
    },
    {
      "pmid": "41205892",
      "doi": "10.1016/j.envpol.2025.127348",
      "title": "Association of radon exposure with lung cancer: serum biomarkers and computed tomography evidence from male miners.",
      "journal": "Environmental pollution (Barking, Essex : 1987)",
      "pubdate": "2026-01-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://doi.org/10.1016/j.envpol.2025.127348",
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41205892/",
      "url_doi": "https://doi.org/10.1016/j.envpol.2025.127348",
      "abstract": "The objective of this research is to investigate the association between occupational radon exposure and pulmonary health outcomes in male miners from Chongqing, China. Between June 2022 and December 2023, 110 miners were enrolled in this cross-sectional study. Personal radon exposure levels were measured using passive cumulative dosimeters, with pulmonary health assessed through radiologist-interpreted low-dose computed tomography (CT) scans and serum biomarker analysis (CEA, CYFRA21-1, NSE, and CA125) via ELISA. Multivariable analyses revealed strong dose-response relationships between radon exposure and both serum biomarkers and CT abnormalities. high radon exposure predicted substantial biomarker elevations including a 2.45-fold increase in CYFRA21-1 (β = 0.39, 95 % CI 0.25-0.54, p < 0.001), 1.60-fold increase in CEA (β = 0.20, 0.05-0.35, p = 0.008), and 3.58-fold increased CT abnormality risk (OR = 3.58, p = 0.023). Mediation analysis identified CYFRA21-1 as accounting for 69 % (p = 0.024) and CEA for 24.7 % (p = 0.036) of radon's effect on CT abnormalities. These findings demonstrate that occupational radon exposure contributes to pulmonary damage through both direct effects and biomarker-mediated pathways, with CYFRA21-1 and CEA emerging as potential early indicators of lung cancer in radon-exposed populations."
    },
    {
      "pmid": "41410381",
      "doi": "10.1080/14796694.2025.2592527",
      "title": "Real-world treatment patterns and subsequent treatment effectiveness following frontline brigatinib in the ALTA-1L trial.",
      "journal": "Future oncology (London, England)",
      "pubdate": "2025-12-18T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41410381/",
      "url_doi": "https://doi.org/10.1080/14796694.2025.2592527",
      "abstract": "AIMS: This retrospective, chart-review study evaluated real-world outcomes post-frontline brigatinib in ALTA-1L.\n\nMETHODS: Patients from ALTA-1L were followed after brigatinib discontinuation. Outcomes evaluated for second-line (2L) treatment included real-world overall response rate (rwORR), time to treatment discontinuation (rwTTD), and progression-free survival (rwPFS).\n\nRESULTS: Forty of 48 patients received subsequent systemic anticancer therapies; 30 received 2L ALK tyrosine kinase inhibitors (TKIs), mostly lorlatinib (n = 16) or alectinib (n = 8), and 11 received 2L non-ALK TKI therapy (one with alectinib). rwORR was 33% with 2L ALK TKIs and 0% with 2L non-ALK TKI therapy. Median (95% confidence interval [CI]) 2L rwTTD was 34.7 months (4.6-not reached [NR]) for ALK TKIs (lorlatinib, 37.2 months [6.0-NR]; alectinib, NR [1.1-NR]; crizotinib, 2.8 months [2.0-NR]) and 4.4 months (1.4-6.0) for 2L non-ALK TKI therapy. Median (95% CI) 2L rwPFS was 16.1 months (4.4-NR) with ALK TKIs (lorlatinib, 25.6 months [3.8-NR]; alectinib, 16.1 months [1.1-NR]; crizotinib, 2.4 months [2.0-NR]) and 6.1 months (1.7-NR) with 2L non-ALK TKI therapy.\n\nCONCLUSIONS: Following brigatinib discontinuation, most patients initiated a second ALK TKI. Patients treated with 2L second- or third-generation ALK TKIs post-brigatinib experienced prolonged clinical benefit.\n\nCLINICAL TRIAL REGISTRATION: clinicaltrials.gov identifier: NCT02737501."
    },
    {
      "pmid": "41410198",
      "doi": "10.1080/17501911.2025.2604020",
      "title": "Peripheral blood-based S100P hypomethylation as a biomarker for the early-stage non-small cell lung cancer.",
      "journal": "Epigenomics",
      "pubdate": "2025-12-18T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41410198/",
      "url_doi": "https://doi.org/10.1080/17501911.2025.2604020",
      "abstract": "AIM: Non-small cell lung cancer (NSCLC) has caused a heavy social and economic burden worldwide. DNA methylation, as an emerging blood biomarker, has great potential for early detection of NSCLC.\n\nMETHODS: Seven CpG sites of the\n\nRESULTS: The logistic regression-based quartile analysis (Q1 lowest vs. Q4 highest) disclosed the association between hypomethylation of six CpG sites in the\n\nCONCLUSIONS: Using quantitative mass spectrometry, we investigated an association between"
    },
    {
      "pmid": "41406409",
      "doi": "10.1200/JCO-25-02185",
      "title": "Reply to: Blind Spots in REZILIENT-1: Does Post-platinum Zipalertinib Address Needs in Epidermal Growth Factor Receptor ex20ins+ Non-Small Cell Lung Cancer?",
      "journal": "Journal of clinical oncology : official journal of the American Society of Clinical Oncology",
      "pubdate": "2025-12-17T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41406409/",
      "url_doi": "https://doi.org/10.1200/JCO-25-02185",
      "abstract": null
    },
    {
      "pmid": "41406405",
      "doi": "10.1200/JCO-25-01501",
      "title": "Blind Spots in REZILIENT-1: Does Post-Platinum Zipalertinib Address Needs in Epidermal Growth Factor Receptor ex20ins+ Non-Small Cell Lung Cancer?",
      "journal": "Journal of clinical oncology : official journal of the American Society of Clinical Oncology",
      "pubdate": "2025-12-17T00:00:00+00:00",
      "pubtypes": [
        "Letter"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41406405/",
      "url_doi": "https://doi.org/10.1200/JCO-25-01501",
      "abstract": null
    },
    {
      "pmid": "41407631",
      "doi": "10.1016/j.lungcan.2025.108875",
      "title": "Corrigendum to \"Treatment and outcomes of limited stage small cell lung cancer in the Canadian small cell lung cancer database (CASCADE)\" [Lung Cancer 210 (2025) 108840].",
      "journal": "Lung cancer (Amsterdam, Netherlands)",
      "pubdate": "2025-12-16T00:00:00+00:00",
      "pubtypes": [
        "Published Erratum"
      ],
      "entity": "SCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41407631/",
      "url_doi": "https://doi.org/10.1016/j.lungcan.2025.108875",
      "abstract": null
    },
    {
      "pmid": "41388832",
      "doi": "10.1080/14796694.2025.2596228",
      "title": "Frontline sigvotatug vedotin plus pembrolizumab vs pembrolizumab for non-small cell lung cancer with PD-L1 tumor proportion score ≥50%: phase III study design.",
      "journal": "Future oncology (London, England)",
      "pubdate": "2025-12-13T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": "Phase III",
      "study_class": "Prospective",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41388832/",
      "url_doi": "https://doi.org/10.1080/14796694.2025.2596228",
      "abstract": "Integrin beta-6 (IB6) is a tumor-associated membrane protein involved in many cellular processes, including wound healing and tissue remodeling. While IB6 expression is constitutively low in healthy tissues, high IB6 expression in numerous cancers, including non-small cell lung cancer (NSCLC), is associated with poor outcomes. In a phase I study, the novel IB6-directed vedotin-based antibody-drug conjugate sigvotatug vedotin (SV) showed manageable safety and encouraging efficacy as a monotherapy and in combination with pembrolizumab in patients with advanced solid tumors, including NSCLC. Based on those results, the phase III Sigvie-003 study is evaluating SV plus pembrolizumab compared with pembrolizumab monotherapy as first-line treatment in adult patients with locally advanced, unresectable, or metastatic NSCLC with high programmed cell death ligand 1 expression (tumor proportion score ≥50%). Here, we describe the design of the Sigvie-003 study, which is an open-label, randomized, controlled phase III study. Approximately 714 patients will be randomized 1:1. The dual primary endpoints are progression-free survival as assessed by blinded independent central review per Response Evaluation Criteria in Solid Tumors v1.1 and overall survival; secondary endpoints include additional efficacy, safety and tolerability, pharmacokinetics, and immunogenicity endpoints."
    }
  ]
}