{
  "generated": "2026-01-17T05:18:49.250056Z",
  "items": [
    {
      "pmid": "41538156",
      "doi": "10.1001/jamaoncol.2025.5924",
      "title": "Lymph Node Dissection Guideline Adherence and Survival in Patients With T1N0M0 Lung Adenocarcinoma.",
      "journal": "JAMA oncology",
      "pubdate": "2026-01-15T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": "SJR",
      "metric_value": 8.377,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41538156/",
      "url_doi": "https://doi.org/10.1001/jamaoncol.2025.5924",
      "abstract": "IMPORTANCE: Lymph node dissection for early-stage lung adenocarcinoma is controversial. Histologic pattern subtyping reveals heterogeneity of lung adenocarcinoma, yet its association with lymph node involvement and dissection is understudied.\n\nOBJECTIVE: To assess the association between guideline-adherent lymph node dissection, histologic pattern subtyping, and overall survival in patients with clinical T1N0M0 lung adenocarcinoma.\n\nDESIGN, SETTING, AND PARTICIPANTS: This multicenter cohort study used data from the National Cancer Center LungReal database, a multicenter, electronic health records-based database for patients undergoing surgery for lung cancer, from January 2014 to December 2021, with the last follow-up in December 2022. Patients were categorized based on histologic pattern of adenocarcinoma into 2 groups: lepidic without high-grade pattern, and high-grade or no lepidic pattern. The data analysis was performed from April to November 2025.\n\nEXPOSURE: Lymph node dissection adherence or nonadherence with the 3 + 1 standard (3 N2 plus 1 N1 station) and the 6-station standard (the subcarinal plus 2 other N2 stations and 3 N1 stations).\n\nMAIN OUTCOME AND MEASURE: Overall survival.\n\nRESULTS: Of 35 265 patients screened, 27 191 participants (mean [SD] age, 58.3 [11.7] years; 16 280 female [59.9%] and 10 911 male [40.1%] individuals) from 19 centers were included; among them, 15 593 (57.3%) received lymph node dissection adherent with the 3 + 1 standard and 4023 (14.8%) with the 6-station standard. Among the group of 13 369 patients (49.2%) with adenocarcinoma of lepidic without high-grade pattern, no association was observed between survival and adherence with the 3 + 1 standard (hazard ratio [HR], 0.81; 95% CI, 0.57-1.15) or the 6-station standard (HR, 0.54; 95% CI, 0.26-1.13). Whereas, among the group of 13 822 patients (50.8%) with adenocarcinoma of high-grade or no lepidic pattern, adherence with the 3 + 1 standard (HR, 0.81; 95% CI, 0.69-0.95; absolute risk difference at 3-year, 1.2%; 95% CI, 0.2%-2.2%; E-value, 1.78) or the 6-station standard (HR, 0.61; 95% CI, 0.45-0.83; absolute risk difference at 3 years, 1.0%; 95% CI, 0.1%-1.9%; E-value, 2.67) was associated with a significant but small absolute survival benefit.\n\nCONCLUSION AND RELEVANCE: In this cohort study, guideline-adherent nodal dissection was associated with small absolute survival benefit for patients with adenocarcinoma of high-grade or no lepidic pattern, but not for those with lepidic without high-grade pattern. These observational findings warrant prospective validation and should not be interpreted as causal."
    },
    {
      "pmid": "41532856",
      "doi": "10.1158/2159-8290.CD-25-1483",
      "title": "Circulating Tumor Cells Predict Response to the DLL3-targeting Bispecific Antibody Tarlatamab.",
      "journal": "Cancer discovery",
      "pubdate": "2026-01-14T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://doi.org/10.1158/2159-8290.cd-25-1483",
      "metric_name": "SJR",
      "metric_value": 7.283,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41532856/",
      "url_doi": "https://doi.org/10.1158/2159-8290.CD-25-1483",
      "abstract": "The bispecific antibody tarlatamab recruits T cells to cancers expressing the neuroendocrine epitope DLL3. Tarlatamab is effective in small cell lung cancer (SCLC), but clinical outcomes vary, and no biomarkers enable patient selection. Single-cell RNA sequencing of SCLC biopsies identifies heterogeneity in DLL3 expression, and analysis of circulating tumor cells (CTCs) distinguishes individual patients as predominantly DLL3Pos or DLL3Low. In a prospective cohort of 20 patients, pretreatment DLL3 expression on CTCs predicts tarlatamab clinical benefit (85% sensitivity, 100% specificity). Necrotic CTC clusters in blood accompany treatment-induced tumor lysis. Acquired resistance to tarlatamab is associated in some cases with loss of DLL3 expression, but persistence of other targetable neuro-endocrine epitopes; in other patients, DLL3 is retained on CTCs, but accompanied by systemic markers of T cell dysfunction. Quantitation of DLL3-positive CTCs identifies patients likely to benefit from tarlatamab, and longitudinal monitoring may guide therapeutic decision-making at the time of acquired resistance."
    },
    {
      "pmid": "41525686",
      "doi": "10.1158/2159-8290.CD-25-1222",
      "title": "PD1 blockade-induced DKK1 expression by CD8+ T cells promotes blood-brain barrier permeabilization.",
      "journal": "Cancer discovery",
      "pubdate": "2026-01-13T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://doi.org/10.1158/2159-8290.cd-25-1222",
      "metric_name": "SJR",
      "metric_value": 7.283,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41525686/",
      "url_doi": "https://doi.org/10.1158/2159-8290.CD-25-1222",
      "abstract": "Anti-PD1 therapy benefits a subset of brain metastasis (BrM) patients; however, heterogeneous responses imply an incomplete understanding of the brain-immune ecosystem. To elucidate host-driven determinants of this variability, we performed single-cell RNA sequencing to characterize the brain microenvironment. While anti-PD1 induced robust anti-tumor immune activation, it uniquely, among all ICIs tested, compromised blood-brain barrier (BBB) integrity. This permeabilization was mediated by DKK1-expressing activated CD8⁺ T cells through the induction of β-catenin/TCF and FOXM1 pathways, contributing to endothelial cell destabilization. Depleting plasma-DKK1 restored BBB integrity and reduced experimental BrM formation. Clinically, lung cancer patients receiving anti-PD1 exhibited increased MRI contrast enhancement in the brain, suggestive of BBB perturbations, and increasing plasma DKK1 levels correlated with higher BrM incidence in non-responders. Sequencing anti-PD1 followed by cisplatin improved intracranial cisplatin delivery and therapeutic efficacy in ICI-resistant BrM. These findings identify anti-PD1-induced BBB modulation as a tractable vulnerability in BrM management."
    },
    {
      "pmid": "41521774",
      "doi": "10.1158/2159-8290.CD-25-1836",
      "title": "Testing Nature's Defenses: Inducing Cancer in the Naked Mole Rat.",
      "journal": "Cancer discovery",
      "pubdate": "2026-01-12T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Other",
      "trial_type": null,
      "study_class": "Preclinical",
      "is_oa": false,
      "oa_url": null,
      "metric_name": "SJR",
      "metric_value": 7.283,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41521774/",
      "url_doi": "https://doi.org/10.1158/2159-8290.CD-25-1836",
      "abstract": "Although mice develop lung cancer from a single Eml4-Alk driver fusion, Shepard, Lester, and colleagues show that naked mole rats require three simultaneous oncogenic events: Eml4-Alk, Tp53 loss, and Rb1 loss, achieving only 30% tumor penetrance. This inducible cancer model in naked mole rats offers a unique platform for uncovering mechanisms of cancer resistance and modeling rare pleomorphic lung carcinomas. See related article by Shepard et al., p. 35."
    },
    {
      "pmid": "41405207",
      "doi": "10.1158/2159-8290.CD-NW2025-0107",
      "title": "ADC for SCLC Clears Phase I.",
      "journal": "Cancer discovery",
      "pubdate": "2026-01-12T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "SCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": "SJR",
      "metric_value": 7.283,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41405207/",
      "url_doi": "https://doi.org/10.1158/2159-8290.CD-NW2025-0107",
      "abstract": "ZL-1310, an antibody-drug conjugate that targets DLL3-expressing small cell lung cancer cells, led to responses in nearly half of patients in a phase I study. These results provide further evidence that targeting DLL3 may be a promising approach for treating this cancer."
    },
    {
      "pmid": "41526018",
      "doi": "10.1136/bmjopen-2025-108080",
      "title": "Telehealth-delivered exercise and nutrition intervention to improve outcomes in patients with early stage non-small cell lung cancer: protocol for the multicentre STARLighT phase II (neoadjuvant) and phase III (adjuvant) trial.",
      "journal": "BMJ open",
      "pubdate": "2026-01-12T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": "Phase III",
      "study_class": "Prospective",
      "is_oa": true,
      "oa_url": "https://bmjopen.bmj.com/content/bmjopen/16/1/e108080.full.pdf",
      "metric_name": "SJR",
      "metric_value": 1.016,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41526018/",
      "url_doi": "https://doi.org/10.1136/bmjopen-2025-108080",
      "abstract": "INTRODUCTION: In early stage non-small cell lung cancer (NSCLC), recurrence is frequent despite surgery and systemic treatments. Observational studies suggest that physical exercise and nutrition could improve outcomes, such as survival and treatment tolerance; however, solid evidence is lacking. The STARLighT trial aims to assess the effects of a telehealth-delivered combined exercise and nutrition intervention on clinical, biological and patient-reported outcomes in early stage NSCLC.\n\nMETHODS AND ANALYSIS: STARLighT is a multicentre master protocol study conducted in Italy, comprising two cohorts of patients affected by early stage NSCLC (stages IB-IIIA)\n\nETHICS AND DISSEMINATION: The study is approved by the Ethics Committee of the University of Verona (Prot. No. 33979) and registered on ClinicalTrials.gov (NCT07042724). Findings will be disseminated through peer-reviewed journals, scientific meetings, public forums and guideline updates.\n\nTRIAL REGISTRATION NUMBER: Clinicaltrial.gov: NCT07042724."
    },
    {
      "pmid": "41538483",
      "doi": "10.31744/einstein_journal/2026RW0987",
      "title": "Computed tomography imaging features of major pulmonary and extrapulmonary complications of fibrotic lung diseases.",
      "journal": "Einstein (Sao Paulo, Brazil)",
      "pubdate": "2026-01-12T00:00:00+00:00",
      "pubtypes": [
        "Journal Article",
        "Review"
      ],
      "entity": "Thoracic-other",
      "trial_type": "Review/Meta",
      "study_class": "Review",
      "is_oa": true,
      "oa_url": "https://journal.einstein.br/wp-content/uploads/articles_xml/2317-6385-eins-24-eRW0987/2317-6385-eins-24-eRW0987.pdf",
      "metric_name": "SJR",
      "metric_value": 0.277,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41538483/",
      "url_doi": "https://doi.org/10.31744/einstein_journal/2026RW0987",
      "abstract": "Patients diagnosed with fibrosing interstitial lung disease are at risk of several complications, some of which may be life-threatening. Computed tomography imaging plays an important role in diagnosing these overlapping conditions. This article summarizes the computed tomography imaging features of the most common conditions associated with fibrosing interstitial lung diseases, categorized by involvement of the lung parenchyma or extra-pulmonary compartments. Some steps may help to recognize such complications, such as having knowledge of the underlying fibrotic lung disease, being aware of potentially immunosuppressive treatments in use, noting new relevant symptoms, checking previous imaging examinations to detect subtle changes, and considering the exam technique, for example, to avoid false perception of ground-glass opacities in exams with insufficient inspiration. Unenhanced computed tomography may be enough to diagnose most situations, but in specific cases, for example, in the clinical suspicion of pulmonary embolism, dedicated computed tomography angiography may be warranted. Careful comparison with previous exams is advised, especially to detect subtle opacities suspicious for lung cancer, underscoring that its detection may be difficult owing to the baseline morphological lung changes. Radiologists must be aware of such possible complications to perform early diagnosis and ensure proper management."
    },
    {
      "pmid": "41192526",
      "doi": "10.1016/j.cellsig.2025.112211",
      "title": "RIPK2/STAT3 signaling axis drives lung cancer metastasis through SNAIL activation: Molecular mechanisms and clinical implications.",
      "journal": "Cellular signalling",
      "pubdate": "2026-02-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41192526/",
      "url_doi": "https://doi.org/10.1016/j.cellsig.2025.112211",
      "abstract": "BACKGROUND: Lung adenocarcinoma is the most common histological subtype of lung cancer with high metastatic propensity. Epithelial-mesenchymal transition (EMT) plays a crucial role in tumor metastasis, but the molecular mechanisms remain incompletely elucidated. This study investigates the role of RIPK2 in EMT and metastasis of lung adenocarcinoma.\n\nMETHODS: TCGA database analysis determined RIPK2 expression and clinical significance. RNA interference, overexpression, qRT-PCR, Western blot, co-immunoprecipitation, and immunofluorescence were employed in A549 and PC-9 cell lines. Transwell, EdU, colony formation assays, and cytoskeletal staining assessed cell invasion, proliferation, and EMT changes. Nuclear localization signal (NLS) and nuclear export signal (NES) fusion proteins investigated subcellular localization effects. Tail vein injection in nude mice validated in vivo effects.\n\nRESULTS: RIPK2 was highly expressed in lung adenocarcinoma tissues and associated with poor prognosis. RIPK2 knockdown inhibited while overexpression promoted EMT, invasion, and metastasis. Co-immunoprecipitation and immunofluorescence confirmed direct RIPK2-STAT3 interaction. RIPK2 specifically upregulated EMT transcription factor SNAIL expression. Co-expression of RIPK2 and SNAIL correlated with shorter patient survival. STAT3 or SNAIL knockdown inhibited RIPK2-induced EMT and metastasis. Nuclear-localized RIPK2 completely restored cellular EMT, invasion, and metastatic capabilities while enhancing cisplatin resistance.\n\nCONCLUSION: RIPK2 translocates to the nucleus, interacts with STAT3, and synergistically upregulates SNAIL expression, promoting EMT, invasion, metastasis, and chemotherapy resistance in lung adenocarcinoma. The RIPK2-STAT3-SNAIL signaling axis represents a potential therapeutic target."
    },
    {
      "pmid": "41389771",
      "doi": "10.1016/j.ejca.2025.116165",
      "title": "Long-term outcomes of preoperative nivolumab with or without relatlimab in patients with resectable non-small-cell lung cancer (NEOpredict-Lung).",
      "journal": "European journal of cancer (Oxford, England : 1990)",
      "pubdate": "2026-01-17T00:00:00+00:00",
      "pubtypes": [
        "Journal Article",
        "Randomized Controlled Trial"
      ],
      "entity": "Thoracic-other",
      "trial_type": "RCT",
      "study_class": "Prospective",
      "is_oa": true,
      "oa_url": "https://www.ejcancer.com/article/S0959-8049(25)01051-2/pdf",
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41389771/",
      "url_doi": "https://doi.org/10.1016/j.ejca.2025.116165",
      "abstract": "BACKGROUND: Preoperative immunotherapy targeting PD-1/-L1 with chemotherapy induces histopathological responses and improves survival in patients with resectable non-small cell lung cancer (NSCLC). NEOpredict-Lung (NCT04205552) established the feasibility of dual blockade of PD-1 and LAG-3 immune checkpoints prior to curatively intended resection. Here we report extended follow-up, postoperative treatments and patterns of response and recurrence.\n\nPATIENTS AND METHODS: Patients with resectable NSCLC (stages IB-IIIA) were randomized to receive two doses nivolumab (240 mg, arm A) with or without relatlimab (80 mg, arm B) every 2 weeks. Overall and disease-free survival (OS, DFS) rates, response and recurrence patterns and subsequent therapies were evaluated.\n\nRESULTS: 60 patients were enrolled from March 2020 to July 2022. The present analysis was conducted per December 2024 with a median follow-up of 37.4 months. 45 patients were alive without disease recurrence,15 patients recurred (4 locoregional and 11 metastatic), and 7 patients died. The 3-year OS and DFS rates were 88.4 % and 73.3 % in arm A and 88.9 % and 60.3 % in arm B. Patients achieving major pathological response (≤10 % viable tumor cells in resected NSCLC) trended towards better DFS (HR 0.35; 95 % CI, 0.1-1.19). Downstaging was confirmed in 53.3 % of patients in arm A and in 66.7 % of patients in arm B. Nodal downstaging occurred in 28.6 % of patients with nodal disease in arm A and in 66.7 % of patients in arm B.\n\nCONCLUSIONS: Short course preoperative nivolumab with or without relatlimab showed encouraging efficacy and survival outcomes, which compare favorably with chemo-immunotherapy-based perioperative treatment regimens."
    },
    {
      "pmid": "41421886",
      "doi": "10.1016/j.ejca.2025.116069",
      "title": "Bridging the gap in lung cancer: A comprehensive global strategy for change.",
      "journal": "European journal of cancer (Oxford, England : 1990)",
      "pubdate": "2026-01-17T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Preclinical",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41421886/",
      "url_doi": "https://doi.org/10.1016/j.ejca.2025.116069",
      "abstract": "BACKGROUND: Unless greater awareness inspires action, lung cancer will become the next global public health emergency. Despite improvements in screening, diagnosis, and treatments, more must be done because global incidence continues to increase. Concerted action must address the burden both between and within countries. Inequalities result from the uneven distribution of resources while inequities result from differences in prevention, screening, diagnosis, and treatment.\n\nMETHOD: Participants in the 9th International Lung Cancer Network conference (Athens, June 2023) received an advanced draft of the declaration with a confidentiality notice by email upon completion of online registration. They were invited to provide comments and suggestions up to seven days before the meeting. All contributions were reviewed by the authors and incorporated into the final version circulated the day before the meeting began. Although not a formal Delphi-style process, this approach prioritized inclusivity, transparency, and broad endorsement. Outreach extended beyond onsite attendees, ensuring diverse perspectives and representation. This process complements methodological consensus approaches by uniting stakeholders around shared policy goals.\n\nRESULTS: At the 9th International Lung Cancer Network conference, participants were invited to sign the final declaration, and 785 did so. Since then, 20 organizations worldwide have formally endorsed the Consensus Statement, and support continues to grow. The inclusive design has fostered broad and sustained backing, underscoring the value of the Statement as a unifying policy declaration advancing shared principles.\n\nCONCLUSION: The Consensus Statement, Bridging the Gap in the Diagnosis and Management of Lung Cancer, reinforces five unifying principles: improve and expand prevention; focus on early detection; ensure equitable and sustainable access to treatment; build partnerships and promote investment; and, combat stigma, recognizing it as a social determinant of public health."
    },
    {
      "pmid": "41543339",
      "doi": "10.1158/1078-0432.CCR-25-2734",
      "title": "RRAS and RRAS2 mutations are recurrent oncogenic drivers in lung cancer and are sensitive to the pan-RAS inhibitor RMC-6236.",
      "journal": "Clinical cancer research : an official journal of the American Association for Cancer Research",
      "pubdate": "2026-01-16T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41543339/",
      "url_doi": "https://doi.org/10.1158/1078-0432.CCR-25-2734",
      "abstract": "INTRODUCTION: RRAS and RRAS2 encode a subfamily of RAS-like small GTPases that share considerable structural and functional similarities with KRAS, HRAS, and NRAS. Whether homologous RRAS/RRAS2 mutations are oncogenic and actionable drivers in lung cancer remains underexplored.\n\nMETHODS: An institutional cohort of 8,488 non-small cell lung carcinomas (NSCLC) sequenced by comprehensive targeted DNA sequencing (MSK-IMPACT) between 2016-2024 was evaluated for RRAS/RRAS2 mutations. RRASQ87L or RRAS2Q72L were modeled in murine IL3-dependent Ba/F3 cells and immortalized human bronchiolar epithelial cells (HBECs). The oncogenic potential, signaling characteristics, and sensitivity to PI3K and MAPK pathway inhibitors, including the novel pan-RAS inhibitor RMC-6236, were evaluated in vitro and in vivo.\n\nRESULTS: RRASQ87L or RRAS2Q72L, homologous to KRAS-codon Q61 substitutions, were found in ~0.45% of NSCLCs (38/8,488), with all but two lacking other MAPK pathway oncogenic drivers. RRASQ87L and RRAS2Q72L mutations transformed Ba/F3 and HBEC cells and robustly activated MAPK and PI3K-mTOR pathway signaling. RMC-6236 suppressed proliferation of RRASQ87L and RRAS2Q72L mutant cell lines, reduced ERK phosphorylation, induced apoptosis, and impeded cell-cycle progression. In vivo, RMC-6236 significantly inhibited growth of RRASQ87L/RRAS2Q72L-mutant HBEC-derived xenografts.\n\nCONCLUSIONS: RRASQ87L and RRAS2Q72L are recurrent, oncogenic, and potentially actionable drivers in NSCLC. Our study supports the inclusion of RRAS/RRAS2 into routine molecular diagnostic panels for precision oncology and provides preclinical rationale for investigating the potential therapeutic utility of pan-RAS inhibitors for patients with RRASQ87L/RRAS2Q72L-mutant lung cancers."
    },
    {
      "pmid": "41537704",
      "doi": "10.1158/1078-0432.CCR-25-4382",
      "title": "Landscape of Genomic Mechanisms of Resistance to Selective RET Inhibitors in RET-Altered Solid Tumors: Analysis of the RETgistry Global Consortium.",
      "journal": "Clinical cancer research : an official journal of the American Association for Cancer Research",
      "pubdate": "2026-01-15T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41537704/",
      "url_doi": "https://doi.org/10.1158/1078-0432.CCR-25-4382",
      "abstract": "PURPOSE: Rearranged during transfection (RET) alterations are oncogenic drivers across solid tumors. Selective RET inhibitors (SRIs) selpercatinib and pralsetinib have transformed outcomes for patients with RET-altered malignancies. Limited knowledge exists on genomic mechanisms of resistance to SRIs.\n\nEXPERIMENTAL DESIGN: We established 'RETgistry,' a global consortium of patients with advanced RET-altered solid tumors who received SRIs and underwent post-progression tissue or plasma biopsies assessed by next-generation sequencing. Frequencies of secondary RET resistance mutations and acquired non-RET gene alterations were determined. Progression-free survival (PFS) and time to treatment discontinuation (TTD) on first SRI were estimated with Kaplan-Meier method.\n\nRESULTS: RETgistry included 109 patients with RET-altered advanced solid tumors (lung: n=94; thyroid: n=15) who underwent 143 post-SRI progression biopsies (tissue: 91; plasma: 52). Median PFS and TTD were 13.9 months (95% confidence interval [CI] 10.1-16.6) and 17.3 months (95% CI 14.0-20.2), respectively. Secondary RET mutations were detected in 20 (14.0%) biopsies (lung cancer: 15 [12.4%], thyroid carcinoma: 5 [22.7%]). Common acquired off-target alterations involved MET (18.2%; amplification: 15.0%), TP53 (8.2%), APC (7.6%), KRAS (7.1%), KEAP1 (5.9%), and CDKN2A/B (5.3%). MET alterations were enriched in post-SRI versus pre-SRI specimens (full cohort: 17.6% vs 2.0%, p=0.022; lung cancer: 19.1% vs 2.1%, p=0.022).\n\nCONCLUSIONS: Prevalence of secondary RET mutations after SRIs was low, underscoring greater role for off-target resistance. Recurrent acquired alterations involving tumor suppressor genes or upstream regulators of MAPK and PI3K pathways were identified, most commonly MET amplification. Continued efforts to characterize SRI resistance biology are critical to guide development of novel therapeutic strategies."
    },
    {
      "pmid": "41537692",
      "doi": "10.1158/1078-0432.CCR-25-2958",
      "title": "Minimal Residual Disease Enhances Prognostic Stratification Beyond Pathological Response in Resectable Non-Small Cell Lung Cancer.",
      "journal": "Clinical cancer research : an official journal of the American Association for Cancer Research",
      "pubdate": "2026-01-15T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Preclinical",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41537692/",
      "url_doi": "https://doi.org/10.1158/1078-0432.CCR-25-2958",
      "abstract": "PURPOSE: Perioperative chemoimmunotherapy is the standard of care for resectable, locally advanced non-small cell lung cancer (NSCLC). While pathological complete response (pCR) correlates with excellent survival outcomes, some patients without pCR still exhibit long-term survival. Here we evaluate the added value of minimal residual disease (MRD).\n\nEXPERIMENTAL DESIGN: MRD was assessed in 60 patients from the NADIM II trial (NCT03838159) using Guardant Reveal assay. In NADIM II, NSCLC patients without EGFR or ALK alterations were randomized to receive neoadjuvant nivolumab plus chemotherapy (experimental arm) or chemotherapy alone, followed by surgery. Patients in the experimental arm with R0 resection received adjuvant nivolumab.\n\nRESULTS: MRD detection rate was 9.6%. MRD after surgery or during adjuvant treatment was associated with inferior EFS and OS (HR: 10.2; 95%CI: 3.7-28.3 and HR: 10.0; 95%CI: 2.0-49.9, respectively). All patients with MRD-negative plasma samples in at least two time points were alive (HR: not estimable [NE], p < 0.001), with only one relapse (HR: 41.6; 95%CI: 5.0-348.8), corresponding to a patient relapsing with a single brain metastasis. MRD enhanced the prognostic value of pCR for both EFS (p<0.001) and OS (p=0.015). Among non-pCR patients, MRD remained a significant prognostic marker (HR: 6.2; 95%CI: 2.2-17.1 and HR: 6.5; 95%CI: 1.3-32.5, for EFS and OS respectively). All non-pCR patients with MRD-negative results in at least two time points were alive (HR: NE, p=0.025), with one relapse (HR: 19.9; 95%CI: 2.4-165.6), corresponding to the aforementioned case.\n\nCONCLUSIONS: MRD may refine prognostic evaluation beyond pCR in resectable NSCLC undergoing perioperative chemoimmunotherapy."
    },
    {
      "pmid": "41538410",
      "doi": "10.1126/science.adz9353",
      "title": "A genetically encoded device for transcriptome storage in mammalian cells.",
      "journal": "Science (New York, N.Y.)",
      "pubdate": "2026-01-15T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41538410/",
      "url_doi": "https://doi.org/10.1126/science.adz9353",
      "abstract": "Understanding how cells make decisions over time requires the ability to link past molecular states to future phenotypic outcomes. We present TimeVault, a genetically encoded system that records and stores transcriptomes within living mammalian cells for future readout. TimeVault leverages engineered vault particles that capture mRNA through poly(A) binding protein. We demonstrate that the transcriptome stored by TimeVaults is stable in living cells for over 7 days. TimeVault enables high-fidelity transcriptome-wide recording with minimal cellular perturbation, capturing transient stress responses and revealing gene expression changes underlying drug-naive persister states in lung cancer cells that evade EGFR inhibition. By linking past and present cellular states, TimeVault provides a powerful tool for decoding how cells respond to stress, make fate decisions, and resist therapy."
    },
    {
      "pmid": "41535475",
      "doi": "10.1038/s41586-026-10104-7",
      "title": "Retraction Note: Antibodies against endogenous retroviruses promote lung cancer immunotherapy.",
      "journal": "Nature",
      "pubdate": "2026-01-14T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://doi.org/10.1038/s41586-026-10104-7",
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41535475/",
      "url_doi": "https://doi.org/10.1038/s41586-026-10104-7",
      "abstract": null
    },
    {
      "pmid": "41534001",
      "doi": "10.1200/JCO-25-02726",
      "title": "Timing Is of the Essence: Sequencing Immune Checkpoint Blockade and Radiotherapy for Success in Lung Cancer.",
      "journal": "Journal of clinical oncology : official journal of the American Society of Clinical Oncology",
      "pubdate": "2026-01-14T00:00:00+00:00",
      "pubtypes": [
        "Editorial"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41534001/",
      "url_doi": "https://doi.org/10.1200/JCO-25-02726",
      "abstract": null
    },
    {
      "pmid": "41529222",
      "doi": "10.1200/JCO-25-01828",
      "title": "Adjuvant Durvalumab in Completely Resected Early-Stage Non-Small Cell Lung Cancer.",
      "journal": "Journal of clinical oncology : official journal of the American Society of Clinical Oncology",
      "pubdate": "2026-01-13T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41529222/",
      "url_doi": "https://doi.org/10.1200/JCO-25-01828",
      "abstract": "PURPOSE: Adjuvant immunotherapy improved patient outcomes in two trials in completely resected non-small cell lung cancer (NSCLC), but with conflicting primary end point results. The Canadian Cancer Trials Group BR.31 trial evaluated adjuvant durvalumab in completely resected early-stage NSCLC.\n\nMETHODS: Following resection of stage IB (≥4 cm) to IIIA NSCLC (American Joint Committee on Cancer 7th Edition) and optional adjuvant chemotherapy, patients were randomly assigned 2:1 to durvalumab 20 mg/kg or placebo 20 mg/kg once every 4 weeks for 12 cycles. Random assignment was stratified by stage, extent of nodal dissection, tumor cell (TC) PD-L1 expression, adjuvant chemotherapy use, and center. The primary end point was investigator-assessed disease-free survival (DFS). Secondary outcomes included overall survival (OS), adverse events, and quality of life. The primary analysis was in the subgroup with cancers that had a PD-L1 TC expression ≥25%, no common activating\n\nRESULTS: Of 1,415 patients randomly assigned, 1,219 (86%) had\n\nCONCLUSION: Adjuvant durvalumab following complete resection was not associated with improvement in DFS compared with placebo in"
    },
    {
      "pmid": "41529214",
      "doi": "10.1200/JCO-25-01569",
      "title": "Chemoradiation ± Atezolizumab in Limited-Stage Small Cell Lung Cancer: Results of NRG Oncology/Alliance LU005.",
      "journal": "Journal of clinical oncology : official journal of the American Society of Clinical Oncology",
      "pubdate": "2026-01-13T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "SCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41529214/",
      "url_doi": "https://doi.org/10.1200/JCO-25-01569",
      "abstract": "PURPOSE: NRG Oncology/Alliance LU005 (ClinicalTrials.gov identifier: NCT03811002) tested the addition of atezolizumab to concurrent chemoradiation (CRT) in this open-label, phase III international trial.\n\nMETHODS: Patients with limited-stage small cell lung cancer (LS-SCLC), stage Tx-IV, N0-3, and M0 with Eastern Cooperative Group performance status (PS) 0-2 received one cycle of chemotherapy (platinum/etoposide) before study registration and were randomly assigned to CRT alone versus CRT plus concurrent and adjuvant atezolizumab, 1,200 mg once daily, every 3 weeks until investigator-assessed progression or intolerable side effects for a maximum of 17 cycles. Patients were stratified by choice of chemotherapy (cisplatin\n\nRESULTS: patients were randomly assigned from May 2019 to December 2023. The median OS was 36.1 months (95% CI, 28.1 to 42.5) for the CRT-alone arm and 31.1 months (95% CI, 28.5 to 44.7) for the CRT + atezolizumab arm, respectively (hazard ratio [HR], 1.03 [95% CI, 0.80 to 1.32]). The median PFS was 11.4 months (95% CI, 10.3 to 13.2) for the CRT-alone arm and 12.1 months (95% CI, 10.9 to 15.2) for the CRT + atezolizumab arm, respectively (HR, 0.98 [95% CI, 0.79 to 1.22]). The median DMFS was 13.0 months (95% CI, 11.3 to 18.2) for the CRT-alone arm and 16.8 months (95% CI, 12.1 to 21.6) for the CRT + atezolizumab arm (HR, 0.96 [95% CI, 0.76 to 1.21]). No unexpected safety signals with concurrent atezolizumab were observed.\n\nCONCLUSION: Concurrent and adjuvant atezolizumab with chemoradiation did not improve survival in patients with LS-SCLC."
    },
    {
      "pmid": "41539318",
      "doi": "10.1016/S1470-2045(25)00643-6",
      "title": "Aumolertinib as adjuvant therapy in resected EGFR-mutated non-small-cell lung cancer (ARTS): a double-blind, multicentre, randomised, controlled, phase 3 trial.",
      "journal": "The Lancet. Oncology",
      "pubdate": "2026-01-12T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41539318/",
      "url_doi": "https://doi.org/10.1016/S1470-2045(25)00643-6",
      "abstract": "BACKGROUND: Patients with resectable non-small-cell lung cancer (NSCLC), particularly those with EGFR mutations, face a high risk of recurrence and mortality post-surgery. Aumolertinib, a third-generation EGFR tyrosine-kinase inhibitor, is approved in China for adjuvant treatment in patients with NSCLC harbouring EGFR with an exon 19 deletion (ex19del) or exon 21 substitution (Leu858Arg) mutation. The ARTS study aimed to evaluate the efficacy and safety of adjuvant therapy with aumolertinib in patients with stage II-IIIB EGFR-mutated NSCLC.\n\nMETHODS: This double-blind, multicentre, randomised, controlled, phase 3 trial enrolled patients from 48 hospitals in mainland China. Eligible patients were 18 years or older with stage II-IIIB NSCLC, had undergone a complete resection followed by standard adjuvant therapy, and had an EGFR ex19del or Leu858Arg mutation and an Eastern Cooperative Oncology Group performance status score of 0 or 1. Patients were stratified by EGFR mutation status and tumour stage and were randomly assigned (1:1) to receive aumolertinib 110 mg or placebo orally, once daily for 3 years or until disease recurrence or other discontinuation criteria were met. Patients were randomly allocated to groups using an interactive web response system; the double‑dummy technique masked patients, investigators, and assessors. The primary endpoint was disease-free survival in the modified intention-to treat (mITT) population (ie, all patients with stage II-IIIB NSCLC harbouring EGFR mutations who had undergone complete tumour resection and standard adjuvant therapy), assessed by blinded independent central review (BICR). Safety was assessed in all patients who received at least one dose of study treatment. Although the study is ongoing, with some patients remaining in follow-up, this analysis represents the protocol-specified primary analysis. This study is registered with ClinicalTrials.gov (NCT04687241).\n\nFINDINGS: Between April 30, 2021, and May 17, 2022, 399 individuals were screened for study eligibility; of these, 214 patients were randomly assigned to receive aumolertinib or placebo (107 in each group). 120 (56%) patients were female, 94 (44%) were male, median age was 59 years (IQR 54-66), and all patients were Chinese. 204 (95%) of 214 patients had received prior adjuvant chemotherapy. One patient in the aumolertinib group and three patients in the placebo group had stage I disease; therefore, 106 patients in the aumolertinib group and 104 in the placebo group were included in the mITT (primary analysis) population. As of the data cutoff date (April 15, 2024), the median duration of follow-up was 27·56 months (IQR 22·18-27·70) in the aumolertinib group and 27·63 months (22·18-27·79) in the placebo group. The BICR-assessed disease-free survival was significantly improved in the aumolertinib group compared with the placebo group, with an HR of 0·17 (95% CI 0·09-0·29, p<0·0001). The median disease-free survival per BICR in the aumolertinib group was not reached (95% CI 29·14 to not applicable), whereas it was 19·42 months (11·24-26·22) in the placebo group. The most common grade 3-4 adverse events in the aumolertinib group versus the placebo group were increased blood creatine phosphokinase (seven [7%] vs none), prolonged electrocardiogram QT interval (three [3%] vs three [3%]), hypertension (one [1%] vs five [5%]), and pneumonia (two [2%] vs three [3%]). Treatment-related serious adverse events occurred in one (1%) patient receiving aumolertinib and three (3%) patients receiving placebo. No treatment-related deaths occurred and no new safety signals were identified for aumolertinib.\n\nINTERPRETATION: Aumolertinib showed substantial clinical benefits as adjuvant therapy in Chinese patients with stage II-IIIB EGFR-mutated NSCLC. The manageable safety profile of aumolertinib supports its suitability in the adjuvant setting.\n\nFUNDING: Hansoh Pharmaceutical Group.\n\nTRANSLATION: For the Chinese translation of the abstract see Supplementary Materials section."
    },
    {
      "pmid": "41534788",
      "doi": "10.1016/j.jtho.2026.01.001",
      "title": "Osimertinib and stereotactic radiosurgery for brain metastases in EGFR mutated lung cancer - The STARLET joint analysis of OUTRUN and LUOSICNS randomised trials.",
      "journal": "Journal of thoracic oncology : official publication of the International Association for the Study of Lung Cancer",
      "pubdate": "2026-01-12T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41534788/",
      "url_doi": "https://doi.org/10.1016/j.jtho.2026.01.001",
      "abstract": "INTRODUCTION: Clinical guidelines recommend upfront osimertinib monotherapy for asymptomatic brain metastases (BM) in epidermal growth factor receptor (EGFR) mutant non-small cell lung cancer (NSCLC), despite a lack of randomised trial evidence. We conducted two randomised phase II trials, OUTRUN and LUOSICNS, to evaluate the efficacy and safety of upfront stereotactic radiosurgery (SRS) plus osimertinib versus osimertinib in this patient population.\n\nMETHODS: Participants with up to ten BM amenable to SRS were randomised 1:1 to SRS followed by osimertinib (80mg daily) or osimertinib monotherapy. SRS was delivered as a single or multi-fraction regimen. The primary endpoint was 12-month intracranial progression-free survival (ic-PFS). Key secondary endpoints include overall survival (OS), patterns of intracranial progression, and safety. Data from both trials were prospectively pooled for a joint analysis.\n\nRESULTS: Overall, 79 participants were randomised. At a median follow-up of 39.0 months, 12-month ic-PFS was not significantly different between SRS plus osimertinib (n = 39) over osimertinib monotherapy (n = 40) (11%, 95% CI, -10% to 32%, P=.31; median ic-PFS 21.9 versus 17.2 months). Median OS was 46.1 versus 29.1 months. Among those with intracranial progression, 35% in the SRS plus osimertinib group and 57% in the osimertinib monotherapy group underwent SRS at progression. Grade 3/4 radionecrosis occurred in 5% of participants treated with SRS plus osimertinib.\n\nCONCLUSIONS: Adding upfront SRS to osimertinib did not significantly improve 12-month ic-PFS in EGFR mutant NSCLC with BM. This represents the first randomised evidence supporting the use of osimertinib monotherapy as upfront therapy in minimally symptomatic patients with low burden BM."
    },
    {
      "pmid": "41534787",
      "doi": "10.1016/j.jtho.2026.01.002",
      "title": "Changes in Cardiac Function in Patients Receiving Radiation Therapy for Lung Cancer.",
      "journal": "Journal of thoracic oncology : official publication of the International Association for the Study of Lung Cancer",
      "pubdate": "2026-01-12T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41534787/",
      "url_doi": "https://doi.org/10.1016/j.jtho.2026.01.002",
      "abstract": "INTRODUCTION: The cardiovascular toxicity of radiation therapy (RT) remains incompletely understood in patients with non-small cell lung cancer (NSCLC). Our objective was to define changes in echocardiographic parameters of structure and function with RT and their associations with cardiac dose-volume metrics.\n\nMETHODS: This multi-center, longitudinal prospective cohort study included participants with NSCLC who received standard, curative-intent thoracic RT. Dose-volume metrics were extracted from centrally contoured cardiac substructures. Echocardiograms at baseline, end of RT, six months post-RT, and 12 months post-RT were core lab-quantified. Repeated-measures multivariable linear regression via generalized estimating equations estimated changes in echocardiographic measures and associations with dose-volume metrics.\n\nRESULTS: Across 125 participants, there was a modest worsening in left ventricular ejection fraction (LVEF) (p=0.019), global longitudinal strain (p<0.001), circumferential strain (p<0.001), and Ea/Ees (p=0.011) post-RT that largely recovered by 12 months. Cardiac dysfunction, defined as LVEF declines of ≥10% to <50%, occurred in 7.2% of participants at a median of 1.7 months after RT initiation. Mean heart dose (MHD) was associated with LVEF declines (-1.1%, 95% confidence interval (CI) [-2.2,0.0] per interquartile range (IQR) increase, p=0.044), as was whole heart V30 (-1.4%, 95%CI[-2.5,-0.3] per IQR increase, p=0.015); with multiple comparisons adjustment, whole heart V30 remained significant (p=0.030).\n\nCONCLUSIONS: On average, there were modest changes in cardiac function immediately after RT in patients with NSCLC, with a subset experiencing clinically relevant cardiac dysfunction. While whole heart V30 was associated with LVEF declines, suggesting its relevance in RT planning, there is also a need for newer dose-volume measures."
    },
    {
      "pmid": "41526205",
      "doi": "10.1016/j.lungcan.2026.108909",
      "title": "Corrigendum to \"Global trends in lung cancer incidence and mortality by age, gender and morphology and forecast: A bootstrap-based analysis\". [Lung Cancer 205 (2025) 108626].",
      "journal": "Lung cancer (Amsterdam, Netherlands)",
      "pubdate": "2026-01-11T00:00:00+00:00",
      "pubtypes": [
        "Published Erratum"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://www.lungcancerjournal.info/article/S0169-5002(26)00004-8/pdf",
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41526205/",
      "url_doi": "https://doi.org/10.1016/j.lungcan.2026.108909",
      "abstract": null
    }
  ]
}