{
  "generated": "2025-10-28T05:18:12.416355Z",
  "items": [
    {
      "pmid": "41135519",
      "doi": "10.1016/j.ccell.2025.09.012",
      "title": "TROP-2-targeted antibody-drug conjugate SHR-A1921 for advanced or metastatic solid tumors: A first-in-human phase 1 study.",
      "journal": "Cancer cell",
      "pubdate": "2025-10-23T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": "SJR",
      "metric_value": 19.027,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41135519/",
      "url_doi": "https://doi.org/10.1016/j.ccell.2025.09.012",
      "abstract": "This study is a first-in-human, three-stage, phase 1 trial (NCT05154604) designed to evaluate the trophoblast cell-surface antigen 2 (TROP-2)-targeted antibody-drug conjugate SHR-A1921 (1.5-6.0 mg/kg every 3 weeks) in 391 patients with pretreated advanced/metastatic solid tumors. Grade ≥3 treatment-related adverse events occurred in 132 patients (33.8%), with the most common being stomatitis, affecting 57 patients (14.6%). SHR-A1921 showed a low incidence of hematologic toxicities, with only 3.1% of patients experiencing grade ≥3 decreases in neutrophil count. The overall objective response rate was 24.8% (95% confidence interval [CI], 20.6-29.4), ranging from 18.2% to 43.1% across cohorts with platinum-resistant ovarian cancer, triple-negative breast cancer, small-cell lung cancer, non-small cell lung cancer, hormone receptor-positive breast cancer, cervical cancer, and biliary tract cancer. No significant correlation was found between TROP-2 expression and treatment efficacy. In summary, SHR-A1921 exhibited promising antitumor activity and a manageable safety profile, with 3.0 mg/kg every 3 weeks selected for further clinical development."
    },
    {
      "pmid": "41129671",
      "doi": "10.1158/0008-5472.CAN-24-4162",
      "title": "PRMT3 Drives IDO1-Dependent Radioresistance and Immunosuppression by Promoting Kynurenine Metabolism in Non-Small Cell Lung Cancer.",
      "journal": "Cancer research",
      "pubdate": "2025-10-23T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://aacrjournals.org/cancerres/article-pdf/doi/10.1158/0008-5472.CAN-24-4162/3664817/can-24-4162.pdf",
      "metric_name": "SJR",
      "metric_value": 3.879,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41129671/",
      "url_doi": "https://doi.org/10.1158/0008-5472.CAN-24-4162",
      "abstract": "Radioresistance is one of the primary causes of treatment failure in non-small cell lung cancer (NSCLC). In this study, we identified PRMT3 within tumors as a critical mediator impairing both radiotherapy sensitivity and T-cell anti-tumor activity. In tumor cells, PRMT3 mediated arginine methylation of transcription factor TFAP2A, enhancing its binding to the IDO1 promoter. Methylated TFAP2A exhibited a prolonged half life, increased nuclear localization, and enhanced dimer formation, which ultimately led to heightened IDO1 expression that enhanced synthesis of kynurenine (Kyn). The elevated Kyn production boosted radioresistance in tumor cells and suppressed the infiltration and function of CD8+ T cells by activating aryl hydrocarbon receptors (AhR). Interestingly, combined pharmacological inhibition of PRMT3 and IDO1 effectively disrupted the TFAP2A-IDO1-Kyn axis, overcoming radioresistance, activating anti-tumor immunity, and ultimately eradicating tumors. In conclusion, these findings delineate PRMT3-mediated Kyn metabolism as a mechanism of radioresistance and immune evasion in NSCLC, offering valuable insights for potential interventions for treating lung cancer patients."
    },
    {
      "pmid": "40189749",
      "doi": "10.1080/2162402X.2025.2484880",
      "title": "Surrogate markers of intestinal dysfunction associated with survival in advanced cancers.",
      "journal": "Oncoimmunology",
      "pubdate": "2025-12-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://doi.org/10.1080/2162402x.2025.2484880",
      "metric_name": "SJR",
      "metric_value": 2.542,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40189749/",
      "url_doi": "https://doi.org/10.1080/2162402X.2025.2484880",
      "abstract": "Deviations in the diversity and composition of the gut microbiota are called \"gut dysbiosis\". They have been linked to various chronic diseases including cancers and resistance to immunotherapy. Stool shotgun based-metagenomics informs on the ecological composition of the gut microbiota and the prevalence of homeostatic bacteria such as"
    },
    {
      "pmid": "40650354",
      "doi": "10.1002/ijc.70045",
      "title": "Stage- and histology-specific sensitivity for the detection of lung cancer of the NELSON screening protocol-A modeling study.",
      "journal": "International journal of cancer",
      "pubdate": "2025-12-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://onlinelibrary.wiley.com/doi/pdfdirect/10.1002/ijc.70045",
      "metric_name": "SJR",
      "metric_value": 2.252,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40650354/",
      "url_doi": "https://doi.org/10.1002/ijc.70045",
      "abstract": "The Dutch-Belgian lung cancer (LC) screening trial (Nederlands-Leuvens Longkanker Screenings Onderzoek [NELSON]) demonstrated low-dose computed tomography (CT) reduces LC mortality by 24% among men. The NELSON protocol differed from previous trials in the eligibility criteria, the use of volume-based nodule management, and increasing screening intervals. The early-stage sensitivity of the protocol is pivotal in determining the optimal screening strategy, such as the interval and age range. The MIcrosimulation SCreening ANalysis-Lung natural history model was used to reproduce LC incidence and mortality by detection method (clinical or screen-detected), sex, histology, and stage in the NELSON trial based on individual-level data. We evaluated screening effectiveness by stage and histology, accounting for population characteristics, trial design, and LC epidemiology. We find stage IA non-small cell LC (NSCLC) sensitivity of 24.6% (other NSCLC) to 41.0% (adenocarcinoma) at baseline screening. At repeat screening rounds, we find this increased to 70.9% for stage IA adenocarcinoma. For stage IB, the sensitivity by histology ranges from 26.4% to 77.1%; for stage II, 39.6%-81.9%. Upon detection, the probability of LC mortality prevention is estimated at 83% for stage IA. The sensitivity for detecting early-stage LC is found to depend on the histology of cancer and is increased for adenocarcinoma at repeat screenings. Despite a low rate of referral to follow-up screening in the NELSON trial, early-stage CT sensitivity and the probability of mortality prevention were similar to previous estimates from the National Lung cancer Screening Trial. Previously demonstrated screening effectiveness may be maintained when implementing new programs, while reducing unnecessary follow-up when considering NELSON evidence."
    },
    {
      "pmid": "40885626",
      "doi": "10.1016/j.cllc.2025.08.002",
      "title": "Brief Report: Safety of Pulse-Dose Osimertinib for Treatment of Leptomeningeal Disease or Refractory Brain Metastases in EGFR-Mutated Nonsmall Cell Lung Cancer.",
      "journal": "Clinical lung cancer",
      "pubdate": "2025-11-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article",
        "Multicenter Study"
      ],
      "entity": "SCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": "SJR",
      "metric_value": 1.515,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40885626/",
      "url_doi": "https://doi.org/10.1016/j.cllc.2025.08.002",
      "abstract": "PURPOSE: EGFR-mutated (EGFRm) NSCLC is associated with high incidence of brain metastases and leptomeningeal disease (LMD), for which effective systemic options beyond osimertinib 80 and 160 mg daily are limited. While there is some evidence for high-dose pulse administration of earlier-generation EGFR tyrosine kinase inhibitors (EGFK-TKIs), data for pulse-dose osimertinib are limited.\n\nMETHODS: This multicenter retrospective case series included patients with EGFRm NSCLC with LMD or parenchymal brain metastases treated with pulse-dose osimertinib (400-560 mg once every 5-7 days) for central nervous system (CNS) progression, with or without other concurrent therapies. CNS disease control was defined as the interval from pulse-dose osimertinib initiation to radiographic progression or discontinuation for clinical progression, whichever was shorter.\n\nRESULTS: Among 14 patients, EGFR mutations included exon 19 deletion in 6, L858R in 6, and other mutations in 4. All had received previous EGFR-TKI including 5 with prior osimertinib 160 mg daily. Seven received pulse-dose osimertinib as monotherapy, while the remainder received it in combination with other systemic therapy and/or CNS radiation. No treatment-related severe or unexpected side effects were reported, and only 1 patient required dose modification for adverse events. Median duration of CNS control was 4.0 months (95% CI, 1.8-NR) and median overall survival was 6.2 months (95% CI, 3.2-NR), with benefit driven by patients without previous osimertinib 160 mg daily exposure.\n\nCONCLUSION: Though further pharmacokinetic investigation is warranted, this report provides preliminary evidence that pulse-dose osimertinib may be a safe regimen among patients with EGFRm NSCLC and refractory CNS disease."
    },
    {
      "pmid": "40738833",
      "doi": "10.1016/j.cllc.2025.07.003",
      "title": "The Italian Mauris Phase IIIb Trial of Atezolizumab Plus Carboplatin and Etoposide for Patients With Newly Diagnosed Extensive-Stage Small Cell Lung Cancer: 3-Year End-of-Study Results.",
      "journal": "Clinical lung cancer",
      "pubdate": "2025-11-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article",
        "Multicenter Study"
      ],
      "entity": "SCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://www.clinical-lung-cancer.com/article/S1525-7304(25)00147-0/pdf",
      "metric_name": "SJR",
      "metric_value": 1.515,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40738833/",
      "url_doi": "https://doi.org/10.1016/j.cllc.2025.07.003",
      "abstract": "BACKGROUND: Atezolizumab combined to carboplatin and etoposide prolonged survival in the IMpower133 trial of untreated extensive-stage small-cell lung cancer (ES-SCLC). Aim of this analysis is to provide end-of-study results from the phase IIIb MAURIS study on the efficacy and safety of atezolizumab plus chemotherapy in the same disease setting, in a patient population with broader inclusion criteria.\n\nMATERIALS AND METHODS: MAURIS is a multicentric, open-label, single-arm study conducted between 2019 and 2023 in 25 Italian study centres. A total of 155 patients with untreated ES-SCLC were enrolled. Treatment was based on atezolizumab 1200 mg + carboplatin + etoposide every 21 days, for 4 to 6 cycles, during the induction phase, and atezolizumab every 3 weeks during the maintenance phase. Safety, overall survival (OS) and progression-free survival (PFS) were among study endpoints.\n\nRESULTS: The median OS at end of study was 10.6 months, with OS rates of 45.5% at 1 year, 31.0% at 1.5 years, 17.1% at 2 years and 14.5% at 3 years. The median PFS was 5.5 months. Serious adverse events (AEs) occurred in 38.3% of patients, treatment-related serious AEs in 21.4%, and immuno-mediated treatment-emergent AEs in 26.6% of patients. Immune-mediated grade 3 to 4 AEs were inversely related with mortality (hazard ratio, HR = 0.36; 95% confidence interval, CI: 0.13-0.97) in a multivariate analysis.\n\nCONCLUSION: This study showed consistent findings with the IMpower133 trial on the safety and efficacy of atezolizumab plus chemotherapy in first-line treatment of ES-SCLC. Long-term survival of a subgroup of patients was also confirmed."
    },
    {
      "pmid": "40168159",
      "doi": "10.1080/17581966.2025.2477411",
      "title": "The association between blood-based HYAL2 methylation and early-stage lung cancer: a case-control study.",
      "journal": "Lung cancer management",
      "pubdate": "2025-12-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": true,
      "oa_url": "https://doi.org/10.1080/17581966.2025.2477411",
      "metric_name": "SJR",
      "metric_value": 0.506,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40168159/",
      "url_doi": "https://doi.org/10.1080/17581966.2025.2477411",
      "abstract": "BACKGROUND: Blood-based DNA methylation biomarkers have great potential for the early detection of lung cancer (LC). Here, we investigated the association between\n\nMETHODS: Matrix-assisted laser desorption ionization time-of-flight (MALDI-TOF) mass spectrometry was performed to measure the methylation levels of 4 CpG sites in\n\nRESULTS: Hypomethylation of all 4 CpG sites in\n\nCONCLUSIONS: Our results suggested blood-based"
    },
    {
      "pmid": "40581332",
      "doi": "10.1016/j.ijrobp.2025.06.3854",
      "title": "Treatment Toxicity and Outcomes Following Definitive Radiation Therapy for Patients With Early-Stage Non-Small Cell Lung Cancers and Pre-Existing Interstitial Lung Disease-A Systematic Review and Dosimetric Analysis.",
      "journal": "International journal of radiation oncology, biology, physics",
      "pubdate": "2025-11-15T00:00:00+00:00",
      "pubtypes": [
        "Journal Article",
        "Review"
      ],
      "entity": "NSCLC",
      "trial_type": "Review/Meta",
      "study_class": "Review",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40581332/",
      "url_doi": "https://doi.org/10.1016/j.ijrobp.2025.06.3854",
      "abstract": "BACKGROUND: Patients with interstitial lung disease (ILD) who develop lung cancer represent a unique challenge, as they are at higher risk for serious toxicity from local and systemic therapies. The aim of this study is to provide an up-to-date analysis on toxicities and outcomes associated with definitive radiation therapy (RT) in patients with ILD and early-stage non-small cell lung cancer (ES-NSCLC).\n\nMETHODS AND MATERIALS: We performed a systematic review in accordance with Preferred Reporting Items for Systematic Reviews and Meta-Analyses (PRISMA) guidelines. The PubMed (MEDLINE), EMBASE, and Cochrane Library databases were searched from inception until June 2024, for studies including patients with ILD who underwent definitive RT alone for ES-NSCLC. Data including treatment-related mortality, toxicity, local control, and overall survival were collected and analyzed.\n\nRESULTS: Of 3545 records reviewed, 24 studies were identified for full data abstraction, contributing a total of 705 patients. A specific ILD subtype was not reported for 71% (n = 502) of patients. ILD severity was not reported for 62% (n = 440) of patients. Risk of treatment-related mortality was 7.9%, with severe treatment-related respiratory toxicity 15.7%. A higher volume of lung receiving ≥5 Gy (V5) was significantly correlated with mortality. The estimated local control at 3 year was 76% and median overall survival was 2.5 years.\n\nCONCLUSIONS: The relative merits of RT for the treatment of ES-NSCLC in patients with ILD should be considered in the context of the rates of treatment-related mortality and toxicity. Future studies would benefit from consistent reporting of ILD characteristics, which may help in risk stratification in this challenging clinical scenario."
    },
    {
      "pmid": "40962011",
      "doi": "10.1016/j.ejphar.2025.178168",
      "title": "Prognostic implications of antitumour efficacy and adverse events of EGFR-TKIs in non-small cell lung cancer: an ambispective cohort study.",
      "journal": "European journal of pharmacology",
      "pubdate": "2025-11-05T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40962011/",
      "url_doi": "https://doi.org/10.1016/j.ejphar.2025.178168",
      "abstract": "The objective of this study was to quantify the impact of longitudinal tumour dynamics, time-varying drug-related adverse events (DRAEs), and other clinical characteristics on long-term outcomes in patients with non-small cell lung cancer (NSCLC) treated with epidermal growth factor receptor tyrosine kinase inhibitors (EGFR-TKIs). An ambispective cohort of 277 patients was analysed and externally validated using independent clinical trial data from 470 patients in the Project Data Sphere. Individual tumour growth trajectories were characterised by predicted sum of the longest diameters (SLD) using tumour growth inhibition (TGI) modelling. Time-dependent Cox and parametric time-to-event models were then applied to evaluate the influence of predicted tumour growth trajectories, observed dynamic DRAE profiles, cross-sectional variables derived from these measures, and additional covariates on time-to-treatment failure (TTF) and progression-free survival (PFS). The TGI models effectively captured individual tumour dynamics. Across both Cox and parametric time-to-event models, prognostic factors consistently included DRAEs, baseline metastasis, EGFR-TKI treatment history, and the specific EGFR-TKI administered. Notably, grade 2 DRAEs were associated with an optimal balance between efficacy and safety, and this association remained robust in sensitivity analyses and was preliminarily validated using external data. These findings emphasise the clinical relevance of DRAE grades in indicating long-term clinical benefit. By linking manageable toxicity with durable therapeutic outcomes, the study provides valuable insights for developing safe and effective EGFR-TKI treatment strategies in patients with NSCLC."
    },
    {
      "pmid": "40813911",
      "doi": "10.1038/s41571-025-01061-7",
      "title": "Treatment of NSCLC after chemoimmunotherapy - are we making headway?",
      "journal": "Nature reviews. Clinical oncology",
      "pubdate": "2025-11-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article",
        "Review"
      ],
      "entity": "NSCLC",
      "trial_type": "Review/Meta",
      "study_class": "Review",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40813911/",
      "url_doi": "https://doi.org/10.1038/s41571-025-01061-7",
      "abstract": "The treatment landscape of non-small-cell lung cancer (NSCLC) has evolved considerably with the integration of immune-checkpoint inhibitors (ICIs) into first-line regimens. However, the majority of patients will ultimately have primary resistance or develop secondary resistance, driven by a complex interplay of intrinsic tumour biology and adaptive changes within the tumour microenvironment (TME), which can be further amplified by host-related factors such as dysbiosis and organ-specific conditions. Despite these heterogeneous origins, most mechanisms of resistance to ICIs lead to an immunosuppressive TME as the final common pathway. Consequently, current strategies designed to overcome resistance aim to restore antitumour immunity via antibody-based therapies (including bispecific antibodies, T cell engagers and antibody-drug conjugates), targeted therapies, adoptive cell therapies, therapeutic vaccines or intratumoural immunotherapies. Although substantial progress has been made in identifying potential biomarkers associated with immune resistance, the clinical relevance of many of these observations remains limited. Biomarker-driven studies using adaptive, hypothesis-generating designs might offer a promising path forward by navigating the complexity of resistance and enabling the timely evaluation of novel therapeutic concepts. In this Review, we summarize the latest advances in addressing resistance to ICIs in patients with advanced-stage NSCLC and provide insights into emerging clinical strategies and future research directions."
    },
    {
      "pmid": "40957950",
      "doi": "10.1038/s41388-025-03571-1",
      "title": "PLK1-mediated PDHA1 phosphorylation drives metabolic reprogramming in lung cancer.",
      "journal": "Oncogene",
      "pubdate": "2025-11-01T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/40957950/",
      "url_doi": "https://doi.org/10.1038/s41388-025-03571-1",
      "abstract": "Although the involvement of polo-like kinase 1 (PLK1) in metabolic reprogramming from oxidative phosphorylation (OXPHOS) to glycolysis has been previously described, the underlying molecular mechanism remains unclear. Pyruvate dehydrogenase (PDH) catalyzes the conversion of pyruvate into acetyl-CoA, the starting material for the tricarboxylic acid (TCA) cycle. In a companion study by Zhang et al., we demonstrated that PLK1 phosphorylation of PDHA1 at threonine 57 (PDHA1-T57) drives its protein degradation via mitophagy activation. Using a stable-isotope resolved metabolomics (SIRM) approach, we now show that PLK1 phosphorylation of PDHA1-T57 results in metabolic reprogramming from OXPHOS to glycolysis. Notably, cells mimicking PDHA1-T57 phosphorylation rely more on the aspartate-malate shuttle than on glucose-derived pyruvate to sustain the TCA cycle. This metabolic shift was also observed in mouse embryonic fibroblasts (MEFs) and transgenic mice conditionally expressing the PDHA1-T57D variant, highlighting the role of PLK1 in metabolic reprogramming in vivo. It is well-established that pyruvate dehydrogenase kinase (PDK)-mediated phosphorylation of PDH leads to its inactivation and that dichloroacetic acid (DCA), a PDK inhibitor, has been investigated in preclinical and early clinical studies as a potential therapeutic agent for lung cancer. We demonstrated that DCA combined with Onvansertib, a PLK1 inhibitor, synergistically inhibits lung tumor growth by enhancing mitochondrial ROS, inhibiting glycolysis, and inducing apoptosis. This study aims to elucidate how PLK1-associated activity drives the metabolic reprogramming from OXPHOS to glycolysis during cellular transformation, thereby contributing to lung carcinogenesis. Our results provide support for a clinical trial to evaluate the efficacy of Onvansertib plus DCA in treating lung cancer."
    },
    {
      "pmid": "41143757",
      "doi": "10.1016/j.jtho.2025.10.004",
      "title": "Corrigendum to 'Impact of concurrent genomic alterations on clinical outcomes in patients with ALK-rearranged non-small cell lung cancer' [Journal of Thoracic Oncology, Volume 19 Issue 1 (2024) 119-129].",
      "journal": "Journal of thoracic oncology : official publication of the International Association for the Study of Lung Cancer",
      "pubdate": "2025-10-27T00:00:00+00:00",
      "pubtypes": [
        "Published Erratum"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Preclinical",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41143757/",
      "url_doi": "https://doi.org/10.1016/j.jtho.2025.10.004",
      "abstract": null
    },
    {
      "pmid": "41145016",
      "doi": "10.1016/j.lungcan.2025.108804",
      "title": "Prognostic impact of pleural lavage cytology in EGFR-stratified resected non-small cell lung cancer.",
      "journal": "Lung cancer (Amsterdam, Netherlands)",
      "pubdate": "2025-10-23T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "NSCLC",
      "trial_type": null,
      "study_class": "Preclinical",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41145016/",
      "url_doi": "https://doi.org/10.1016/j.lungcan.2025.108804",
      "abstract": "INTRODUCTION: Positive pleural lavage cytology (PLC) indicates microscopic pleural dissemination and is associated with poor prognosis; however, it is not incorporated into the current TNM staging system and rarely guides adjuvant therapy. The prognostic importance of PLC positivity in patients with EGFR-mutated non-small cell lung cancer (NSCLC) remains unclear.\n\nMETHODS: We retrospectively analyzed clinical data from 576 patients with pathological stage I-IIIA NSCLC who underwent curative resection between 2012 and 2019. PLC was performed intraoperatively by washing the tumor surface with saline. Prognosis associated with PLC status was compared between the PLC-positive and PLC-negative groups in the overall cohort and within the EGFR-mutated (n = 188) and wild-type (n = 370) subgroups. Recurrence-free survival (RFS) and overall survival (OS) were assessed by Kaplan-Meier and Cox analysis.\n\nRESULTS: PLC positivity was observed in 30 patients (5.2 %) and was significantly associated with advanced pathological stage and pleural, vascular, and lymphatic invasion (p < 0.05). PLC-positive patients had significantly shorter RFS and OS in the overall cohort (23.3 and 60.0 months, respectively; both p < 0.001) and in both the EGFR-mutated subgroup and the wild-type subgroup. The multivariate analysis confirmed that PLC positivity was an independent predictor for poor RFS (HR 2.13, 95 % CI: 1.27-3.59, p = 0.0043) and OS (HR 1.77, 95 % CI: 1.00-3.13, p = 0.0484).\n\nCONCLUSIONS: PLC positivity was identified as an independent prognostic indicator of RFS and indicated biological aggressiveness that approximated stage III disease in terms of early recurrence. PLC-positive, EGFR-mutated patients might benefit from adjuvant osimertinib therapy, as supported by ADAURA findings, although prospective validation is needed."
    },
    {
      "pmid": "41139066",
      "doi": "10.1016/j.jtho.2025.10.012",
      "title": "Phase 2 study of amivantamab plus lazertinib in previously-treated patients with EGFR mutant lung cancers with brain and leptomeningeal metastases.",
      "journal": "Journal of thoracic oncology : official publication of the International Association for the Study of Lung Cancer",
      "pubdate": "2025-10-23T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Other",
      "is_oa": false,
      "oa_url": null,
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41139066/",
      "url_doi": "https://doi.org/10.1016/j.jtho.2025.10.012",
      "abstract": "BACKGROUND: Despite improved central nervous system (CNS) disease control with osimertinib, 20% of patients will develop CNS progression. Amivantamab and lazertinib have demonstrated activity in patients with EGFR-mutant lung cancer. This trial evaluated amivantamab and lazertinib in patients with new or progressive CNS metastases after prior therapy (NCT04965090).\n\nMETHODS: We evaluated amivantamab and lazertinib in 2 cohorts: patients with 1) brain metastases (BrM) or 2) leptomeningeal disease (LMD) diagnosed by cytology in patients with lung cancers with sensitizing EGFR-activating mutations or exon 20 insertions. The primary endpoint was composite best overall response rate (ORR) per RECIST v 1.1 and RANO-BM or -LM. Secondary endpoints were toxicity, systemic ORR, CNS ORR, time on treatment (ToT), progression-free survival (PFS), CNS PFS, and overall survival (OS).\n\nRESULTS: We treated 20 pts with BrM and 21 pts with LMD. 41% had EGFR del19, 37% L858R, 12% ex20ins, and 10% uncommon mutations. Median lines of prior therapy: 2 (range 1-7). The ORR by a combination of RECIST and RANO-BM/RANO-LM respectively for pts with BrM was 50% (95% CI, 27-73%) and 33% (95% CI, 15-57%) for pts with LMD. The median PFS was 5.8 months (95% CI 3.6-not reached (NR)) and 7.8 months (95% CI 4.2-12.2) for the BrM and LMD cohorts respectively. Median OS was 17.4 months (15.4-NR) in the BrM cohort and 14.4 months (8.9-NR) in the LMD cohort.\n\nCONCLUSIONS: Amivantamab+lazertinib has anti-tumor activity in patients with EGFR-mutant lung cancers who develop new or progressing brain or leptomeningeal metastases. This trial demonstrates the feasibility of including patients with LMD in prospective clinical trials."
    },
    {
      "pmid": "41135642",
      "doi": "10.1016/j.jtho.2025.10.010",
      "title": "Advancing Lung Cancer Staging: Integrating IASLC Recommendations and Bioinformatics to Delineate Tumor Origins.",
      "journal": "Journal of thoracic oncology : official publication of the International Association for the Study of Lung Cancer",
      "pubdate": "2025-10-22T00:00:00+00:00",
      "pubtypes": [
        "Journal Article"
      ],
      "entity": "Thoracic-other",
      "trial_type": null,
      "study_class": "Preclinical",
      "is_oa": true,
      "oa_url": "https://doi.org/10.1016/j.jtho.2025.10.010",
      "metric_name": null,
      "metric_value": null,
      "url_pubmed": "https://pubmed.ncbi.nlm.nih.gov/41135642/",
      "url_doi": "https://doi.org/10.1016/j.jtho.2025.10.010",
      "abstract": "INTRODUCTION: Accurate distinction between separate primary lung carcinomas (SPLCs) and intrapulmonary metastases (IPMs) is essential for staging and treatment of multifocal non-small cell lung carcinoma (NSCLC). Next-generation sequencing (NGS) enables assessment of clonal relatedness. The proposed IASLC algorithm integrates histological and molecular data, though its clinical utility is yet to be validated.\n\nMETHODS: We focused on the molecular component of the algorithm and assessed 240 tumor pairs from 120 patients with formalin-fixed paraffin-embedded (FFPE) tumor samples that underwent small-scale gene panel NGS testing (31-54 genes) within routine clinical care. Most tumors were adenocarcinomas (n=222), 18 tumors other NSCLC subtypes. Inconclusive pairs by molecular classification were subjected to large-scale panel analyses (531 genes). Additionally, we developed a bioinformatic method to complement and refine the IASLC method.\n\nRESULTS: In total 22 tumor pairs (18%) remained inconclusive and 16 (13%) were classified ambiguous (probable SPLCs) using the molecular IASLC method. Re-sequencing classified 9 of 22 inconclusive pairs as IPMs. Using a newly developed bioinformatic method for clonality classification incorporating likelihood ratios of mutational prevalence and small-scale sequencing, only 3 pairs remained inconclusive (2%). Tumors classified as SPLCs had a significantly longer overall survival than IPMs.\n\nCONCLUSIONS: Small-scale panel sequencing of biopsy material allows unambiguous clonality determination in 3 of 4 cases. Large-scale sequencing resolves about half of inconclusive cases. Our bioinformatic method reduces inconclusive pairs to 2% even with small-scale NGS. It is made publicly available as a Shiny App. Clonality is reflected in survival data and therefore pivotal in daily clinical practice."
    }
  ]
}